{"id": "1000157647", "title": "Senior/Lead DS (Рекомендательные системы)", "company": "GRI", "city": "Москва", "remote": false, "published_at": "2025-05-05T10:59:39+03:00", "skills": ["Pandas", "Python", "sql знание python", "основ теории вероятностей", "Старший (Senior)", "Ученый по данным", "Apache Airflow", "Flask", "SQL", "FastAPI", "математической статистики и машинного обучения", "ETL"], "url": "https://career.habr.com/vacancies/1000157647", "requirements": "Компания GRI в поисках Senior/Lead Data Scientist на проект по разработке рекомендательных систем. Чем предстоит заниматься: Отвечать за весь процесс разработки рекомендательных систем (видео, карточка товара) Разработка и обучение моделей машинного обучения Оценка эффективности моделей Разработка автоматизированных процессов обучения и прогнозирования моделей Интеграция моделей в рабочие системы API, ETL Работа со сторонними командами аналитики, инженерами данных и менеджерами от бизнеса Выявление скрытых закономерностей и трендов. Что мы ожидаем от тебя: Опыт от 3х лет в ecom/retail/video/streaming Опыт разработки рекомендательных систем, которые влияют на продажи Опыт взаимодействия с бизнесом для выявления бизнес требований Уверенное знание SQL Знание Python (pandas, scikit-learn, xgboost) Знание основ теории вероятностей, математической статистики и машинного обучения.", "conditions": "Что мы предлагаем: Интересная работа в аккредитованной ИТ-компании Действительно крутые проекты Современное оборудование Большое количество скидок от наших партнеров на спорт, обучение и питание"}
{"id": "1000144613", "title": "Lead/Senior Automation QA (Python or Java)", "company": "Группа Астра", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-05T10:41:46+03:00", "skills": ["Ведущий (Lead)", "Linux", "Python", "автоматизацией тестирования на python или java от 4", "CI/CD", "Docker", "методологий тестирования и процессов контроля качества умение работать с системами управления тестированием и отслеживания ошибок обязателен опыт работы с ос linux понимание agile", "Разработка тест-кейсов", "scrum обязанности", "Инженер по автоматизации тестирования", "Тестирование UI", "Java", "Тестирование API", "ручным тестированием знание методологий тестирования и процессов контроля качества умение работать с системами управления тестированием и отслеживания ошибок обязателен опыт работы с ос linux понимание agile"], "url": "https://career.habr.com/vacancies/1000144613", "requirements": "Ищем играющего тренера до набора команды, первое время выполнение функционала ведущего инженера по автоматизации (фронтенд, бэкенд), авто и ручное (при необходимости). Требования: Опыт работы с автоматизацией тестирования на Python или Java от 4-х лет (backend, frontend, файловая система) Опыт работы с ручным тестированием Знание методологий тестирования и процессов контроля качества Умение работать с системами управления тестированием и отслеживания ошибок Обязателен опыт работы с ОС Linux Понимание Agile, Scrum Обязанности: Создание и внедрение стратегии тестирования, соответствующей целям и задачам компании Внедрение и поддержка автоматизированных инструментов тестирования Набор, обучение и развитие команды QA Распределение задач и управление рабочими процессами внутри команды Оптимизация процессов тестирования для повышения эффективности и сокращения времени на тестирование Тесное взаимодействие с отделами разработки Отчетность о статусе тестирования, проблемах качества и рисках Мониторинг и анализ показателей качества Инициирование и руководство проектами по улучшению качества и процессов тестирования", "conditions": "Уверенность в будущем. Мы чтим ТК РФ: у нас стабильный и прозрачный \"белый\" доход, и полноценный соцпакет Забота о здоровье . Оформим полис ДМС со стоматологией График в твоем ритме. Мы здесь ради результата, а не процесса. Начинай свой рабочий день, когда тебе удобно, просто договорись с руководителем. У нас не принято стоять с секундомером на проходной, а вот пунктуальность на общих встречах мы ценим, так как бережно относимся к времени коллег​​​​"}
{"id": "1000144261", "title": "Системный инженер (Linux и виртуализация)", "company": "Cloud.ru", "city": "Москва", "employment": "Самара", "remote": false, "published_at": "2025-05-05T10:28:56+03:00", "skills": ["kubernetes", "Системный инженер", "Docker", "и опыт работы с openstack", "и опыт работы с astra linux", "alt linux", "и опыт работы с terraform", "администрирования linux", "Linux", "DevOps", "и опыт работы с kubernetes", "Bash", "бд postgresql", "astra linux", "Средний (Middle)", "Ansible", "Python", "и работы с платформой базис", "openstack", "Terraform", "terraform"], "url": "https://career.habr.com/vacancies/1000144261", "requirements": "Обязанности: Автоматизация развертывания и конфигурирования платформ виртуализации и операционных систем; Разработка сценариев Ansible для конфигурирования виртуальных машин и настройки сервисов; Написание и настройка сценариев Terraform для развертывания виртуальных машин; Добавление новых образов ОС, адаптация автоматизации к новым дизайнам подов; Управление процессами CI/CD на базе GitLab. Мы ждём, что вы: Имеете опыт разработки автоматизаций с использованием Python, Ansible, Terraform и других инструментов; Есть уверенные навыки администрирования Linux; Обладаете знаниями и опытом в области виртуализации и контейнеризации (kvm, libvirt, docker etc); А также есть знания SQL, включая опыт работы с БД PostgreSQL. Будет плюсом: Знание и опыт работы с Terraform; Знание и опыт работы с Kubernetes; Знание и опыт работы с OpenStack; Знания в области компьютерных сетей и маршрутизации, понимание работы NAT, Proxy, Load Balancer, Firewall, VXLAN, концепции Software Defined Network; Знание и опыт работы с Astra Linux, ALT Linux; Знание и работы с платформой Базис (basistech.ru).", "conditions": "Работа в Cloud.ru — это: Комфортная среда Оформление в соответствии с трудовым законодательством РФ Достойный уровень дохода: оклад + годовой бонус Расширенный ДМС со стоматологией Компенсация спорта Штатный терапевт и психолог Классный офис в Москве и коворкинги в разных городах России Возможность работать удаленно на территории РФ (зависит от функционала и позиции) Культура, в основе которой эмпатия, уважение, открытость и свобода строить рабочий процесс так, как считаешь нужным Полезные перекусы Место, где ты растешь Индивидуальный план развития и обучение за счет компании Возможность вертикального и горизонтального роста Возможность развиваться как эксперту: выступать на мероприятиях, писать статьи Крутая команда Профессиональные сообщества и клубы по интересам Неформальные мероприятия: от футбольного клуба до посиделок с пиццей Еще у нас Льготная программа ипотечного и потребительского кредитования Материальная помощь при рождении детей и других семейных обстоятельствах Бонусы за рекомендации кандидатов на открытые вакансии Бонусные программы от компаний партнеров"}
{"id": "1000152553", "title": "QA Backend", "company": "Т-Банк", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-05T10:27:32+03:00", "skills": ["Инженер по обеспечению качества", "Старший (Senior)", "Java", "Kotlin", "Python", "Тестирование API", "Тестирование ПО", "Автоматизация тестирования", "Обеспечение качества"], "url": "https://career.habr.com/vacancies/1000152553", "requirements": "Знаете теорию тестирования, есть опыт работы в тестировании от 4-х лет . Знаете тест-дизайн: умеете применять основные техники, составлять чек-листы и тест-планы под задачи. Знаете один из языков программирования: Java , Kotlin или Python . Знаете SQL (джойны, группировки, оконные функции). Умеете работать с API (rest/soap). Умеете работать с системами логирования: отчетами, алертами и дашбордами. Разбираетесь в Gitlab, работаете с пайплайнами и логами.", "conditions": "Гибридный режим работы: можно работать в уютном офисе или дома. Возможность работы в аккредитованной ИТ-компании. Три дополнительных дня отпуска в год. Достойную зарплату — обсудим ее на собеседовании."}
{"id": "1000157639", "title": "Python разработчик", "company": "Data Compass", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-05T10:00:26+03:00", "salary_from": 150000, "salary_to": 250000, "currency": "RUB", "skills": ["Linux", "Python", "PostgreSQL", "python", "Бэкенд разработчик", "Docker", "asyncpg или другими драйверами для асинхронного доступа", "Git", "Средний (Middle)"], "url": "https://career.habr.com/vacancies/1000157639", "requirements": "Сейчас мы в поиске человека, который бы попадал под следующее описание: 1. Уверенное знание Python. 2. Асинхронное программирование: опыт с asyncio, aiohttp, asyncpg или аналогичными инструментами. 3. Многопоточность и многопроцессность: работа с threading, multiprocessing, concurrent.futures. 4. Веб-парсинг: requests, BeautifulSoup, Selenium(undetected_chromedriver, etc.) умение грамотно использовать прокси, собирать данные, обходить защиту сайтов. 5. PostgreSQL: - Проектирование схем и оптимизация запросов; - Настройка индексов и тд; - Опыт работы с asyncpg или другими драйверами для асинхронного доступа. 6. Типизация кода: - Соблюдение PEP; - Использование линтеров для проверки стиля(мы используем Ruff со своей конфигурацией); - Поддержание полноты и корректности аннотаций. 7. Оптимизация производительности: профилирование Python-кода и запросов к БД, выявление “узких мест”. 8. REST API: понимание работы и опыт реализации. 9. Контроль версий и CI/CD: мы используем gitlab 11. Docker: контейнеризация сервисов и локальная разработка в контейнерах.", "conditions": "Нам нужен человек с ИП или самозанятый, оформление по договору."}
{"id": "1000144112", "title": "QA Engineer Fullstack (Python)", "company": "SimbirSoft", "city": "Ульяновск", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-05T09:57:03+03:00", "skills": ["Инженер по автоматизации тестирования", "Средний (Middle)", "SQL", "Python", "ООП", "REST", "Selenium", "Git", "Docker"], "url": "https://career.habr.com/vacancies/1000144112", "requirements": "Мы ищем специалиста с опытом ручного и авто-тестирования web-приложений, который понимает, что такое качественный программный продукт, хочет доводить его до совершенства и видеть результаты своего труда, а также расширять покрытие проекта автотестами. Обязанности: Анализировать требования Тестировать Web-приложения (frontend, backend) Локализовывать и документировать найденные дефекты Вести и оптимизировать тестовую документацию Тестировать API (REST, SOAP) Работать с базами данных Писать тесты по автоматизации на Python Требования: Опыт разработки автотестов от 2-х лет Умение работать с Selenium, Pytest Понимание REST API, HTTP/HTTPS Умение работать с GIT Умение работать с Docker Умение работать с DevTool", "conditions": "Удаленка в РФ, гибкий график, уютные офисы Белая зарплата, полный соцпакет, система бонусов Обучение и сертификация за счёт компании, изучение английского языка"}
{"id": "1000155070", "title": "Специалист по машинному обучению", "company": "ИТ-компания «Лоция»", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T19:30:10+03:00", "skills": ["Компьютерное зрение", "Python", "методов обработки и аугментации изображений", "ML разработчик", "Машинное обучение", "поиска и внедрения новых методов из научных публикаций", "Средний (Middle)", "PyTorch"], "url": "https://career.habr.com/vacancies/1000155070", "requirements": "опыт работы от 1-2 лет в сфере машинного обучения и компьютерного зрения; глубокое понимание современных подходов и методов в задачах детекции и сегментации (CNN, R-CNN, YOLO, DETR, Mask R-CNN и др.); умение работать с фреймворками глубокого обучения: TensorFlow, PyTorch; навыки поиска и внедрения новых методов из научных публикаций; опыт программирования на Python, ООП; знание методов обработки и аугментации изображений; умение работать в команде, коммуникабельность. Чем предстоит заниматься разработкой и оптимизацией моделей для задач детекции, сегментации и трекинга объектов; изучением современных научных статей и внедрение новых методов в работу; анализом и обработкой данных для обучения и тестирования моделей; сотрудничеством с командой разработчиков для интеграции решений в продукт.", "conditions": "удаленный режим работы 5/2; официальное оформление и белая зарплата; ДМС с первого дня со стоматологией."}
{"id": "1000150547", "title": "Python разработчик", "company": "DevTeam.Space", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T18:39:40+03:00", "salary_from": 1500, "salary_to": 3000, "currency": "USD", "skills": ["docker и kubernetes для контейнеризации и оркестрации сервисов", "базового html", "методами защиты", "Docker", "системами логирования и мониторинга", "javascript", "django orm", "Kubernetes", "реляционными", "PostgreSQL", "django rest framework", "CI/CD", "MongoDB", "включая асинхронное программирование", "FastAPI", "css", "Django", "работы с асинхронными задачами", "Фулстек разработчик", "работы с fastapi", "SQL", "будут плюсом", "MySQL", "Python", "микросервисной архитектуры и опыт её внедрения", "фронтенд"], "url": "https://career.habr.com/vacancies/1000150547", "requirements": "Опыт работы не менее 5 лет в веб-разработке на Python. Знания Django и практический опыт работы с Django ORM, Django Rest Framework. Уверенные навыки работы с FastAPI, включая асинхронное программирование. Опыт работы с реляционными (PostgreSQL, MySQL) и NoSQL базами данных (MongoDB, Redis). Умение работать с системами контроля версий (Git). Знание микросервисной архитектуры и опыт её внедрения. Опыт работы с Docker и Kubernetes для контейнеризации и оркестрации сервисов. Понимание процессов CI/CD и работа с инструментами автоматической сборки и деплоя (GitLab CI, Jenkins). Опыт работы с системами логирования и мониторинга (Prometheus, Grafana, ELK Stack). Навыки работы с асинхронными задачами (Celery, RabbitMQ). Опыт интеграции с внешними API, а также написания собственных API. Понимание основ безопасности веб-приложений и опыт работы с методами защиты (CSRF, XSS, SQL-инъекции). Знание базового HTML, CSS, JavaScript, фронтенд-навыки будут плюсом. Обязанности: Разработка новых функциональных возможностей для сложной CRM системы (CSS) на базе FastAPI и разработка системы учебной платформы Lingoline на Django. Проектирование и создание RESTful API для взаимодействия между различными сервисами и внешними системами. Поддержка и оптимизация производительности веб-приложений на Django. Внедрение асинхронных процессов для оптимизации работы приложений с использованием FastAPI и Celery. Проектирование микросервисной архитектуры для повышения масштабируемости и производительности системы. Интеграция с реляционными и NoSQL базами данных, оптимизация взаимодействия с ними. Разработка и поддержка контейнеризованных приложений с использованием Docker и Kubernetes. Обеспечение качества кода через написание тестов (юнит-тесты, интеграционные тесты). Работа в команде с соблюдением принципов Agile, участие в код-ревью и обсуждении архитектурных решений. Поддержка безопасности приложения, разработка механизмов защиты от угроз (CSRF, XSS, SQL-инъекции).", "conditions": "Зарплата обсуждается индивидуально с каждым кандидатом, учитывая их опыт и навыки. Возможность удаленной работы с комфортом и гибкостью в рабочей среде. Гибкий график работы, который можно адаптировать под личные потребности. Возможности для профессионального обучения за счет компании, способствующие росту и развитию сотрудников. Условия обсуждаются с каждым кандидатом индивидуально, чтобы удовлетворить их потребности и предпочтения."}
{"id": "1000113311", "title": "Devops инженер", "company": "Банк России", "city": "Санкт-Петербург", "remote": false, "published_at": "2025-05-04T17:27:06+03:00", "skills": ["Linux", "docker", "Python", "jenkins", "gitlab", "теории баз данных", "python и groovy приветствуется знания ос linux", "nexus желателен знание python и groovy приветствуется знания ос linux", "DevOps-инженер", "sql понимание концепции непрерывной интеграции и доставки", "ansible", "написания shell", "Средний (Middle)", "SQL", "bash опыт использования git опыт администрирования субд oracle"], "url": "https://career.habr.com/vacancies/1000113311", "requirements": "высшее техническое образование аналогичный опыт работы от 1 года опыт администрирования ОС Linux (Centos, Red Hat) от 1 года уверенные навыки написания shell-скриптов, знание bash опыт использования Git опыт администрирования СУБД Oracle (в т.ч. troubleshooting, performance tuning) опыт разработки на PL/SQL желателен опыт работы с Docker, Ansible, Jenkins, GitLab, Nexus желателен знание Python и Groovy приветствуется знания ОС Linux (Centos, Red Hat) на уровне администрирования знание теории баз данных, SQL понимание концепции непрерывной интеграции и доставки (CI/CD) и методологии DevOps", "conditions": "Задачи: развертывание ПО и компонентов в средах тестирования и разработки; диагностика функционирования ПО в средах тестирования и разработки; реализация сценариев автоматизации развертывания ПО и тестирования корректности; подготовка и перенос тестовых данных для сред разработки и тестирования администрирование сред разработки и тестирования"}
{"id": "1000156506", "title": "DevOps-инженер (SberSpace)", "company": "СберТех", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-04T17:27:02+03:00", "skills": ["Kubernetes", "Linux", "Python", "Apache Kafka", "Nginx", "PostgreSQL", "инструментами servicemesh", "python", "Docker", "DevOps-инженер", "kafka", "Bash", "ansible", "Git", "технологии git", "Средний (Middle)", "Groovy", "argocd опыт работы с atlassian stack"], "url": "https://career.habr.com/vacancies/1000156506", "requirements": "Релевантный опыт развертывания DevOps pipelines от 3-х лет Опыт разработки helm-charts Уверенная работа с Linux (RHEL/CentOS) Знание Python/Groovy/Bash Практический опыт работы с Kafka /Nginx/ Postgre Практический опыт работы с Ansible/Jenkins/Kubernetes/OpenShift Знание технологии Git/Docker. Будет большим плюсом: Опыт сборки и деплоя ML-моделей Опыт работы с инструментами ServiceMesh (Istio) Опыт работы с ArgoCD Опыт работы с Atlassian stack (Jira, Confluence, Bitbucket).", "conditions": "Гибридный формат работы Годовой бонус и ежегодный пересмотр зарплаты Статус аккредитованной ИТ-компании со всеми преимуществами Расширенный ДМС с первого дня и льготное страхование для семьи Корпоративный университет Сбера, внутренняя образовательная платформа, участие в IT-конференциях Офис с видом на набережную, зонами отдыха и спортзалом Льготная ипотека в Сбере, подписка СберПрайм+, скидки от партнеров и сервисов группы компаний."}
{"id": "1000147159", "title": "AppSeс - инженер", "company": "Банк России", "city": "Казань", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T16:27:09+03:00", "skills": ["dast и т", "чтения кода и выявления в нем уязвимостей", "индустриальных стандартов разработки безопасного программного обеспечения", "Python", "AppSec-инженер", "работы с системами bug tracker", "OWASP", "Баг-трекинг", "Java", "работы с инструментальных средствами анализа кода класса sca", "SAST/DAST", "sast", "работы в современных средах разработки", "Средний (Middle)", "DevSecOps"], "url": "https://career.habr.com/vacancies/1000147159", "requirements": "навыки чтения кода и выявления в нем уязвимостей (например, Java, Go, JavaScript, Python и т.д.); навыки работы с инструментальных средствами анализа кода класса SCA, SAST, DAST и т.д.; навыки работы в современных средах разработки (IDE); навыки работы с системами Bug Tracker; знание индустриальных стандартов разработки безопасного программного обеспечения (NIST, OWASP и т.д.); знания основных принципов и подходов DevSecOps.", "conditions": "В проектах мегарегулятора Вы сможете получить уникальный опыт в масштабных, значимых проектах, а также непрерывное обучение и повышение квалификации, посещение профильных конференций; Возможность непрерывного профессионального развития, начиная с первых месяцев работы; Работу из комфортабельного офиса; ДМС и страхование; Широкий социальный пакет (дополнительные дни к отпуску, возможность для отдыха по льготным ценам, корпоративные скидки на спорт и активная спортивная жизнь внутри Банка России, пенсионная программа и многое другое); Релокационный пакет для иногородних кандидатов."}
{"id": "1000156492", "title": "Python разработчик (Platform V)", "company": "СберТех", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-04T16:27:01+03:00", "skills": ["PostgreSQL", "Python", "Бэкенд разработчик", "bitbucket опыт работы с linux", "confluence", "git", "jira", "Средний (Middle)", "бд postgres"], "url": "https://career.habr.com/vacancies/1000156492", "requirements": "Обязанности проектирование и реализация новых фич на Python сопровождение текущего решения на Python код ревью, оптимизация кода на Python Требования оконченное высшее образование коммерческий опыт работы со стеком: Python, Fast Api, Alembic, Sqlalchemy от 2х лет опыт проведения Code review и написания Unit tests опыт работы с Jira, Confluence, Bitbucket опыт работы с Linux, Git, БД Postgres", "conditions": "Работа в СберТехе — это: гибридный формат работы годовой бонус и ежегодный пересмотр зарплаты статус аккредитованной ИТ-компании со всеми преимуществами расширенный ДМС с первого дня и льготное страхование для семьи корпоративный университет Сбера, внутренняя образовательная платформа, участие в IT-конференциях офис с видом на набережную, зонами отдыха и спортзалом 90 дней удаленной работы из любого региона РФ льготная ипотека в Сбере, подписка СберПрайм+, скидки от партнеров и сервисов группы компаний."}
{"id": "1000147162", "title": "DevOps engineer", "company": "Wanted.", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T14:53:09+03:00", "salary_to": 350000, "currency": "RUB", "skills": ["Kubernetes", "Linux", "Python", "системами управления конфигурациями", "CI/CD", "Docker", "DevOps-инженер", "Git", "системами управления версиями"], "url": "https://career.habr.com/vacancies/1000147162", "requirements": "Имеете положительный и продолжительный опыт работы CI/CD- системами (у нас gitlab и jenkins ); Умеете хорошо готовить docker; Имеете опыт программирования на скриптовых языках (shell, python) ; Имеете опыт администрирования linux и веб-приложений; Понимаете сетевые технологии TCP/IP; Имеете опыт работы с системами управления версиями (у нас git ) Имеете опыт работы с системами управления конфигурациями; Чем предстоит заниматься: Развивать и настраивать процессы CI/CD; Периодически проводить аудит используемого стека технологий; Планировать и участвовать в рефакторинге процессов, инфраструктуры, приложений; Заниматься сопровождением сервисов от разработки до эксплуатации, участвовать в эксплуатации; Дорабатывать текущие и разрабатывать новые сценарии конфигурирования серверов и приложений; Заниматься администрированием приложений по результатам выполненной работы подготавливать документацию, если это необходимо", "conditions": "Работа в аккредитованной ИТ-компании; Официальное трудоустройство по ТК РФ; Гибридный формат работы; Гибкое начало рабочего дня; Классный офис в шаговой доступности от станций метро Дмитровская, Савеловская; Современную рабочую технику (mac/linux - по желанию), дополнительный монитор и многое другое для комфортной работы. Возможность получать бесплатные консультации психолога, юриста, финансового консультанта и специалиста по ЗОЖ. ДМС (со стоматологией) и страховку для выезда за рубеж после испытательного срока."}
{"id": "1000063930", "title": "Разработчик С/C++", "company": "Eltex", "city": "Новосибирск", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T14:52:48+03:00", "skills": ["Linux", "Python", "C++", "и понимание базовых алгоритмов и структур данных уверенное владение языком с знание и понимание протоколов семейства tcp", "c++ владение скриптовыми языками", "Bash", "языком с знание и понимание протоколов семейства tcp", "Git", "Инженер встраиваемых систем", "C", "семейством протоколов 802"], "url": "https://career.habr.com/vacancies/1000063930", "requirements": "Чем предстоит заниматься: Проектирование и разработка программного обеспечения (ПО) для широкой линейки Wireless оборудования Разработка и модификация модулей ядра Linux Работа с современными протоколами беспроводной передачи данных Поддержка и сопровождение существующей кодовой базы Работа над сервисами управления радиоресурсами Поддержка проектной инфраструктуры Оформление документации Необходимые навыки: Знание и понимание базовых алгоритмов и структур данных Уверенное владение языком С Знание и понимание протоколов семейства TCP/IP Опыт коммерческой разработки сетевых и многопоточных приложений под linux Умение работать с системами контроля версий (git) Технический английский Будет плюсом: Владение C++ Владение скриптовыми языками: bash, perl, python или др. Понимание принципов работы аппаратных средств вычислительных систем Опыт разработки модулей и подсистем ядра Linux Опыт проектирования высоконагруженных систем Опыт работы с семейством протоколов 802.11", "conditions": "Мы предлагаем: Трудоустройство согласно ТК РФ Расширенный ДМС после прохождения испытательного срока; Молодой и дружный коллектив, команду профессионалов Официальную заработную плату: оклад + система премирования Большое и современное здание на собственной территории"}
{"id": "1000156486", "title": "SOC Аналитик L2\\L3 (Middle+)", "company": "СберТех", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T14:27:06+03:00", "skills": ["современных ttp", "bitbucket или иными система хранения и версионирования исходного кода", "Python", "docker", "основных векторов атак на корпоративные инфраструктуры", "способов их обнаружения и детектирования опыт работы как минимум с одной siem", "скриптовых языков программирования", "Bash", "Аналитик SOC"], "url": "https://career.habr.com/vacancies/1000156486", "requirements": "Обязанности: подключение к SIEM системе и настройка политик сбора событий безопасности, выработка коррелирующей логики для внутреннего конвеера разработки использовать AppSec практики и знания для проработки мер детектирования аномалий на уровне приложений систем анализ безопасности систем внутри периметра компании, в том числе архитектуры, и проработка мер харденинга, логирования и правил для закрытия недопустимых событий на уровне приложения расследование инцидентов и реагирование на инциденты безопасности поддержка работоспособного состояния инструментов SOC автоматизация рутинных задач SOC развитие техстека SOC. Требования: опыт работы в SOC\\AppSec подразделениях от 3-х лет понимание современных DevOps/DevSecOps-концепций знание современных TTP, основных векторов атак на корпоративные инфраструктуры, способов их обнаружения и детектирования опыт работы как минимум с одной SIEM\\Log storage системой, умение анализировать логи уверенные знания принципов работы сети, сетевых служб и протоколов понимание основ контейнеризации, опыт работы с Docker\\K8s, понимания основных уязвимостей и мисконфигураций в них опыт работы с Bitbucket или иными система хранения и версионирования исходного кода (GitLab, Gitea) знание скриптовых языков программирования (Bash / Powershell / Python) и умение с их помощью автоматизировать задачи опыт администрирования и безопасной настройки Linux.", "conditions": "Работа в СберТехе - это гибридный формат работы, режим работы 5х2 мощное железо для работы, дополнительные мониторы при необходимости структура дохода – оклад и годовая премия статус аккредитованной ИТ-компании со всеми преимуществами расширенный ДМС с первого дня и льготное страхование для семьи корпоративный университет Сбера, внутренняя образовательная платформа, участие в IT-конференциях офис с видом на набережную, зонами отдыха и спортзалом 90 дней удаленной работы из любого региона льготная ипотека в Сбере, подписка СберПрайм+, скидки от партнеров и сервисов группы компаний."}
{"id": "1000156483", "title": "Руководитель команды разработки в Учебник", "company": "Яндекс", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T14:27:04+03:00", "skills": ["Ведущий (Lead)", "Python", "современными фронтенд", "Бэкенд разработчик", "Алгоритмы и структуры данных", "Управление людьми"], "url": "https://career.habr.com/vacancies/1000156483", "requirements": "Мы ждем, что вы Уверенно владеете как минимум одним из языков: Python, Node.js, Go Можете проектировать микросервисы с реляционными и нереляционными базами данных Управляли командой и как техлид (помогали расти людям технически), и как people-manager (мотивировали людей, ставили перед ними цели и помогали их достигать) Имеете опыт в разработке и построении архитектуры веб-сервисов Способны отделять важное и находить компромиссы Можете оценивать риски и сроки и достигать результатов согласно данным оценкам Будет плюсом, если вы Хотите работать в образовательном проекте и понимаете важность образования в современном мире Работали с Django или FastAPI Имеете опыт работы с современными фронтенд-фреймворками или библиотеками (React/Vue/Angular/Svelte)", "conditions": "Высокий совокупный доход Премии каждые полгода для всех, кто успешно прошёл ревью. Офисы, в которые хочется ходить В офисах есть всё, что нужно для комфортной работы: удобные рабочие зоны, уютные места для отдыха, кофепойнты для спокойных перерывов. В офисах в Москве, Санкт-Петербурге, Екатеринбурге, Новосибирске, Казани и Нижнем Новгороде есть тренажёрные залы со всем необходимым. Расширенная медицинская страховка Начинает работать с первого месяца. В неё входят: плановая и неотложная помощь, стоматология, расширенный превентивный чекап, телемедицина 24/7; психотерапия в онлайн-сервисах наших партнёров; после года работы добавляется лазерная коррекция зрения, после двух — ведение беременности и роды. Также мы покрываем 80% стоимости ДМС для супругов и детей. Возможности для роста Есть всё, чтобы учиться: внутренняя платформа с 100+ курсами, менторство и программы для руководителей. Оплачиваем участие в профильных конференциях и помогаем подготовиться к публичным выступлениям. Если для работы нужен иностранный язык, поможем организовать обучение и оплатим 50% стоимости. И ещё Делаем закрытые мероприятия: вечеринки, фестивали и другие ивенты. В Яндексе много клубов по интересам, Random Coffee, сервисы для знакомств и взаимопомощи. А наши спортивные клубы регулярно участвуют в забегах, триатлонах и других соревнованиях. На портале скидок масса специальных предложений для сотрудников от наших партнёров."}
{"id": "1000155506", "title": "Backend Python developer", "company": "HR Prime", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T14:27:03+03:00", "salary_from": 300000, "salary_to": 3800000, "currency": "RUB", "skills": ["Python", "PostgreSQL", "Apache Kafka", "Redis", "Бэкенд разработчик", "Старший (Senior)", "Docker", "REST", "алгоритмов и структур данных", "SQLalchemy", "AIOHTTP", "SQL", "FastAPI", "веб"], "url": "https://career.habr.com/vacancies/1000155506", "requirements": "Опыт разработки на Python от 3 лет. Глубокое знание алгоритмов и структур данных. Опыт работы с веб-фреймворками Python (например, Django, Flask). Способность работать в команде и эффективно решать задачи.", "conditions": "Гибридный формат работы с графиком 5/2. Конкурентные условия: белая индексируемая зарплата (оклад + премия). ДМС с первого дня и скидки для родственников. Команду топовых разработчиков и участие в уникальных крупных проектах. Офис в центре Москвы."}
{"id": "1000144240", "title": "Senior Python developer (ServiceController)", "company": "Cloud.ru", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-04T12:54:07+03:00", "skills": ["работы с kubernetes", "Linux", "Python", "linux", "Бэкенд разработчик", "Старший (Senior)", "sql и умение работать с данными через orm", "умение писать docker", "сервисами openstack", "kafka или rabbitmq"], "url": "https://career.habr.com/vacancies/1000144240", "requirements": "Опыт коммерческой разработки на Python от 3 лет; Понимание ООП, паттернов проектирования и алгоритмов; Умение работать с асинхронным кодом; Знание SQL и умение работать с данными через ORM; Понимание принципов проектирования RESTful API; Опыт работы с Kafka или RabbitMQ; Уверенное знание Linux, умение писать Docker-файлы; Умение работать с документацией, в том числе на английском языке; Умение разрабатывать интеграции со сторонними API; Высокий уровень личной ответственности за результат работы. Будет плюсом: Практический опыт работы с сервисами Openstack; Работа с FastAPI, SQLAlchemy; Навыки работы с Kubernetes; Знание Go.", "conditions": "Работа в Cloud.ru — это: Комфортная среда Оформление в соответствии с трудовым законодательством РФ; Достойный уровень дохода: оклад + годовой бонус; Расширенный ДМС со стоматологией; Компенсация спорта; Штатный терапевт и психолог; Гибкий график работы, пятница – сокращенный рабочий день; Классный офис в Москве; Культура, в основе которой эмпатия, уважение, открытость и свобода строить рабочий процесс так, как считаешь нужным. Место, где ты растешь Индивидуальный план развития и обучение за счет компании; Возможность вертикального и горизонтального роста; Возможность развиваться как эксперту: выступать на мероприятиях, писать статьи. Крутая команда Профессиональные сообщества и клубы по интересам; Неформальные мероприятия: от футбольного клуба до посиделок с пиццей. Еще у нас Льготная программа ипотечного и потребительского кредитования; Материальная помощь при рождении детей и других семейных обстоятельствах; Бонусы за рекомендации кандидатов на открытые вакансии."}
{"id": "1000144238", "title": "Ведущий разработчик / Техлид Openstack", "company": "Cloud.ru", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-04T12:50:54+03:00", "skills": ["Ведущий (Lead)", "Linux", "Python", "postgresql", "Бэкенд разработчик", "Openstack", "Golang"], "url": "https://career.habr.com/vacancies/1000144238", "requirements": "Опыт разработки на Python от 3-х лет (Python > 3.5, ООП и паттерны проектирования); Опыт разработки на Golang от 2-х лет; Базовые знания OpenStack, его компонентной архитектуры и функциональных особенностей каждого компонента; Хорошие знания Golang; Опыт работы с PostgreSQL; Понимание принципов проектирования restful api; Наличие практического опыта работы с Linux.", "conditions": "Работа в Cloud.ru — это: Комфортная среда Оформление в соответствии с трудовым законодательством РФ; Достойный уровень дохода: оклад + годовой бонус; Расширенный ДМС со стоматологией; Компенсация спорта; Штатный терапевт и психолог; Гибкий график работы, пятница – сокращенный рабочий день; Классный офис в Москве; Культура, в основе которой эмпатия, уважение, открытость и свобода строить рабочий процесс так, как считаешь нужным. Место, где ты растешь Индивидуальный план развития и обучение за счет компании; Возможность вертикального и горизонтального роста; Возможность развиваться как эксперту: выступать на мероприятиях, писать статьи. Крутая команда Профессиональные сообщества и клубы по интересам; Неформальные мероприятия: от футбольного клуба до посиделок с пиццей. Еще у нас Льготная программа ипотечного и потребительского кредитования; Материальная помощь при рождении детей и других семейных обстоятельствах; Бонусы за рекомендации кандидатов на открытые вакансии."}
{"id": "1000133422", "title": "Senior Python/Openstack developer", "company": "Cloud.ru", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T12:47:40+03:00", "skills": ["Linux", "Kubernetes", "Python", "PostgreSQL", "gitlab", "postgresql", "Бэкенд разработчик", "Старший (Senior)", "KVM", "Openstack", "rabbitmq", "Django", "платформами виртуализации"], "url": "https://career.habr.com/vacancies/1000133422", "requirements": "Опыт разработки на Python от 3-х лет (Python > 3.5, ООП и паттерны проектирования); Хорошие знания SQL; Опыт работы с PostgreSQL; Понимание принципов проектирования restful api; Наличие практического опыта работы с Linux; Опыт работы с Gitlab. Будет плюсом: Опыт разработки для Openstack; Опыт работы с RabbitMQ/AMQP; Опыт работы с платформами виртуализации.", "conditions": "Работа в Cloud.ru — это: Комфортная среда Оформление в соответствии с трудовым законодательством РФ; Достойный уровень дохода: оклад + годовой бонус; Расширенный ДМС со стоматологией; Компенсация спорта; Штатный терапевт и психолог; Гибкий график работы, пятница – сокращенный рабочий день; Классный офис в Москве; Культура, в основе которой эмпатия, уважение, открытость и свобода строить рабочий процесс так, как считаешь нужным. Место, где ты растешь Индивидуальный план развития и обучение за счет компании; Возможность вертикального и горизонтального роста; Возможность развиваться как эксперту: выступать на мероприятиях, писать статьи. Крутая команда Профессиональные сообщества и клубы по интересам; Неформальные мероприятия: от футбольного клуба до посиделок с пиццей. Еще у нас Льготная программа ипотечного и потребительского кредитования; Материальная помощь при рождении детей и других семейных обстоятельствах; Бонусы за рекомендации кандидатов на открытые вакансии."}
{"id": "1000153655", "title": "Middle QA Automation (Python) в команду IO.Dev", "company": "2GIS", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-04T12:39:07+03:00", "skills": ["Автоматизация тестирования", "Python", "Docker", "техниками тест", "Инженер по автоматизации тестирования", "Git", "Средний (Middle)", "SQL", "любого высокоуровневого языка программирования"], "url": "https://career.habr.com/vacancies/1000153655", "requirements": "Чем предстоит заниматься Анализировать требования и составлять тест-кейсы; Автоматизировать тестирование проектов, построенных на микросервисной архитектуре; Писать функциональные тесты на серверное API и фоновые обработчики данных; Разрабатывать e2e-тесты на Python и настраивать Continuous Integration; Проводить нагрузочное тестирование в проекте. Для работы потребуется Опыт работы в сфере автоматизации тестирования от 2 лет; Владение техниками тест-дизайна; Знание любого высокоуровневого языка программирования; Умение структурированно и доступно выражать свои мысли, а также аргументированно отстаивать свою позицию.", "conditions": "2ГИС — аккредитованная IT-компания. У нас можно работать удалённо. Для нас важен специалист, а не его локация. Если хочешь работать в гибридном формате, у нас есть офисы в Москве, Санкт-Петербурге, два классных офиса в Новосибирске. А также коворкинги в Нижнем Новгороде, Томске, Астане, Алма-Ате и Дубае. График не главное. Кто-то начинает работу в 9, кто-то в 11, а кто-то — когда удобно ему и команде. Главное — выполнять задачи в срок и быть на связи с коллегами; Само собой, полностью белая зарплата, размер обсуждается на собеседовании, потолка нет; Есть ДМС, штатный терапевт, невролог, мед.консультант и другие IT-плюшки; Если хочешь делиться своим опытом, мы только за — поможем с выступлениями на конференциях и статьями для Хабра; Приходите, у нас хорошо"}
{"id": "1000156081", "title": "Python разработчик в Яндекс Учебник", "company": "Яндекс", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T12:36:02+03:00", "skills": ["Бэкенд разработчик", "Средний (Middle)", "Python", "PostgreSQL", "Golang", "Redis", "MongoDB"], "url": "https://career.habr.com/vacancies/1000156081", "requirements": "Мы ждем, что вы: Занимались коммерческой разработкой Писали веб-приложения Отлично знаете Python или Go Способны объяснять свои решения и договариваться с коллегами Будет плюсом, если вы: Работали с GPT-моделями и понимаете, как они устроены Ведёте один или несколько pet-проектов или вносили значимый вклад в развитие открытых проектов Пишете читабельный код, который легко поддерживать, любите и умеете писать тесты Работали с разными типами баз данных — реляционными и нереляционными, понимаете разницу между ними и основные принципы их работы", "conditions": "Высокий совокупный доход Премии каждые полгода для всех, кто успешно прошёл ревью. Офисы, в которые хочется ходить В офисах есть всё, что нужно для комфортной работы: удобные рабочие зоны, уютные места для отдыха, кофепойнты для спокойных перерывов. В офисах в Москве, Санкт-Петербурге, Екатеринбурге, Новосибирске, Казани и Нижнем Новгороде есть тренажёрные залы со всем необходимым. Расширенная медицинская страховка Начинает работать с первого месяца. В неё входят: плановая и неотложная помощь, стоматология, расширенный превентивный чекап, телемедицина 24/7; психотерапия в онлайн-сервисах наших партнёров; после года работы добавляется лазерная коррекция зрения, после двух — ведение беременности и роды. Также мы покрываем 80% стоимости ДМС для супругов и детей. Возможности для роста Есть всё, чтобы учиться: внутренняя платформа с 100+ курсами, менторство и программы для руководителей. Оплачиваем участие в профильных конференциях и помогаем подготовиться к публичным выступлениям. Если для работы нужен иностранный язык, поможем организовать обучение и оплатим 50% стоимости. И ещё Делаем закрытые мероприятия: вечеринки, фестивали и другие ивенты. В Яндексе много клубов по интересам, Random Coffee, сервисы для знакомств и взаимопомощи. А наши спортивные клубы регулярно участвуют в забегах, триатлонах и других соревнованиях. На портале скидок масса специальных предложений для сотрудников от наших партнёров."}
{"id": "1000135999", "title": "Senior Python developer (Evolution Openstack)", "company": "Cloud.ru", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T12:33:44+03:00", "skills": ["Python", "postgresql", "gitlab", "rabbitmq", "Бэкенд разработчик", "Старший (Senior)", "Openstack", "FastAPI", "платформами виртуализации"], "url": "https://career.habr.com/vacancies/1000135999", "requirements": "Опыт разработки на Python от 3-х лет (Python > 3.5, ООП и паттерны проектирования); Хорошие знания SQL; Опыт работы с PostgreSQL; Понимание принципов проектирования restful api; Наличие практического опыта работы с Linux; Опыт работы с Gitlab. Будет плюсом: Опыт разработки для Openstack; Опыт работы с RabbitMQ/AMQP; Опыт работы с платформами виртуализации. На этой позиции тебе предстоит: Разработка модулей на базе OpenStack; Интеграция приложений с OpenStack; Ревью кода; Проектирование и реализация приложений с низкой задержкой, высокой доступностью и производительностью.", "conditions": "Работа в Cloud.ru — это: Комфортная среда Оформление в соответствии с трудовым законодательством РФ; Достойный уровень дохода: оклад + годовой бонус; Расширенный ДМС со стоматологией; Компенсация спорта; Штатный терапевт и психолог; Гибкий график работы, пятница – сокращенный рабочий день; Классный офис в Москве; Культура, в основе которой эмпатия, уважение, открытость и свобода строить рабочий процесс так, как считаешь нужным. Место, где ты растешь Индивидуальный план развития и обучение за счет компании; Возможность вертикального и горизонтального роста; Возможность развиваться как эксперту: выступать на мероприятиях, писать статьи. Крутая команда Профессиональные сообщества и клубы по интересам; Неформальные мероприятия: от футбольного клуба до посиделок с пиццей. Еще у нас Льготная программа ипотечного и потребительского кредитования; Материальная помощь при рождении детей и других семейных обстоятельствах; Бонусы за рекомендации кандидатов на открытые вакансии."}
{"id": "1000153652", "title": "Senior QA Automation (Python) в команду UGC", "company": "2GIS", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-04T12:29:43+03:00", "skills": ["Python", "автоматизацией тестирования от трех лет", "Docker", "Старший (Senior)", "техниками тест", "Инженер по автоматизации тестирования", "Git", "SQL"], "url": "https://career.habr.com/vacancies/1000153652", "requirements": "Автоматизировать тестирование проекта, построенного на микросервисной архитектуре. Писать функциональные тесты на серверное API и фоновые обработчики данных. Разрабатывать е2е тесты (на Python 3) и настраивать Continuous Integration. Участвовать в проработке архитектуры сервисов и интерфейсов их взаимодействия. Проводить нагрузочное тестирование в проекте. Для работы потребуется Опыт работы с автоматизацией тестирования от трех лет. Понимание основ тестирования и владение техниками тест-дизайна. Умение структурировано и доступно выражать свои мысли, а также аргументированно отстаивать свою позицию. Инициативность и любознательность.", "conditions": "2ГИС — аккредитованная IT-компания. У нас можно работать удалённо. Для нас важен специалист, а не его локация. Если хочешь работать в гибридном формате, у нас есть офисы в Москве, Санкт-Петербурге, два классных офиса в Новосибирске. А также коворкинги в Нижнем Новгороде, Томске, Астане, Алма-Ате и Дубае. График не главное. Кто-то начинает работу в 9, кто-то в 11, а кто-то — когда удобно ему и команде. Главное — выполнять задачи в срок и быть на связи с коллегами; Само собой, полностью белая зарплата, размер обсуждается на собеседовании, потолка нет; Есть ДМС, штатный терапевт, невролог, мед.консультант и другие IT-плюшки; Если хочешь делиться своим опытом, мы только за — поможем с выступлениями на конференциях и статьями для Хабра; Приходите, у нас хорошо"}
{"id": "1000151049", "title": "Data engineer", "company": "ИТ-Холдинг Т1", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T11:27:32+03:00", "skills": ["Инженер по данным", "Python", "Старший (Senior)", "реляционными и nosql базами данных опыт работы с различными субд в роли разработчика", "SQL", "Apache Hadoop"], "url": "https://career.habr.com/vacancies/1000151049", "requirements": "Чем предстоит заниматься: Проектирование и разработка витрин данных (Hive-SQL, Spark) с погружением в бизнес-процессы и аналитику данных. Уточнение требований заказчика, системный анализ, изучение бизнес-процессов систем источников. Доработка существующих витрин. Автоматизация процессов обновления данных (AirFlow). 3 линия поддержки. Тестирование нового функционала и витрин в DataLake Выстраивание процессов Data Governance на инфраструктуре Hadoop совместно с CDO Банка. Контроль качества данных в хранилище (Hadoop) – постановка задач, анализ. Предоставление экспертной поддержки внутренним потребителям (data analysts,data scientists). Что для нас важно: SQL: вложенные запросы, оконные функции, опыт написания функций / процедур Понимание основных концепций DWH Понимание базовых команд Git и основных принципов работы Понимание основных банковских процессов (достаточно одного): кредитование, процессинг, депозиты или других Опыт работы с реляционными и noSQL базами данных Опыт работы с различными СУБД в роли разработчика / аналитика витрин данных.", "conditions": "гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК."}
{"id": "1000151051", "title": "Аналитик- методолог", "company": "ИТ-Холдинг Т1", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T11:27:31+03:00", "skills": ["rpa", "Python", "Jira", "Confluence", "python", "java", "автоматизации рутинных задач с использованием роботизации по типу uipath", "excel vba", "Java", "Бизнес-аналитик", "Средний (Middle)", "excel powerquery", "Microsoft Excel"], "url": "https://career.habr.com/vacancies/1000151051", "requirements": "Чем предстоит заниматься: Участие в разработке метрик процессов. Автоматизация и разработки инструментов отчетности. Автоматизация мониторинга метрик бизнес- процессов и динамики выполнения задач . Описание методик, инструкций пользователей . Что для нас важно: Знание Excel VBA – разработка макросов для автоматизации работы, поддержание и модернизация существующих. Знание Excel PowerQuery – умение работать с большим количеством Excel книг, полученных из выгрузок других систем – трансформирование исходных данных, объединение в единую таблицу. Знание Python, Java - Написание скриптов на Python, Java. Знание RPA - навыки автоматизации рутинных задач с использованием роботизации по типу UiPath.", "conditions": "гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы."}
{"id": "1000151045", "title": "ML-инженер", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-04T11:27:08+03:00", "skills": ["Python", "PostgreSQL", "CI/CD", "python", "стандартной библиотеки python", "фреймворков mlflow", "ML разработчик", "kuberflow", "itsm системами", "mlrun", "для нас важны", "postgresql в части sql", "django", "Средний (Middle)", "itil", "airflow или другими системами управления моделями ml", "опыт работы с itsm системами"], "url": "https://career.habr.com/vacancies/1000151045", "requirements": "Какие знания и навыки для нас важны: Знания в области разработки программного обеспечения (O-notation, Patterns, Clean Code, Code Review); Знание PostgreSQL в части SQL. Умение писать и отлаживать SQL-запросы, понимание механизмов работы индексов и транзакций, MPP (Massive Parallel Processing); Опыт работы с Airflow или другими системами управления моделями ML; Понимание, как перевести модель в производство, ключевые понятия — data drift, model retraining strategies; Опыт настройки CI/CD. Разработка решения ML (обучение-тестирование/производство). Интеграция A/B-тестирование; Знание фреймворков MLFlow, Kuberflow, MLRun; Контейнеры Docker и системы управления контейнерами Kubernetes; Знание Python, Django (ORM Models) либо SqlAlchemy, знание стандартной библиотеки Python; Будет плюсом: Приветствуется знание ITIL, опыт работы с ITSM системами; Приветствуется опыт в области NLP: Трансформеры (BERT special tokens), RNN, классические подходы, LLM.", "conditions": "Преимущества работы в Т1: ДМС и комплексные программы поддержки Комфортные офисы и гибкий рабочий день Участие в конференциях и профессиональное обучение Интересные задачи, производительное железо и софт для работы Скидки и партнерские программы"}
{"id": "1000156465", "title": "Аналитик-разработчик (Сегментация)", "company": "SM Lab", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-04T10:27:02+03:00", "skills": ["Инженер по данным", "Python", "sql", "python", "Алгоритмы и структуры данных", "Средний (Middle)", "SQL"], "url": "https://career.habr.com/vacancies/1000156465", "requirements": "Высшее образование (математическое / физическое / программная инженерия / вычислительная техника / наука о данных / экономическое); Опыт работы в аналогичной должности от 2 лет; Сильные аналитические навыки; Умение самостоятельно генерировать идеи; Уверенное владение SQL (сложные запросы, аналитические функции); Базовое владение Python; Умение оптимизировать SQL запросы. Чем предстоит заниматься Разработка и рефакторинг алгоритмов для выделения признаков принадлежности клиентов к сегментам; Работа по улучшению качества входных данных для сегментации, устранение выявленных ошибок и неточностей (работа по инцидентам); Консультирование аналитиков по вопросам использование витрин с рассчитанными сегментами. Стек технологий Для разработки используем: Python, Oracle PL/SQL, Airflow, Spark, Spark Streaming. Для организации работы: Jira, Confluence, Git.", "conditions": "Удаленный формат работы, офис по желанию, как коворкинг; График работы: 5/2; 8.00-17.00, 9.00-18.00 или 10.00-19.00 (на выбор); Полугодовой бонус; Кафетерий льгот, где можно выбрать опции ( ДМС, фитнес, английский, связь и другое); Дисконтная карта на продукцию 30% магазинов сети + корпоративные скидки и специальные условия от партнеров; Обучение - доступно внутреннее и внешнее обучение, проводим внутренние митапы, техтолки, посещаем профильные конференции."}
{"id": "1000137896", "title": "Senior Backend developer (python) офис", "company": "Совкомбанк Технологии", "city": "Казань", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-04T06:27:24+03:00", "skills": ["Python", "Docker", "Бэкенд разработчик", "инструментами для деплоя", "фреймворков тестирования", "языком программирования python от 3", "Git", "postgresql и redis", "SQL", "FastAPI", "паттернов разработки", "django", "базовых библиотек python"], "url": "https://career.habr.com/vacancies/1000137896", "requirements": "Понимание ООП, знание паттернов разработки; Опыт работы с языком программирования Python от 3-х лет; Хорошее знание базовых библиотек Python; Опыт работы с Django/DRF для разработки коммерческих приложений от 2-х лет (или с другими фреймворками: FastAPI, Flask); Понимание REST-архитектуры, опыт разработки серверной части REST; Опыт работы с PostgreSQL и Redis; Уверенная работа с git и другими инструментами разработчика; Умение тестировать приложение. Знание фреймворков тестирования (unit-тестирование, интеграционное тестирование). Опыт написания Unit-тестов; Опыт работы по git-flow. Приветствуется: Понимание основ и принципов микросервисной архитектуры; Работа по методологии TDD и BDD; Опыт работы в сложных и интересных проектах; Опыт настройки веб-серверов, владение инструментами для деплоя. Чем предстоит заниматься: Развитием собственных систем (разработка продукта, интеграция с внешними и внутренними сервисами, доработка текущего функционала); Реализация и сопровождение системы в боевом контуре.", "conditions": "Трудоустройство по ТК РФ в аккредитованную IT-компанию; Самый уникальный портфель бонусов (ДМС со стоматологией, фитнес, школа ин. языков на выбор, скидки на коробочные продукты банка и партнеров, коворкинг в Сочи и прочее); Помощь в развитии вашей проф. экспертизы: оплатим профессиональные тренинги и внешние образовательные курсы, участие в ИТ активностях (митапы, хакатоны, юконы); Атмосферу профессионального развития, вдохновленную принципами Agile; Отзывчивых коллег и помощь ментора в адаптации; Вовлеченность, комфорт, свободу, минимум бюрократии, отсутствие дресс-кода, гибкое начало и завершение рабочего дня. ПРИХОДИ – С НАМИ БУДЕТ ИНТЕРЕСНО!"}
{"id": "1000150999", "title": "DevOps - инженер", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T19:27:52+03:00", "skills": ["kubernetes", "Docker", "RabbitMQ", "Kubernetes", "teamcity и jenkins опыт работы субд postgresql", "PostgreSQL", "CI/CD", "liquibаse присоединяйся к команде иннотех", "DevOps-инженер", "Linux", "DevOps", "для нас важны", "SQL", "DevSecOps", "Centos", "Python", "Apache Kafka", "nexus", "ms sql"], "url": "https://career.habr.com/vacancies/1000150999", "requirements": "Вместе с нами ты будешь: Развивать и поддерживать Back и Front части банковского приложения Развивать процессы CI/CD Поддерживать контур разработки (DEV) и интеграционно-функционального тестирования (IFT) Участвовать в интеграционных процессах в рамках Омниканальности, сопровождение разработки Какие знания и навыки для нас важны: Опыт администрирования Linux не менее 3-5лет Контейнеризация: Опыт работы не менее 1-3х лет Понимание оптимизации процесса сборки Понимание механизма работы и навыков работы с механизмами Cgroups & Namespaces Опыт работы с Kubernetes/OpenShift не менее года Умение самостоятельно разбираться с проблемами запуска, оптимизации, роутинга ПО в Kubernetes Уверенные знания Helm, написание чартов, правка существующих CI/CD: Опыт имплементации CI & CD конвейеров Опыт имплементации CI/CD процессов разработки Android, iOS Уверенные знания Git и стратегий для реализации их в процессах разработки (оптимизации текущих процессов) Понимание принципов TDD и Пирамиды тестирования Опыт работы с Nexus (понимать как работают proxy репозитории) Опыт работы с MS SQL (работа с хранимыми процедурами, настройка интеграций, отладка выполнения скриптов, бэкапы) Уверенные знания Ansible, практический опыт работы и внедрения с CI/CD процессы, умение писать роли. Умение писать скрипты на Bash и PowerShell Быть способным погружаться в сложные задачи как технического так и административного характера (составление заявок, согласований, уметь вести деловую переписку). Желательно: опыт работы с TeamCity и Jenkins опыт работы СУБД Postgresql (Установка, настройка, кластеризация, настройка интеграций, выполнение скриптов, отладка выполнения скриптов) опыт работы с LiquiBаse Присоединяйся к команде Иннотех!", "conditions": "Преимущества работы в Т1: Комфортные офисы и гибкий рабочий день В офисе, удаленно или в гибридном формате. Главный офис у м. Динамо в Москве — победитель в номинации «Гибкий офис» Best Office Awards 2023 Участие в конференциях и профессиональное обучение Бесплатное обучение, LMS платформа с 70+ курсами для развития технических и коммуникационных навыков, программа наставничества, а также 12+ активных сообществ и техногильдий Интересные задачи, производительное железо и софт для работы Востребованные на рынке ИТ‑продукты, ключевые ‑ уже внесены в ЕРРП (реестр российского ПО) Насыщенная корпоративная жизнь и нетворкинг Масштабные таунхоллы и яркие неформальные события, регулярные митапы, корпоративная библиотека, активные сообщества и многое другое Скидки, партнерские программы и свой маркетплейс мерча Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой Конкурентная заработная плата Достойный оклад по итогам интервью и система премирования. Оформление по ТК и эксклюзивный зарплатный проект для сотрудников"}
{"id": "1000153910", "title": "DevOps инженер", "company": "Bell Integrator", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-03T18:35:39+03:00", "skills": ["Kubernetes", "Linux", "Python", "PostgreSQL", "kubernetes", "docker", "python + django", "непрерывной доставкой в kubernetes", "Docker", "скриптовыми языками bash", "powershell", "DevOps-инженер", "английского на уровне", "ansible", "Средний (Middle)", "сборка имеджей", "cmd", "достаточном для чтения технической документации"], "url": "https://career.habr.com/vacancies/1000153910", "requirements": "- Опыт работы в DevOps не менее 2 лет, лучше не менее 3 лет - Понимание основных принципов и практик DevSecOps; - Опыт настройки CI/CD систем (GitLab CI, Jenkins, Teamcity); - Опыт работы с Docker, сборка имеджей - Опыт работы с Kubernetes. Самостоятельное развертывание, написание манифестов для различных компонент. - Опыт работы с непрерывной доставкой в Kubernetes: Helm, Jsonnet и др. - Уверенное владение скриптовыми языками Bash, CMD, Powershell); - Уверенное владение Python + Django (у нас почти все DevOps-сервисы на python); - Опыт работы с Ansible. Уверенное написание плейбуков, ролей, кофигурация шаблонов; - Умение настраивать мониторинг (Prometheus/Grafana/Zabbix/ELK); - Знание, опыт настройки и администрирования Web-серверов (Apache, Nginx) - Опыт администрирования с RedHat 7/8, Ubuntu 18/20, Windows Server 2012+; - Умение тестировать и измерять результаты своей работы; - Знание английского на уровне, достаточном для чтения технической документации; - Активность, коммуникабельность", "conditions": "Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно по РФ, Беларуси Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком"}
{"id": "1000150980", "title": "Системный аналитик SQL", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T18:28:52+03:00", "skills": ["реляционными и нереляционными бд навыки делового общения и деловой переписки умение работать с jira", "confluence опыт работы с бд", "работы с hadoop", "а также планирование и соблюдение сроков их выполнения какие знания и навыки для нас важны", "Большие данные", "DWH", "Scala", "делового общения и деловой переписки умение работать с jira", "PostgreSQL", "написание sql запросов", "Базы данных", "банковской сферы и продуктов", "Средний (Middle)", "SQL", "Apache Hadoop", "Python", "написание sql", "планирования", "Системный аналитик", "Oracle", "Oracle PL/SQL", "приоритизации и декомпозирования задач"], "url": "https://career.habr.com/vacancies/1000150980", "requirements": "Вместе с нами ты будешь: Проектировка витрин для аналитической отчетности Исследование имеющегося ландшафта Банка и источников Подготовка и доработка технической документации и ее согласование внутри Банка Сбор и анализ требований Взаимодействие с заказчиками, разработчиками, архитектором, проектным менеджером Участие в тестировании Навыки планирования, приоритизации и декомпозирования задач, а также планирование и соблюдение сроков их выполнения Какие знания и навыки для нас важны: Опыт работы в ИТ компаниях, подразделениях ИТ Банка от 1 года Опыт работы с реляционными и нереляционными БД Навыки делового общения и деловой переписки Умение работать с Jira, Confluence Опыт работы с БД, написание SQL запросов, написание SQL-алгоритма формирования витрин данных Знание, понимание и работа с методологией Agile Сбор, систематизация, уточнение требований в части построения витрин данных Будет преимуществом: Навыки работы с Hadoop (Hive, PySpark) Знание банковской сферы и продуктов", "conditions": "Комфортные офисы и гибкий рабочий день ДМС и комплексные программы поддержки Интересные задачи, производительное железо и софт для работы Участие в конференциях и профессиональное обучение Скидки и партнерские программы Насыщенная корпоративная жизнь и нетворкинг Конкурентная заработная плата Дополнительные выходные и материальная помощь"}
{"id": "1000153255", "title": "Security Champion in SW Development (TATLIN.OBJECT)", "company": "YADRO", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-03T18:28:05+03:00", "skills": ["Linux", "Python", "Специалист по информационной безопасности", "Старший (Senior)", "C++", "Информационная безопасность", "Bash", "C", "работы с инструментами автоматизации и скриптовыми языками", "Golang"], "url": "https://career.habr.com/vacancies/1000153255", "requirements": "опыт программирования на Golang; умение понимать код на С/С++ и вносить в него мелкие правки; базовое понимание принципов безопасной разработки; интерес к области безопасности программного обеспечения и желание учиться; навыки работы с инструментами автоматизации и скриптовыми языками (Bash, Python); понимание принципов работы компьютера и сети. Будет плюсом участие в соревнованиях CTF, хакатонах или платформах типа HackTheBox, TryHackMe; знакомство с инструментами статического и динамического анализа кода.", "conditions": "конкурентный уровень заработной платы для нас это не просто слова, а - принцип; обучение и развитие: учебный портал с курсами и лекциями от внешних и внутренних экспертов, а также дополнительное профессиональное обучение и изучение английского языка; программа поддержки инноваций: премии за научные достижения, публикацию статей, выступления на конференциях и регистрацию патентов; \"Лекторий\", в котором мы организовываем встречи с выдающимися экспертами в области технологий; забота о здоровье: ДМС с первых дней работы + стоматология, а также льготные условия страхования близких; поддержка в личных вопросах: консультации юристов, психологов, экспертов по ЗОЖ и управлению финансами; открытое общение: регулярные онлайн-встречи всей команды YADRO; программа рекомендаций: рекомендуя друзей или бывших коллег, вы получаете не только возможность работать вместе, но и денежные бонусы."}
{"id": "1000155009", "title": "Разработчик C++/Python в команду Simulator", "company": "Navio", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-03T17:54:11+03:00", "skills": ["Python", "классических алгоритмов и структур данных", "ros2", "Бэкенд разработчик", "Старший (Senior)", "C++", "линейной алгебры", "c++", "Алгоритмы и структуры данных", "популярных паттернов проектирования", "геометрии или теории вероятностей", "ООП"], "url": "https://career.habr.com/vacancies/1000155009", "requirements": "Уверенное владение C++ (17); Базовые знания Python; Знание классических алгоритмов и структур данных; Опыт разработки под Linux; Высшее техническое образование; Базовое знание линейной алгебры (вектора, системы координат) и в целом готовность работать с математикой. Будет плюсом++ Опыт работы от 6 лет; Знакомство и опыт работы с ROS2; Понимание архитектуры ECS; Уверенное знание линейной алгебры, геометрии или теории вероятностей; Знание популярных паттернов проектирования; Знакомство с pytest, Kafka, Clickhouse; Опыт в разработке моделей динамики и физики автомобиля. Чем предстоит заниматься Развитие дорожной среды и алгоритмов управления трафиком в симуляторе, моделирующем 3D городскую среду; Создание инструментов для написания сценариев в терминах дорожных ситуаций и автоматической генерации тестов по rosbag-ам; Интеграция различных подсистем беспилотника (localization, perception, planning и тд) с симулятором.", "conditions": "Крутой технологический домен; Работу в аккредитованной ИТ-компании; Работу в команде топовых разработчиков, возможность разрабатывать уникальные и крупные проекты масштаба нашей страны; Конкурентные условия труда (белая индексируемая заработная плата, оклад+годовая премия); График работы – стандартный, но с гибким подходом к началу/окончанию рабочего дня; Доступ к огромным возможностям развития и повышения квалификации в Виртуальной школе на HR-платформе, а также к другим формам обучения; Возможность посещения (как в качестве слушателя, так и в качестве выступающего) всероссийских и международных конференций; ДМС для сотрудников с первого дня (+стоматология после испытательного срока) и льготная программа медицинской страховки для родственников; Обеды для сотрудников, бесплатный кофе и другие напитки в кафетерии; Зарплатный проект, льготные программы кредитования и выгодные предложения на другие банковские продукты; Бесплатную подписку на мультимедиасервисы компании-партнера; Субсидия на ипотеку; Широкий спектр дисконт–программ, скидок и привилегий от компаний-партнеров."}
{"id": "1000153251", "title": "DevOps engineer", "company": "YADRO", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-03T15:36:08+03:00", "skills": ["Linux", "Python", "CI/CD", "docker контейнерами", "автоматизации с применением python и bash", "Docker", "helm charts опыт работы с экосистемой go и node", "DevOps-инженер", "Bash", "k8s", "Средний (Middle)", "альтернативными docker buildx инструментами сборки образов контейнеров"], "url": "https://career.habr.com/vacancies/1000153251", "requirements": "Опыт работы в области DevOps/SRE от 1 года; Опыт написания CI/CD пайплайнов различной степени сложности в Gitlab CI; Опыт администрирования Gitlab через UI; Практические навыки автоматизации с применением Python и Bash; Практический опыт работы с Docker контейнерами; Практический опыт работы в GNU Linux (настройка параметров ядра, понимание организации структуры ФС, работа с systemd и т.п.). Будет плюсом Понимание процесса сборки кода на С/C++ c помощью компиляторов GNU GCC/Clang Умение работать с системами сборки Autotools + Makefiles, CMake + Makefiles/Ninja, Bazel Более глубокое погружение в Python и его экосистему (ООП, пакетные менеджеры, виртуальные окружения, написание юнит-тестов с использованием pytest) Опыт работы с альтернативными Docker BuildX инструментами сборки образов контейнеров (например, kaniko) Опыт работы с k8s, helm charts Опыт работы с экосистемой Go и Node.JS", "conditions": "Конкурентный уровень заработной платы Гибридный формат работы, возможность полной удалённой работы Систему премирования за научные достижения, публикацию статей, регистрацию патентов и выступления на конференциях «Лекторий», в рамках которого приглашенные эксперты и наши специалисты на регулярной основе делятся профессиональным опытом из различных областей науки Медицинскую страховку, включающую стоматологию, госпитализации, международные путешествия Льготное страхование членов семьи"}
{"id": "1000150881", "title": "Data аналитик (Виртуальные ассистенты)", "company": "ИТ-Холдинг Т1", "city": "Нижний Новгород", "employment": "Новосибирск", "remote": false, "published_at": "2025-05-03T15:35:03+03:00", "skills": ["Python", "Аналитик по данным", "написания сложных sql", "big data владение методами анализа данных и моделирования", "базами данных", "Средний (Middle)", "SQL", "навыки написания сложных sql", "методами анализа данных и моделирования"], "url": "https://career.habr.com/vacancies/1000150881", "requirements": "Опыт работы с базами данных, навыки написания сложных SQL-запросов, процедур, пакетов, оптимизации кода Опыт работы с Big Data Владение методами анализа данных и моделирования (Python + библиотеки для анализа данных) Ответственность Самостоятельность Чем предстоит заниматься: Развитие внутреннего сервиса по построению рекомендаций для сотрудников Разработка и реализация различных метрик операционного качества Обработка ошибок в роли 3й линии поддержки Сопровождение изменений в ПО и интеграции с внешними источниками Работа с базами данных и техническое описание процессов Запуск пилотов, стабилизационные работы и контроль Поиск, проработка и реализация сценариев по оптимизации операционного качества", "conditions": "мы предлагаем принять участие в создании перспективных и масштабных продуктов/проектов, использовать лучшие современные практики и технологии; гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК. Мы быстро назначаем и проводим собеседования: интервью с HR -> техническое интервью -> оффер . Будем рады видеть вас частью нашей большой команды."}
{"id": "1000150878", "title": "Аналитик данных (Виртуальные ассистенты)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T15:27:19+03:00", "skills": ["Greenplum", "PostgreSQL", "Python", "Аналитик по данным", "Старший (Senior)", "big data владение методами анализа данных и моделирования", "базами данных", "Apache Airflow", "написания сложных sql", "навыки написания сложных sql", "Apache Hadoop", "методами анализа данных и моделирования"], "url": "https://career.habr.com/vacancies/1000150878", "requirements": "Высшее образование Опыт работы с базами данных, навыки написания сложных SQL-запросов, процедур, пакетов, оптимизации кода Опыт работы с Big Data Владение методами анализа данных и моделирования (Python + библиотеки для анализа данных) Какие задачи ожидают: Развитие внутреннего сервиса по построению рекомендаций для сотрудников Разработка и реализация различных метрик операционного качества Обработка ошибок в роли 3-й линии поддержки Сопровождение изменений в ПО и интеграции с внешними источниками Работа с базами данных и техническое описание процессов Запуск пилотов, стабилизационные работы и контроль Поиск, проработка и реализация сценариев по оптимизации операционного качества", "conditions": "гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке ВТБ Мы создадим комфортные условия для работы, предложим интересные и масштабные задачи, а также поможем профессионально расти и развиваться, участвовать в кросс‑командных проектах и определять собственную траекторию развития."}
{"id": "1000150875", "title": "Data Scientist (Моделирование РБ)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T15:27:19+03:00", "skills": ["алгоритмов ml", "Python", "python", "dl приветствуется", "Ученый по данным", "Apache Spark", "soft", "текстовыми данными приветствуется", "spark", "Средний (Middle)", "SQL"], "url": "https://career.habr.com/vacancies/1000150875", "requirements": "Требования: Опыт работы в банковском/финансовом/телеком/ритейл секторе от 2-х лет в роли аналитика/DS, понимание банковских бизнес-процессов, опыт в моделировании. Уверенное владение Python, Spark. Знание алгоритмов ML: деревьев решений и случайных лесов, регрессии, бустингов, кластеризации, временных рядов и др., понимание принципов работы рекомендательных систем и лежащих в основе алгоритмов, опыт работы с текстовыми данными приветствуется (NLP: тематическое моделирование, поиск ключевых слов, анализ тональности, задачи суммаризации, шаблонизации и др.). Умение работать в условиях многозадачности, самостоятельность. Знание DL приветствуется: опыт обучения и использования нейросетей и предобученных моделей (RNN, LSTM, BERT, GPT). Развитые навыки soft-skills. Опыт написания ТЗ, БТ, проектной документации. Способность поддержки full-stack разработки от сбора требований к задаче до реализации, документации и последующего мониторинга моделей. Наличие публикаций по ML/DL, опыт выступления на ML-конференциях – как плюс. Ценится проактивный и творческий подход в решении задач.", "conditions": "принять участие в создании перспективных и масштабных продуктов/проектов, нацеленных на улучшение ____, использовать лучшие современные практики и технологии; гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК. Мы быстро назначаем и проводим собеседования: интервью с HR -> техническое интервью -> оффер . Будем рады видеть вас частью нашей большой команды."}
{"id": "1000150832", "title": "Ведущий разработчик", "company": "ИТ-Холдинг Т1", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-03T13:28:03+03:00", "skills": ["реляционными субд", "хранилищами данных и понимание принципов их построения", "PostgreSQL", "Python", "Redis", "Высоконагруженные системы", "Бэкенд разработчик", "различными моделями данных", "для нас важны", "etl", "SQL"], "url": "https://career.habr.com/vacancies/1000150832", "requirements": "Какие знания и навыки для нас важны: Опыт разработки асинхронных сервисов и высоконагруженных приложений; Глубокое понимание принципов работы реляционных СУБД: ACID, многоверсионность, алгоритмы соединений, индексные структуры данных, типы оптимизаторов и т.д.; Опыт работы с хранилищами данных и понимание принципов их построения; Высшее образование; Опыт работы с реляционными СУБД: Oracle, PostgreSQL, MySQL и т.д.; Опыт работы с ETL-фреймворками; Опыт работы с различными моделями данных ​​​​", "conditions": "принять участие в создании перспективных и масштабных продуктов/проектов, использовать лучшие современные практики и технологии; гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК."}
{"id": "1000150820", "title": "Аналитик", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-03T13:27:28+03:00", "skills": ["банковской сферы и продуктов опыт работы с продуктами oracle уверенное знание pl", "Базы данных", "PostgreSQL", "Python", "планирования", "а также планирование и соблюдение сроков их выполнения навыки делового общения знание банковской сферы и продуктов опыт работы с продуктами oracle уверенное знание pl", "Системный аналитик", "продуктами oracle уверенное знание pl", "Средний (Middle)", "SQL", "приоритизации и декомпозирования задач"], "url": "https://career.habr.com/vacancies/1000150820", "requirements": "опыт работы в ИТ компаниях, подразделениях ИТ Банка от 1-3 лет навыки планирования, приоритизации и декомпозирования задач, а также планирование и соблюдение сроков их выполнения навыки делового общения знание банковской сферы и продуктов опыт работы с продуктами Oracle уверенное знание PL/SQL, написание SQL запросов знание, понимание и работа с методологией Agile (Scrum); умение работать с Jira, Confluence; английский язык (чтение и понимание технической документации); готовность работать удаленно из дома.", "conditions": "принять участие в создании перспективных и масштабных продуктов/проектов, нацеленных на улучшение, использовать лучшие современные практики и технологии; гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК. Мы быстро назначаем и проводим собеседования: интервью с HR -> техническое интервью -> оффер . Будем рады видеть вас частью нашей большой команды."}
{"id": "1000156036", "title": "Python разработчик (Трайб Data Office)", "company": "ОТП Банк", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T13:27:27+03:00", "skills": ["Vue.js", "Python", "swagger", "nginx", "python", "elasticsearch", "camunda", "Бэкенд разработчик", "java", "linux", "Средний (Middle)", "keycloak", "HTML", "apache airflow"], "url": "https://career.habr.com/vacancies/1000156036", "requirements": "Что мы ждём от тебя: Знание Python (с уклоном в backend/fullstack), html, js, css (vanilla js, vue/react); Опыт работы с Linux. Будет плюсом: Знание Nginx, keycloak, camunda, swagger, ElasticSearch, Apache Airflow, Java/Groovy. Чем предстоит заниматься: DATA GOVERNANCE & DATA QUALITY Доработка, настройка и сопровождение платформы Data Governance & Data Quality; Загрузка метаданных в платформу (интеграция с системами источниками, постановка на расписание, контроль загрузки данных); Настройка и управление ролевой моделью Data Governance; Реализация отчетности по управлению данными Банка; Разработка собственной аналитической платформы по управлению данными (Data Portal); Разработка платформы Data Quality; Реализация контролей качества данных; Настройка оркестрации выполнения проверок качества данных; Тестирование разработанного функционала Data Governance & Data Quality; Поддержание документации реализованного\\настроенного функционала платформы Data Governance & Data Quality.", "conditions": "Красивый офис/удобное рабочее место (м. Войковская) или удаленка на территории РФ ; Возможность изменять время начала и конца рабочего дня по согласованию с руководителем; Отсутствие строгого дресс-кода (мы лояльны к любому проявлению личного стиля); Программы поощрения ОТП Мания (когда ты за внутреннюю валюту можешь купить себе как толстовку, так и day-off, например); Welcome pack; ДМС (а также возможность его замены на фитнес); Льготные условия по кредитам и депозитам; BestBenefits – сервис скидок и привилегий (техника и электроника, рестораны и доставка, обучение, отдых, спорт, красота и здоровье, товары, развлечения, услуги, детские товары и развлечения); Управленческое обучение, развитие навыков личной эффективности, профессиональное развитие; Участие в корпоративных и спортивных мероприятиях (он-лайн и офф-лайн); Корпоративная библиотека; Детские подарки к Новому Году."}
{"id": "1000150819", "title": "Разработчик ETL/ DWH", "company": "ИТ-Холдинг Т1", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-03T12:53:52+03:00", "skills": ["Greenplum", "PostgreSQL", "Python", "sql", "Бэкенд разработчик", "DWH", "методологий проектирования dwh", "Средний (Middle)", "SQL", "ETL"], "url": "https://career.habr.com/vacancies/1000150819", "requirements": "Практический опыт использования СУБД для аналитических задач; Практический опыт работы на проектах BigData/DWH от 2 лет Дополнительным преимуществом будет являться опыт отраслевой реализации систем класса DWH в телекоме, банках, производстве, ретейле, а также знание методологий проектирования DWH: Inmon, Kimball, Data Vault, Anchor Modelling, Data Mesh и т.д. Стек: SQL (обязательно), Oracle, Greenplum, ClickHouse, PostgreSQL, Python, Airflow, NiFi, Hadoop, Spark, Kafka, Docker, Git", "conditions": "Что мы предлагаем: принять участие в создании перспективных и масштабных продуктов/проектов, использовать лучшие современные практики и технологии; гибкий формат работы — в офисе, удаленно или в гибридном формате; программа добровольного медицинского страхования; широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой. необходимая техника и софт для работы; конкурентная зарплата по итогам интервью и оформление по ТК."}
{"id": "1000150810", "title": "Ведущий разработчик (BIG DATA Моделирование РБ)", "company": "ИТ-Холдинг Т1", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T12:33:21+03:00", "skills": ["алгоритмов ml", "Python", "инструментами git", "пакетов nvidia для работы с данными и ml на базе cuda", "python", "java", "Бэкенд разработчик", "JavaScript", "паттернов проектирования микросервисов", "знание opencl", "bigdata", "для нас важны", "принципов ооп", "SQL", "Apache Hadoop", "корпоративными хранилищами данных и понимание принципов их построения"], "url": "https://career.habr.com/vacancies/1000150810", "requirements": "Какие знания и навыки для нас важны: - Знание принципов ООП - Знание Python - Опыт разработки веб-приложений/сервисов (Python/Java/JavaScript) - Опыт работы с BigData (Hadoop, pySpark, Airflow) - Знание алгоритмов ML - Уверенные знания SQL - Опыт работы с корпоративными хранилищами данных и понимание принципов их построения - Понимание методик unit-тестирования - Опыт работы с инструментами Git/Jenkins - Понимание принципов CI/CD Будет плюсом: - Опыт работы с BigData (Spark Streaming, Flink ML, Kafka, Artemis) - Знание паттернов проектирования микросервисов - Знание Java/ C++ - опыт работы с ML-библиотеками и библиотеками для работы с данными: pandas, numpy, sklearn, catboost, xgboost, lightgbm, pytorch, tf и др.) - Знание пакетов NVIDIA для работы с данными и ML на базе CUDA, знание OpenCL", "conditions": "- Разработкой кода для применения ML-решений в промышленных процессах Банка. - Проектированием и реализация решений для промышленного применения ML алгоритмов - Участвовать в системном анализе, оценке и обсуждении требований заказчика - Участвовать в развертывании ПО на тестовых и продуктивных средах - Участвовать в code review - Написанием Unit-тестов - Работать в Agile-команде"}
{"id": "1000150812", "title": "Automation engineer Python", "company": "ИТ-Холдинг Т1", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-03T12:33:20+03:00", "skills": ["Python", "python", "Инженер по автоматизации тестирования", "одним из баг", "корпоративными хранилищами данных и понимание принципов их построения", "bigdata", "для нас важны", "uft", "sql на уровне написания сложных запросов", "понимание принципов работы реляционных бд умение составлять тестовую документацию bug", "behave", "инструментами автоматизации selenium"], "url": "https://career.habr.com/vacancies/1000150812", "requirements": "Какие знания и навыки для нас важны: Опыт разработки функциональных автоматизированных тестов, нагрузочного тестирования Владение SQL на уровне написания сложных запросов, понимание принципов работы реляционных БД Умение составлять тестовую документацию bug/case/check-list Опыт работы с одним из баг-трекеров Jira\\Redmine\\Mantis Опыт разработки и обновление тестовых сценариев Написание Unit и REST-тестов Понимание принципов CI/CD Опыт работы с инструментами автоматизации Selenium, Python, Behave, UFT/QFT, SOUP UI и др. Опыт работы c GIT Будет плюсом: - Опыт работы с BigData (Hive, HBase, Cassandra, Spark, Spark Streaming, Flink ML) - Опыт работы с корпоративными хранилищами данных и понимание принципов их построения - Опыт разработки веб-приложений/сервисов (Python/Java/JavaScript)", "conditions": "Обязанности: Построение и развитие процесса автоматизации тестирования Разработка и обновление автотестов Проведение функционального автоматизированного тестирования, нагрузочного тестирования, ручного тестирования Опыт работы с инструментами автоматизации тестирования (Selenium, UFT/QTP, TestComplete и др) Разработка и поддержка автоматизированных тестов Разработка и оформление тестовых спецификаций (сценариев) Анализ результатов выполнения тестов, заведение дефектов Анализ требований (полнота, непротиворечивость, тестируемость) Опыт написания проверок качества данных."}
{"id": "1000153380", "title": "Аналитик отчетных систем DWH", "company": "Совкомбанк Технологии", "city": "Новосибирск", "remote": false, "published_at": "2025-05-03T12:27:32+03:00", "skills": ["Python", "ClickHouse", "YouTrack", "Системный аналитик", "аналитических", "Apache Airflow", "Средний (Middle)", "Oracle", "SQL", "Oracle PL/SQL"], "url": "https://career.habr.com/vacancies/1000153380", "requirements": "Чем предстоит заниматься: Анализ требований от заказчика в рамках задач по построению отчетных витрин на базе Хранилища данных (ХД); Исследование источников данных, анализ данных в ХД; Анализ и проектирование элементов архитектуры решения и интеграционных потоков; Визуализация данных с использованием BI систем; Подготовка технической документации на разработку для разработчиков ХД и в команду сопровождения; Контроль реализации задач: тестирование и приемка; Ведение проектной документации; Аналитическое сопровождение действующих проектов; Подготовка информации по запросу бизнес-подразделений группы компаний Совкомбанк. От кандидата ожидаем: Базовые знания теории в области ХД; Хорошие знания SQL, PL/SQL (чтение и написание запросов любой сложности; понимание и умение пользоваться DML/DDL конструкциями; знание аналитических (оконных) функций; понимание определения, назначения и применения индексов и партиций; чтение кода пакетов); Опыт в доработках хранилищ данных: исследование данных систем-источников, описание преобразований данных (ETL), проектирование витрин; Опыт проектирования реляционной модели данных; Опыт сбора требований и постановки задач разработчикам; Опыт составления проектной документации; Аналитический склад ума. Будет вашим преимуществом: Работа в банковской сфере, финансовом секторе, страховом бизнесе; Участие в проектах развития ХД; Работа с BI инструментами; Участие в проектах развития отчетных модулей систем; Участие в проектах с использованием методологий гибкой разработки; Опыт прикладного программирования. Мы ценим: Самостоятельность, но в тоже время работу с командой и на команду; Умение общаться с разными заказчиками, находить оптимальные и красивые решения; Умение довести задачу до конца; Стремление получить новые знания и делиться ими со всей командой.", "conditions": "Что тебя ждет: Официальное оформление с первого дня – наша IT-компания аккредитована; Развитие профессиональной экспертизы: ты сможешь обучаться и посещать конференции и митапы за счёт Банка; Классная команда – мы за радость общения и дружбу в коллективе; Комфортный офис – у нас уютные рабочие пространства, комнаты отдыха с настольным теннисом, кикером, плойкой и другими плюшками; Коворкинги в Сочи и на Алтае – туда можно отправиться поработать и отдохнуть в режиме 4/3 за счёт Банка; Более 50 социальных программ – ДМС со стоматологией и страхованием от несчастных случаев и болезней, изучение английского, софинансирование летнего, зимнего и тематического отпуска, уникальные условия по продуктам и услугам Банка; Забота о детях: мы проводим праздники и экскурсии для детей наших сотрудников, софинансируем частный детский сад, отдых в лагере и подготовку к экзаменам; Много спорта: у нас есть клубы и секции, можно заниматься любым спортом за счёт Банка и участвовать в корпоративных турнирах и чемпионатах. Также мы софинансируем коллегам абонементы в фитнес-клубы; Вовлеченность, комфорт и свобода. У нас минимум бюрократии, нет дресс-кода, гибкое начало и завершение рабочего дня; Самая яркая корпоративная культура – летние IT-фесты, путешествия по России и за её пределами!"}
{"id": "1000150808", "title": "DevOps-инженер", "company": "ИТ-Холдинг Т1", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-03T12:27:32+03:00", "skills": ["Kubernetes", "Linux", "PostgreSQL", "Apache Kafka", "Python", "технологиями контейнеризации", "Docker", "DevOps-инженер", "scala", "pyspark", "Средний (Middle)", "SQL", "одного из инструментов создания сценариев и автоматизации"], "url": "https://career.habr.com/vacancies/1000150808", "requirements": "Знания и навыки, которые для нас важны: Опыт развертывания и управления кластерами Spark. Уверенные знания одного из менеджеров кластеров Spark (YARN, Mesos). Автоматизация процесса развертывания и оптимизация CI/CD. Знание одного из инструментов создания сценариев и автоматизации (Ansible, Terraform, Jenkins). Опыт работы с технологиями контейнеризации (Docker, Kubernetes). Будет плюсом: Опыт работы с PySpark, Scala. Понимание принципов сетевой безопасности и лучших практик. Опыт работы в Agile/Scrum командах. Способность решать сложные технические задачи и быстро осваивать новые технологии. Опыт работы в области инфраструктуры ML и инженерии данных.", "conditions": "Задачи, которые мы предлагаем: Spark: Развертывание, настройка кластеров Spark и управление ими Оптимизация производительности кластера и использования ресурсов Общение с командой разработки ML Внедрение решений для мониторинга и ведения логов для кластера Spark Оптимизации Spark и настройки производительности API Gateway: Установка и настройка API Gateway (например, NGINX, Kong, Apigee) Настройка маршрутизации, балансировки нагрузки и управления API Развертывание БД: Развертывание и настройка реляционных (например, PostgreSQL, MySQL) или NoSQL баз данных (например, MongoDB, Cassandra) Обеспечение резервного копирования, восстановления и репликации данных Kafka: Установка и настройка Apache Kafka Настройка кластеров Kafka, брокеров, тем и клиентов Обеспечение отказоустойчивости и мониторинга Kafka"}
{"id": "1000153379", "title": "Аналитик отчетных систем DWH", "company": "Совкомбанк Технологии", "city": "Санкт-Петербург", "remote": false, "published_at": "2025-05-03T12:27:32+03:00", "skills": ["Python", "ClickHouse", "YouTrack", "Системный аналитик", "аналитических", "Apache Airflow", "Средний (Middle)", "Oracle", "SQL", "Oracle PL/SQL"], "url": "https://career.habr.com/vacancies/1000153379", "requirements": "Чем предстоит заниматься: Анализ требований от заказчика в рамках задач по построению отчетных витрин на базе Хранилища данных (ХД); Исследование источников данных, анализ данных в ХД; Анализ и проектирование элементов архитектуры решения и интеграционных потоков; Визуализация данных с использованием BI систем; Подготовка технической документации на разработку для разработчиков ХД и в команду сопровождения; Контроль реализации задач: тестирование и приемка; Ведение проектной документации; Аналитическое сопровождение действующих проектов; Подготовка информации по запросу бизнес-подразделений группы компаний Совкомбанк. От кандидата ожидаем: Базовые знания теории в области ХД; Хорошие знания SQL, PL/SQL (чтение и написание запросов любой сложности; понимание и умение пользоваться DML/DDL конструкциями; знание аналитических (оконных) функций; понимание определения, назначения и применения индексов и партиций; чтение кода пакетов); Опыт в доработках хранилищ данных: исследование данных систем-источников, описание преобразований данных (ETL), проектирование витрин; Опыт проектирования реляционной модели данных; Опыт сбора требований и постановки задач разработчикам; Опыт составления проектной документации; Аналитический склад ума. Будет вашим преимуществом: Работа в банковской сфере, финансовом секторе, страховом бизнесе; Участие в проектах развития ХД; Работа с BI инструментами; Участие в проектах развития отчетных модулей систем; Участие в проектах с использованием методологий гибкой разработки; Опыт прикладного программирования. Мы ценим: Самостоятельность, но в тоже время работу с командой и на команду; Умение общаться с разными заказчиками, находить оптимальные и красивые решения; Умение довести задачу до конца; Стремление получить новые знания и делиться ими со всей командой.", "conditions": "Что тебя ждет: Официальное оформление с первого дня – наша IT-компания аккредитована; Развитие профессиональной экспертизы: ты сможешь обучаться и посещать конференции и митапы за счёт Банка; Классная команда – мы за радость общения и дружбу в коллективе; Комфортный офис – у нас уютные рабочие пространства, комнаты отдыха с настольным теннисом, кикером, плойкой и другими плюшками; Коворкинги в Сочи и на Алтае – туда можно отправиться поработать и отдохнуть в режиме 4/3 за счёт Банка; Более 50 социальных программ – ДМС со стоматологией и страхованием от несчастных случаев и болезней, изучение английского, софинансирование летнего, зимнего и тематического отпуска, уникальные условия по продуктам и услугам Банка; Забота о детях: мы проводим праздники и экскурсии для детей наших сотрудников, софинансируем частный детский сад, отдых в лагере и подготовку к экзаменам; Много спорта: у нас есть клубы и секции, можно заниматься любым спортом за счёт Банка и участвовать в корпоративных турнирах и чемпионатах. Также мы софинансируем коллегам абонементы в фитнес-клубы; Вовлеченность, комфорт и свобода. У нас минимум бюрократии, нет дресс-кода, гибкое начало и завершение рабочего дня; Самая яркая корпоративная культура – летние IT-фесты, путешествия по России и за её пределами!"}
{"id": "1000156249", "title": "Продуктовый аналитик в Платформу", "company": "2GIS", "city": "Москва", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-03T10:55:36+03:00", "skills": ["стат", "Python", "sql", "прод уктовой командой и генерации предложений на основе данных", "основ математической статистики и теории вероятности", "B2B", "Продуктовый аналитик", "SQL"], "url": "https://career.habr.com/vacancies/1000156249", "requirements": "опыт работы прод уктовым аналитиком от 3 лет; уверенное знание SQL; опыт работы с прод уктовой командой и генерации предложений на основе данных; умение грамотно формулировать выводы и рекомендации по итогам исследований; знание основ математической статистики и теории вероятности; опыт в построении информативных дашбордов. Будет плюсом: опыт работы в b2b прод уктах; знание стат. языков ( Python ); опыт А/B-тестов; опыт ETL-процессов. Какие задачи предстоит решать: анализировать запущенные фичи, оценивать их эффективность и влияние на пользователей; проверять продуктовые гипотезы на основе накопленных данных; исследовать поведение пользователей для поиска точек роста; проводить предварительную оценку продуктовых гипотез для их приоритизации и формирования роадмапа; информативно представлять данные в системах визуализации (Grafana, PowerBI).", "conditions": "2ГИС — аккредитованная IT-компания. У нас можно работать удалённо. Для нас важен специалист, а не его локация. Если хочешь работать в гибридном формате, у нас есть офисы в Москве, Санкт-Петербурге, два классных офиса в Новосибирске. А также коворкинги в Нижнем Новгороде, Томске, Астане, Алма-Ате. График не главное. Кто-то начинает работу в 9, кто-то в 11, а кто-то — когда удобно ему и команде. Главное — выполнять задачи в срок и быть на связи с коллегами. Само собой, полностью белая зарплата, размер обсуждается на собеседовании, потолка нет. Есть ДМС, штатный терапевт, невролог, мед.консультант и другие IT-плюшки. Если хочешь делиться своим опытом, мы только за — поможем с выступлениями на конференциях и статьями для Хабра."}
{"id": "1000150774", "title": "Системный аналитик (команда РдМ)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-03T10:33:55+03:00", "skills": ["Python", "коммуникации и деловой переписки", "Системный аналитик", "C#", "для нас важны", "понимание архитектуры ис", "Средний (Middle)", "SQL", "программирования"], "url": "https://career.habr.com/vacancies/1000150774", "requirements": "Вместе с нами тебе предстоит: Сбор, формализация требований, интервьюирование бизнес-заказчиков; Взаимодействие со смежными подразделениями на проектах; Написание артефактов ИС по методологии Банка (требования, архитектурные артефакты и артефакты тестирования, релизная документация); Банковские процедуры внедрения/доработок ИС в продакшн. Какие знания и навыки для нас важны: Понимание полного цикла разработки ПО, минимальные навыки программирования, понимание архитектуры ИС, CI/CD; Математический бэкграунд; Понимание классов оптимизационных задач; Умение читать/корректировать математическую постановку задач; Понимание ML и применения методов машинного обучения; Отличные навыки коммуникации и деловой переписки; Наличие оконченного среднего-специального или высшего образования; Готовность работать на территории РФ.", "conditions": "Формат работы: в офисе, удаленно или в гибридном формате - по желанию; Принимать участие в создании перспективных и масштабных продуктов/проектов, нацеленных на улучшение, использовать лучшие современные практики и технологии; Гибкий формат работы — в офисе, удаленно или в гибридном формате; Программа добровольного медицинского страхования; Широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой; Необходимая техника и софт для работы;"}
{"id": "1000150771", "title": "Архитектор ML (Команда РдМ)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-03T10:27:58+03:00", "skills": ["Kubernetes", "Jenkins", "PostgreSQL", "Python", "Apache Kafka", "CI/CD", "платформами контейнеризации", "postgresql", "презентации", "ML разработчик", "camel", "kafka", "artemis mq", "инференс", "Java", "GitLab", "коммуникации", "решения конфликтов"], "url": "https://career.habr.com/vacancies/1000150771", "requirements": "Вместе с нами тебе предстоит: Анализ текущей архитектуры и участие в формировании стратегии развития продукта; Формирование концептуальных, функциональных, технических и архитектурных требований к разрабатываемым продуктам; Участие в процессее сбора требований и реализации (анализ потребностей, постановка задачи исполнителям/самостоятельная реализация, донесение до заказчика технических деталей реализации, презентация результатов бизнес-заказчику); Участие в оценке и валидации новых задач; Проработка новых проектов, в том числе с использованием LLM, интеграционных решений; Разработка требований к оборудованию, рассчет сайзинга; Общение с бизнес- и техническими заказчиками; Участие в выборе инструментов, технологического стека для решения новых задач; Защита архитектурных решений; Архитектурный надзор за разработкой решения. Для нас важно: Опыт работы в банке, телекоме, крупном системном интеграторе или консалтинговой компании от 3 лет; Опыт проектирования высоконагруженных отказоустойчивых систем; Опыт проектирования микросервисов и интеграционных решений; Опыт работы с платформами контейнеризации: Openshift, Kubernetes; Опыт разработки проектов с применением ML; Понимание MLOps процессов; - Понимание подходов к организации DevOps процессов; Понимание принципов информационной безопасности; Опыт планирования нагрузки, аппаратного обеспечения, создания сложных инфраструктурных решений; Знание PostgreSql, Kafka, Artemis MQ, Camel; Опыт разработки на Java, Python. Будет отлично, если у тебя есть: Понимание концепций LLM, RAG сервисов; Опыт работы с инференс-серверами (Nvidia Triton, TF Serving, и т.д.); Развитые навыки коммуникации, презентации, решения конфликтов; Опыт работы c Agile-практиками или в Agile-командах; Опыт ведения архитектурной документации, описания целевых решений; - Умение планирования работы, готовность принимать решения и добиваться поставленных целей в сжатые срок; Настойчивость, профессионализм, умение добиваться поставленных целей, умение работать в команде; Понимание основных банковских продуктов и процессов; Опыт работы большими объемами данных (big data, hadoop стек).", "conditions": "Принимать участие в создании перспективных и масштабных продуктов/проектов, нацеленных на улучшение, использовать лучшие современные практики и технологии; Гибкий формат работы — в офисе, удаленно или в гибридном формате; Программа добровольного медицинского страхования; Широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой; Необходимая техника и софт для работы; Конкурентная зарплата по итогам интервью и оформление по ТК."}
{"id": "1000150766", "title": "Senior Python разработчик", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-03T10:27:18+03:00", "skills": ["в web", "Базы данных", "Python", "PostgreSQL", "Redis", "Бэкенд разработчик", "Старший (Senior)", "git", "для нас важны", "Git", "SQL"], "url": "https://career.habr.com/vacancies/1000150766", "requirements": "Вместе с нами ты будешь: Разрабатывать backend часть системы; Участвовать в техническом развитии и масштабировании продукта; Прорабатывать архитектурные решения и интеграции; Реализовывать интеграционные взаимодействия внутри системы и обмен с другими системами; Участвовать в планировании и обсуждении задач. Какие знания и навыки для нас важны: Опыт разработки на Python от 3 лет; Опыт работы с в web-фреймворками (flask, fast-api, aiohttp); Опыт работ с любым брокером сообщений Kafka, Artemis MQ, Rabbit и др.; Опыт покрытия кода Unit тестами; Опыт работы с Git; Опыт работы с БД (Redis, PostgreSQL) Опыт написания SQL-запросов; Оконченное Высшее либо Среднее специальное образование; Готовность работать на территории РФ.", "conditions": "Принимать участие в создании перспективных и масштабных продуктов/проектов, нацеленных на улучшение, использовать лучшие современные практики и технологии; Гибкий формат работы — в офисе, удаленно или в гибридном формате; Программа добровольного медицинского страхования; Широкие возможности внутреннего и внешнего обучения, корпоративные онлайн библиотеки; Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой; Необходимая техника и софт для работы; Конкурентная зарплата по итогам интервью и оформление по ТК."}
{"id": "1000140339", "title": "Стажер в сфере ИТ-систем и машинного обучения", "company": "Банк России", "city": "Москва", "remote": false, "published_at": "2025-05-02T18:52:14+03:00", "skills": ["MLOps-инженер", "Стажёр (Intern)", "Python", "SQL", "HTML", "R", "C#", "Java", "Aris", "WebTutor", "Машинное обучение"], "url": "https://career.habr.com/vacancies/1000140339", "requirements": "Имеете отличные знания теории вероятностей и математической статистики; Владеете современными языками программирования для обработки данных, умеете анализировать, структурировать, визуализировать данные, алгоритмизировать процессы; Имеете знания и умения в области построения ML-моделей; Знаете методологию проектного управления и разработки программного обеспечения; Умеете разрабатывать техническую документацию; Знаете английский язык на уровне понимания четкой устной речи, участия в деловой переписке, чтения специализированной литературы со словарем. Задачи Изучать нормативную и техническую документацию для возможной автоматизации процессов; Участвовать в цифровизации деятельности Банка России; Оптимизировать аналитические данные и разрабатывать автоматизированные инструменты; Заниматься построением моделей машинного обучения и проверкой гипотез; Участвовать во внедрении машинного обучения в бизнес-процессы; Развивать и поддерживать средства малой автоматизации в подразделении; Участвовать в технической поддержке программ-роботов и интернет-ресурсов.", "conditions": "Оплачиваемая стажировка продолжительностью до 6 месяцев; Гибкий график от 20 часов в неделю по согласованию с руководителем; Возможное трудоустройство при успешном прохождении стажировки; Получение уникального опыта в мегарегуляторе; Привлекательная система мотивации; Широкий социальный пакет; Корпоративное обучение; Удобное расположение офиса."}
{"id": "1000157318", "title": "Стажер в сфере информационной безопасности", "company": "Банк России", "city": "Москва", "remote": false, "published_at": "2025-05-02T18:45:50+03:00", "skills": ["Специалист по информационной безопасности", "Стажёр (Intern)", "Python", "PowerBI", "Apache Superset", "Jira", "Английский язык", "Техническая документация"], "url": "https://career.habr.com/vacancies/1000157318", "requirements": "Рассматривать технические решения и функциональные требования к вводимым в эксплуатацию информационным системам; Анализировать уязвимости и оценивать применимость в инфраструктуре Банка России; Обеспечивать работников носителями ключевой информации; Анализировать международный опыт в области информационной безопасности и киберустойчивости; Разрабатывать и анализировать проектную документацию (концепции, технические задания, функциональные требования, модели угроз и нарушителей, программ и методик испытаний);", "conditions": "Оплачиваемая стажировка продолжительностью до 6 месяцев; Гибкий график от 20 часов в неделю по согласованию с руководителем; Возможное трудоустройство при успешном прохождении стажировки; Получение уникального опыта в мегарегуляторе; Возможности профессионального и карьерного развития; Привлекательная система мотивации; Широкий социальный пакет; Корпоративное обучение; Удобное расположение офиса."}
{"id": "1000152205", "title": "Data Engineer", "company": "Bell Integrator", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-02T18:43:15+03:00", "skills": ["Инженер по данным", "экосистемой hadoop", "специфики python для ml", "Python", "SQL", "популярными субд должностные обязанности"], "url": "https://career.habr.com/vacancies/1000152205", "requirements": "Требования: ​​​​​​​Понимание или опыт разработки на python (ETL-процессы Airflow) Знание специфики python для ml: библиотеки (catboost, lightgbm e t.c.) Опыт работы с экосистемой Hadoop (HDFS, Hive, Spark, Oozie) Опыт работы с популярными СУБД Должностные обязанности: исследование источников данных (внешних данных, реплик АС Банка, других витрин); разработка и изменение витрин данных на Hadoop исходя из требований аналитиков данных; создание алгоритмов загрузки данных в витрины с учётом историчности, уникальности, логики обновления таблиц; написание функций для первичной обработки, преобразования и агрегации данных на Spark (Scala, Java, Python); Code Review изменений, предлагаемых коллегами из своей и соседних команд", "conditions": "Возможность участия в интересном проекте Возможность профессионального и карьерного роста в компании; Опыт работы в команде профессионалов; Уровень заработной платы обсуждается индивидуально. Гибридный формат работы (ст. Ленинский пр-кт)"}
{"id": "1000140334", "title": "Стажер в сфере информационных технологий", "company": "Банк России", "city": "Москва", "remote": false, "published_at": "2025-05-02T18:39:11+03:00", "skills": ["Аналитик технической поддержки", "Стажёр (Intern)", "Python", "PowerBI", "Apache Superset", "Jira", "Английский язык", "Техническая документация"], "url": "https://career.habr.com/vacancies/1000140334", "requirements": "Знаете принципы работы информационных систем и компьютерных сетей; Знаете принципы информационной безопасности при работе в сети Интернет; Знаете Confluence, Jira; Умеете работать с большими объемами информации; Знания в области администрирования серверных операционных систем будут преимуществом; Владеете Windows, знаете офисное ПО и приложения на уровне опытного пользователя.", "conditions": "Оплачиваемая стажировка продолжительностью до 6 месяцев; Гибкий график от 20 часов в неделю по согласованию с руководителем; Возможное трудоустройство при успешном прохождении стажировки; Получение уникального опыта в мегарегуляторе; Возможности профессионального и карьерного развития; Привлекательная система мотивации; Широкий социальный пакет; Корпоративное обучение; Удобное расположение офиса."}
{"id": "1000140337", "title": "Стажер в сфере аналитики данных и бизнес-анализа", "company": "Банк России", "city": "Москва", "remote": false, "published_at": "2025-05-02T18:36:29+03:00", "skills": ["Бизнес-аналитик", "Стажёр (Intern)", "Python", "SQL", "Git", "Confluence", "Jira", "PowerBI", "Microsoft Visio"], "url": "https://career.habr.com/vacancies/1000140337", "requirements": "Знаете основы статистики, построения информационных систем, бизнес-процессы; Имеете опыт обработки больших массивов данных из разных источников; Имеете опыт работы в ПО Confluence, Jira и опыт моделирования в Python; Умеете работать с базами данных, писать SQL запросы; Умеете анализировать, систематизировать и визуализировать информацию с помощью BI инструментов; Умеете проводить анализ рисков; Знаете английский язык на уровне чтения профессиональной литературы и участия в деловой переписке со словарем. Задачи Заниматься сопровождением и развитием ИТ-решений по поддержке деятельности подразделения; Проводить анализ новых процессов в части поиска ошибок и формирования предложений по оптимизации процесса; Проводить аналитические исследования, участвовать в подготовке информационно-аналитических и демонстрационных материалов; Автоматизировать формирование отчетов и аналитических материалов; Повышать качество данных во внутренних системах, готовить данные для BI-аналитики; Формировать дашборды по вопросам, относящимся к компетенции подразделения.", "conditions": "Оплачиваемая стажировка продолжительностью до 6 месяцев; Гибкий график от 20 часов в неделю по согласованию с руководителем; Возможное трудоустройство при успешном прохождении стажировки; Получение уникального опыта в мегарегуляторе; Привлекательная система мотивации; Широкий социальный пакет; Корпоративное обучение; Удобное расположение офиса."}
{"id": "1000156920", "title": "Инженер Linux L3 (терминальный сервер)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T17:40:51+03:00", "skills": ["для нас важны", "Системный администратор", "в сопровождении ос linux", "Linux"], "url": "https://career.habr.com/vacancies/1000156920", "requirements": "Вместе с нами тебе предстоит: Полный цикл сопровождения ОС Linux на инфраструктурных серверах TC - постинсталляционная настройка - процессы сопровождения (обновление, анализ производительности, мониторинг) - вывод из эксплуатации; Установка и адаптация под ОС Linux банковского ПО (как проприетарного, так и самописного) на ТС; Поддержка отечественной платформы для ТС на базе ОС Linux; Развитие мониторинга и capacity сервиса ТС на отечественной платформе; Участие в проактивной деятельности по недопущению инцидентов на инфраструктуре ТС; Ведение документации к решению и статей по операциям сопровождения в базе знаний. Какие знания и навыки для нас важны: Уверенные навыки в сопровождении ОС Linux (Debian,Ubuntu,Astra Linux); Опыт инсталляции операционной системы и настройки компонентов ОС (сеть, компоненты обеспечения ИБ, доменная авторизация, синхронизация времени); Опыт анализа неисправностей в работе компонентов ОС и прикладного ПО на уровне ОС; Опыт анализа и оптимизации производительности компонентов ОС и прикладного ПО; Опыт написания технической документации к решениям на базе ОС Linux.", "conditions": "Дополнительным плюсом будет: Понимание работы модулей ядра, умение анализировать работу ОС на уровне системных вызовов; Понимание принципов использования ОС системных ресурсов - оперативной памяти, процессорного времени, периферийного оборудования; Опыт настройки и анализа неисправностей сетевой подсистемы, умение анализировать сетевые дампы на транспортном уровне модели OSI; Опыт автоматизации операций администрирования с помощью bash/python/ansible/saltstack; Понимание работы ВРМ на базе Citrix XenApp/XenDesktop или других технологий ТС, в том числе отечественных; Опыт сопровождения серверной ОС Astra Linux."}
{"id": "1000156236", "title": "Senior DevOps", "company": "ИТ-компания «Лоция»", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-02T17:27:15+03:00", "skills": ["docker", "Python", "Старший (Senior)", "DevOps", "DevOps-инженер", "Prometheus", "Terraform", "GitLab", "Ansible"], "url": "https://career.habr.com/vacancies/1000156236", "requirements": "опыт администрирования серверов на базе дистрибутивов linux (Debian, RH или аналогичные); опыт настройки веб серверов( nginx, apache, haproxy); опыт написания пайплайнов для деплоя сервисов и развёртывания инфраструктуры в Azure DevOps (TFS); опыт написания скриптов для автоматизации (bash); опыт работы с docker (сборка и адаптация образов, оркестрация docker-compose); опыт администрирования кластеров k8s (развёртывание, поиск и устранение проблем, регламентные операции); опыт написания helm-чартов; опыт сборки и поиска проблем при деплое приложений на .NET; опыт развёртывания и настройки BPMN систем (Camunda).", "conditions": "Официальное оформление со всеми социальными гарантиями Возможность работы в офисе, удаленно или в гибридном формате Комфортный офис в шаговой доступности от м. Войковская и МЦК «Балтийская» с компенсацией питания ДМС с телемедициной и стоматологией с первого дня работы; льготное подключение родственников Выгодный зарплатный проект с доступом к масштабной экосистеме сервисов Внешнее обучение и участие в конференциях, митапы, хакатоны и обмен практиками Полис путешественника и льготные программы страхования Свободный дресс-код и никакой бюрократии"}
{"id": "1000156233", "title": "Data Science", "company": "Альфа-Банк", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-02T17:27:15+03:00", "skills": ["Python", "sql", "python", "airflow", "sas", "impala", "Ученый по данным", "spark", "SQL"], "url": "https://career.habr.com/vacancies/1000156233", "requirements": "Высшее образование; Обязателен опыт работы DS; Владение Python, SQL, Impala; Владение Spark, Airflow, SAS (дополнительный плюс); Есть опыт написания требований для BI", "conditions": "Стабильный и прозрачный доход: размер заработной платы обсуждается по итогам собеседования; Возможность гибридного или удаленного графика работы; Карьерный рост: ты будешь понимать, что нужно сделать для перехода на другой уровень; Чувство локтя: у нас дружелюбная атмосфера и команда лучших профессионалов, которые готовы делиться с тобой экспертизой; Забота о твоем здоровье: программа ДМС, куда входит стоматология и обслуживание в лучших клиниках города, скидки на абонементы в фитнес-клубы, неформальные спортивные сообщества; Возможности для разнообразного досуга: скидки на услуги туристических агентств, продукты питания, в рестораны и бары, в магазины и салоны красоты."}
{"id": "1000147658", "title": "Ведущий Python разработчик/Senior Python Developer (Продукт: xData)", "company": "Группа Астра", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T17:27:03+03:00", "skills": ["postgresql в роли разработчика приложений", "Linux", "Python", "PostgreSQL", "Apache Kafka", "подходов в программировании", "linux", "языка python", "Бэкенд разработчик", "Старший (Senior)", "RabbitMQ", "REST", "Bash", "Git", "принципов ооп", "опыт промышленной разработки от 2", "инфраструктурой микросервисов", "и умение применять шаблоны проектирования"], "url": "https://career.habr.com/vacancies/1000147658", "requirements": "Обязанности: Разработка сервисов управления программно-аппаратным комплексом \"Тантор\": управление ресурсами/виртуализацией, управление резервным копированием, управление развертыванием, интеграция с GUI платформы управления \"Tantor\"; Участие в разработке технического дизайна и архитектуры; Взаимодействие с кросс-функциональными командами; Разработка и поддержка unit/integration тестов; Повышать стандарты разработки (использовать линтеры); Документирование функционала; Исправление ошибок в коде системы и решение критичных проблем. Требования: Опыт промышленной back-end разработки (Full-stack или опыт front-end будет плюсом); Написание и реализация REST API. Умение писать OpenAPI спецификацию (либо вручную либо с применением инструмента генерации); Хорошее знание языка Python, опыт промышленной разработки от 2-х лет; Создание микросервисов. Опыт работы с инфраструктурой микросервисов (Docker/Kubernetes) и механизмами обмена сообщениями; Знание принципов ООП, подходов в программировании (SOLID,KISS), знание и умение применять шаблоны проектирования; Опыт работы с PostgreSQL в роли разработчика приложений. Понимание плюсов и минусов ORM; Написание unit/integration тестов (pytest); Работа с Git; Английский (на уровне чтения технической документации); Опыт командной работы в дистанционном режиме; Будет плюсом: Хорошее знание Linux .Понимание что такое и как работают Linux namespaces и cgroups; Опыт применения ansible; Опыт работы очередью сообщений сообщений (Kafka, RabbitMQ, Redis, NATS) Использование Docker для сборки и тестирования кода; Участие в open source проектах; Понимание особенностей параллельной (parallelism) /конкуретной (concurrency) обработки; Автоматизация / написание скриптов на bash.", "conditions": "Условия: Уверенность в будущем. Мы чтим ТК РФ: у нас стабильный и прозрачный \"белый\" доход; Удаленка или офис? Тебе решать . Нам важны результаты, а не то, где ты находишься; Забота о здоровье . Оформим полис ДМС со стоматологией; Спорт — это про нас . У нас многие увлекаются сноубордом, лыжами, дайвингом, бегом и пр. – найти кого-то для afterwork-активностей не проблема. Мы спонсируем тренировки футбольной и волейбольной команд, поддерживаем инициативы по киберспорту и приходим на турниры по настольному футболу просто поболеть; Конкурентная заработная плата, обсуждается с успешным кандидатом."}
{"id": "1000156913", "title": "Архитектор", "company": "Т-Банк", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-02T17:21:30+03:00", "skills": ["Ведущий (Lead)", "Python", "Архитектор программного обеспечения", "Java", "проектирования высоконагруженных распределенных систем есть опыт вовлечения команд разработки в проектирование решений будет плюсом опыт применения ml в разрабатываемых системах", "Golang"], "url": "https://career.habr.com/vacancies/1000156913", "requirements": "Требования У вас есть опыт в разработке от 5 лет и в роли архитектора от 2 лет Хорошо разбираетесь в одном из стеков разработки — .NET, Java, Python, Go, Scala, C++ — и готовы писать код Есть навыки проектирования высоконагруженных распределенных систем Есть опыт вовлечения команд разработки в проектирование решений Будет плюсом опыт применения ML в разрабатываемых системах", "conditions": "Мы предлагаем Работу в офисе или удаленно — по договоренности Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Комплексную программу заботы о здоровье. Оформим полис ДМС с широким покрытием и страховку от несчастных случаев. Предложим льготные условия страхования для ваших близких Возможность работы в аккредитованной ИТ-компании Линейку льготных тарифов на продукты Т‑Банка Частичную компенсацию затрат на спорт Well-being-программу, которая помогает улучшить психологическое и физическое здоровье, а также разобраться с юридическими и финансовыми вопросами Три дополнительных дня отпуска в год Достойную зарплату — обсудим ее на собеседовании"}
{"id": "1000145803", "title": "Программист Python (senior/Lead)", "company": "ИТ-Холдинг Т1", "city": "Краснодар", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T16:54:17+03:00", "skills": ["типичные паттерны", "NumPy", "Docker", "Старший (Senior)", "RabbitMQ", "реляционными субд", "Kubernetes", "ним", "PostgreSQL", "изображениями и библиотеками компьютерного зрения и ocr", "FastAPI", "основ теории алгоритмов", "транзакционность", "Бэкенд разработчик", "Asyncio", "особенностей и нюансов реализации микросервисной архитектуры", "restful взаимодействие", "Python", "Apache Kafka", "Высоконагруженные системы"], "url": "https://career.habr.com/vacancies/1000145803", "requirements": "Опыт проектирования и разработки высоконагруженных и отказоустойчивых приложений, лаконичной архитектуры приложения; Понимание принципов работы асинхронного кода и опыт работы с ним (asyncio, fastapi); Опыт работы с реляционными СУБД (PostgreSQL) и брокерами сообщений (Kafka, RabbitMQ, ActiveMQ Artemis); Знание особенностей и нюансов реализации микросервисной архитектуры, типичные паттерны, RESTful взаимодействие, транзакционность; Опыт работы с CI/CD (jenkins, teamcity), оркестраторами контейнеризации (k8s, OS4, Docker), системами контроля версий (git); Знание основ теории алгоритмов. Будет плюсом: Опыт работы в проектах, связанных с машинным обучением и работой с данными (nympy); Опыт работы с изображениями и библиотеками компьютерного зрения и OCR (pillow, openCV, pytesseract); Опыт горизонтального взаимодействия с несколькими проектными командами.", "conditions": "Официальное оформление по ТК, белая зарплата; Возможность принять участие в создании перспективных и масштабных продуктов, нацеленных на улучшение и автоматизацию бизнес-процессов; Современный стек технологий; Программа ДМС со стоматологией после прохождения испытательного срока; Корпоративные скидки на занятия спортом в сети фитнес клубов, на онлайн обучение Skyeng, Skillbox; Мы аккредитованная IT-компания; Удаленный формат"}
{"id": "1000145932", "title": "Tech lead", "company": "ONY", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T16:34:50+03:00", "skills": ["Node.js", "Vue.js", "методологий управления проектами и грамотное применение их в нужной ситуации", "Построение команды", "Ведущий (Lead)", "Python", "PHP", "Управление разработкой", "It-консультирование", "Управление людьми", "Оптимизация кода", "Технический директор"], "url": "https://career.habr.com/vacancies/1000145932", "requirements": "Кого мы ищем: Опыт работы разработчиком от 3-х лет, опыт работы тимлида от 1 года (готовы рассмотреть опытного разработчика с софт скиллами и амбициями тимлида); Опыт работы с e-com компаниями (разработка e-com, корпоративных сайтов, мобильных приложений, маркетплейсов); Работа с документацией проекта: ERD, BPMN, Прототипы; Опыт ведения проектов с распределенной мультидисциплинарной командой (разработчики, DevOps, QA, дизайнеры, аналитики); Понимание основных этапов жизненного цикла разработки сайтов и мобильных приложений— Знание методологий управления проектами и грамотное применение их в нужной ситуации; Умение в обсуждении обосновать свою точку зрения; Аналитическое мышление и системный подход к работе; Опыт сбора требований к проекту; Умение декомпозировать проект на простые функции и оценить трудоемкость их реализации. Чем предстоит заниматься: Встречи с клиентом на Этапе продажи для выяснения тех требований по проекту Представление команды разработки в своем лице перед заказчиком для запроса вводных (для интеграции с 1С например), ответов на вопросы команде разработчиков клиента, обоснования технических решений; Разработка флоу ведения проектов по разработке с подрядчиками; Скоринг подрядчиков; Валидация и самостоятельное составление смет; Регулярная тех. экспертиза проектов по критериям готовности (техническому value), ТЗ, разработка таких критериев готовности; Помощь подрядчикам в правильном составлении ТЗ; Проверка информационной архитектуры проектов, зависимости данных и т д (особенно актуально для проектов с множеством интеграций); Код ревью с подрядчиками; Контроль безопасности системы (гит, чек-лист); Аудит оценки часов; Апдейт нормативов; Аудит технических решений на проектах и помощь в поиске более простых/дешевых аналогов (для увеличения ценности продукта для клиента, уменьшения проектных расходов/сроков, предупреждения костылей для более эффективного будущего масштабирования или в спорных кейсах с клиентом/заказчиком); Ресерч рынка для поиска новых технических решений; Курирование архитектурных решений; Стандартизация инженерных подходов, код стайл, документирование; Организация и внедрение авто тестов.", "conditions": "С нас: Проекты, которыми можно гордиться, а также лучшая команда на рынке, повернутая на качестве продукта; Вечеринки и выездные ивенты в Москве; Просторный офис на Красном октябре с баром, библиотекой и лофтом для вечеринок; Внутреннее обучение в области дизайна, стратегии и технологий; Skill Share Club — шеринг знаний между отделами, каждый месяц. Например, обсуждаем инклюзивный дизайн, генеративную графику и WebGL, шрифты и даже исследование сексуальности. Условия: ЗП по результатам знакомства (фикс + бонусы); Рабочая неделя 5/2, с 10:00-19:00 c перерывом на обед; Возможность работать дистанционно или в офисе, по желанию."}
{"id": "1000155429", "title": "SRE в One Cloud", "company": "VK", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T16:27:03+03:00", "skills": ["Linux", "Python", "серверной инфраструктурой на базе linux", "уверенные знания linux опыт работы с сетью", "cfengine", "Инженер по доступности сервисов", "go и java", "системами на базе rhel опыт работы с веб", "cassandra", "scm", "Средний (Middle)", "zabbix и vault знание go и java"], "url": "https://career.habr.com/vacancies/1000155429", "requirements": "Задачи: Эксплуатировать парк серверов облака (в том числе bare metal) — более 10 000 хостов Постоянно обновлять парк серверов — мы стараемся эффективнее использовать каждый юнит в дата-центрах Управлять инцидентами — в связке с командами мониторинга и разработки устранять сбои и предотвращать их повторение Автоматизировать процессы эксплуатации и оркестрации — при наших объёмах задачи решаются через код Участвовать в разработке и внедрении новой функциональности облака Требования Коммерческий опыт работы в релевантной роли SRE, DevOps, системного инженера от трёх лет Опыт работы с серверной инфраструктурой на базе Linux, уверенные знания Linux Опыт работы с сетью — iptables, BGP, VRRP Опыт работы с SCM — Puppet, Salt, Ansible Опыт автоматизации на Bash Будет плюсом Опыт работы с системами на базе RHEL Опыт работы с веб-хостингом — nginx, серверы приложений, MySQL, Postgres Опыт работы с CFEngine, Cassandra, Zabbix и Vault Знание Go и Java", "conditions": "Работа в VK — это: возможность создавать продукты и сервисы, которые меняют к лучшему жизнь миллионов пользователей; амбициозные задачи, масштабные проекты и возможности для профессионального роста; совместные интересы и увлечения: помогаем раскрывать таланты и отлично проводить свободное время; работа в команде профессионалов из разных сфер, которые всегда готовы поделиться опытом; программа благополучия: заботимся о здоровье и хорошем самочувствии сотрудников; компенсация питания в кафе и ресторанах рядом с офисами — 800 рублей в день; компенсация спортивных активностей — 30 000 рублей в год в регионах и 35 000 рублей в год в Москве и в Санкт-Петербурге; 17 корпоративных команд по 12 видам спорта. Присоединяйтесь к нашей команде, чтобы создавать сервисы и технологии, которые улучшают качество жизни миллионов людей."}
{"id": "1000156886", "title": "QA engineer (Manual)", "company": "ИТ-Холдинг Т1", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-02T16:19:23+03:00", "skills": ["тест дизайна", "sql на уровне создания запросов c join", "Agile", "Postman", "принципов и методологий тестирования", "Функциональное тестирование", "менеджерами очередей", "union", "Ручное тестирование", "таск", "Инженер по ручному тестированию", "основ ооп", "SQL", "docker", "Python", "Apache Kafka", "REST", "разработка тестовых сценариев для ручного и автоматизированного тестирования веб", "SOAP", "системами контроля версий понимание процессов ci"], "url": "https://career.habr.com/vacancies/1000156886", "requirements": "С нами вам предстоит: Участие в поддержке тестовой стратегии; Анализ потребностей пользователей; Тестирование доработок: тестирование требований, выявление недостаточности условий, составление тест-кейсов и чек-листов по доработкам проекта, дальнейшее выполнение тестов и заведение ошибок, регрессионное тестирование, поддержка тестового покрытия сайта; Участие в планировании и оценке задач; Участие в повышении качества проекта; Взаимодействие с разработчиками, специалистами технической поддержки и остальными участниками команды для решения задач; Автоматизация регрессионного тестирования, проведения нагрузочных тестов; Участие в ведении метрик по качеству. Мы ожидаем от вас: Опыт работы более 3 лет; Опыт работы по Agile-методологиям; Опыт работы с таск-трекерами (Jira); Опыт тестирования API (REST/SOAP), работа с инструментами Postman, Soap UI; Опыт работы с менеджерами очередей (Kafka) Знание SQL на уровне создания запросов c join, union; Опыт анализа логов; Опыт создания и работы с заглушками API; Опыт работы с системами контроля версий Понимание процессов CI/CD Знание принципов и методологий тестирования; Знание тест дизайна, разработка тестовых сценариев для ручного и автоматизированного тестирования веб-приложений; Гибкость, умение и готовность работать в условиях постоянных изменений; Умение и готовность действовать проактивно, добиваясь максимального результата; Здоровый перфекционизм. Будет плюсом: Опыт автоматизации функционального тестирования; Знание основ ООП; Понимание основ контейнеризации. Опыт работы с Docker/ Kubernetes; Опыт работы в распределенной команде.", "conditions": "Гибкий график работы: в офисе, удаленно или в гибридном формате Поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников Сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь Корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого Насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги Корпоративная библиотека и многое другое Скидки и купоны от сотен компаний-партнёров на единой платформе Маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях Дополнительные выходные в дни радостных (и не только) событий Дополнительный оплачиваемый отпуск (3 календарных дня) Широкие возможности внутреннего и внешнего обучения Необходимая техника и софт для работы Конкурентная зарплата по итогам интервью, наличие премиальной составляющей Эксклюзивный зарплатный проект для сотрудников в банке ВТБ"}
{"id": "1000142817", "title": "Python developer / Разработчик Python (KORNFELD)", "company": "YADRO", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-02T15:50:19+03:00", "skills": ["Linux", "сетевых протоколов управления", "Python", "стека протоколов tcp", "xml", "linux", "форматами данных json", "опыт разработки приложений под linux", "Docker", "Бэкенд разработчик", "Старший (Senior)", "docker контейнерами", "bash", "Сетевые технологии", "yaml", "rpc", "сетевых технологий", "python3 в области сетевого программирования"], "url": "https://career.habr.com/vacancies/1000142817", "requirements": "уверенное владение Python3 в области сетевого программирования (sockets); знание сетевых технологий, стека протоколов TCP/IP + представление о модели OSI; знание сетевых протоколов управления (SNMP, NETCONF, RESTCONF), маршрутизации (RIP, OSPF, BGP) и др. отличное знание Linux, опыт разработки приложений под Linux/Unix; знание bash. Будет плюсом опыт работы с RPC-протоколами (JSON-RPC, gRPC), REST; опыт работы с форматами данных JSON, XML, YAML; опыт написания unit-тестов с использованием pytest; опыт асинхронного программирования (asyncio); опыт написания документации с использованием фреймворка Sphinx; опыт написания парсеров для структурированных файлов. опыт работы с Docker контейнерами.", "conditions": "стать частью амбициозной продуктовой компании, вносящей вклад в мировое инженерное сообщество, а также ежегодно увеличивающей долю рынка и финансовые показатели; конкурентную заработную плату; возможность гибридного или удаленного графика работы в зависимости от специфики задач; рабочее место в красивом и удобном лофт-офисе; ДМС с первых дней работы, включающую стоматологию, телемедицину, госпитализации, страховку выезда за рубеж; льготное страхование членов семей (покупку полиса по корпоративной цене); присутствие врача терапевта в офисе, возможность получить личную очную консультацию специалиста (1-2 раза в неделю); безлимитный доступ к онлайн-консультантам по вопросам: психологическое консультирование, финансового планирования, юридическим вопросам, ЗОЖ; частичную компенсацию занятий хобби и спортом; программы обучения и развития сотрудников; «Лекторий», в рамках которого приглашенные эксперты и наши специалисты регулярно делятся профессиональным опытом из различных областей науки; система премирования за научные достижения, публикацию статей и регистрацию патентов; внутренние комьюнити по профилям с регулярными встречами; корпоративная подписка на онлайн библиотеку с 11 000+ книгами и видео лекциями."}
{"id": "1000147027", "title": "Продуктовый аналитик (Middle/Senior)", "company": "Wanted.", "city": "Санкт-Петербург", "remote": false, "published_at": "2025-05-02T15:37:14+03:00", "skills": ["Продуктовый аналитик", "Средний (Middle)", "SQL", "Python"], "url": "https://career.habr.com/vacancies/1000147027", "requirements": "Задачи, которыми предстоит заниматься: Сбор и анализ данных для выявления точек роста и возможностей для увеличения прибыли продукта (внутренние данные + анализ кон куре нтов); Сотрудничество с командами маркетинга и разработки для реализации выявленных на основе данных гипотез; Мониторинг показателей эффективности для оценки влияния изменений на продукт и его развитие; Менторинг/руководство junior-специалистами", "conditions": "Высокий уровень заработной платы; Возможность вертикального и горизонтального роста; Предоставление необходимой техники для работы; Удобный, гибкий график с возможностью гибрида после испытательного срока; Компенсация спорт а, обучения и медицинских расходов; Day-off по необходимости."}
{"id": "1000157295", "title": "Data Engineer", "company": "Альфа-Банк", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-02T14:34:04+03:00", "skills": ["Инженер по данным", "Python", "sql", "python", "airflow", "sas", "impala", "spark", "Средний (Middle)", "SQL"], "url": "https://career.habr.com/vacancies/1000157295", "requirements": "Высшее образование ; Владение Python, SQL, Impala; Владение Spark, Airflow, SAS (дополнительный плюс); Есть опыт написания требований для BI.", "conditions": "Стабильный и прозрачный доход: размер заработной платы обсуждается по итогам собеседования; Возможность гибридного или удаленного графика работы; Карьерный рост: ты будешь понимать, что нужно сделать для перехода на другой уровень; Чувство локтя: у нас дружелюбная атмосфера и команда лучших профессионалов, которые готовы делиться с тобой экспертизой; Забота о твоем здоровье: программа ДМС, куда входит стоматология и обслуживание в лучших клиниках города, скидки на абонементы в фитнес-клубы, неформальные спортивные сообщества; Возможности для разнообразного досуга: скидки на услуги туристических агентств, продукты питания, в рестораны и бары, в магазины и салоны красоты."}
{"id": "1000156861", "title": "Администратор ОС Linux (эксплуатация серверных ОС)", "company": "ИТ-Холдинг Т1", "city": "Москва", "employment": "Екатеринбург", "remote": false, "published_at": "2025-05-02T14:05:20+03:00", "skills": ["Docker", "Старший (Senior)", "стека tcp", "сетевых протоколов", "системами кэширования и обмена сообщениями", "написание и поддержка пайплайнов gitlab ci", "автоматизации рутинных задач администрирования серверов с помощью ansible", "Linux", "bash и python", "saltstack", "работы с контейнеризацией", "Администратор серверов", "Bash", "Ansible", "Python", "Высоконагруженные системы", "docker и kubernetes", "базами данных", "системами централизованного управления конфигурациями", "в том числе podman"], "url": "https://career.habr.com/vacancies/1000156861", "requirements": "Опыт работы от 3 лет по направлению ОС Linux; Опыт в управлении ролевой моделью предоставления доступов, гранулярное разграничение прав; Экспертные знания семейства ОС Linux; Понимание принципов администрирования серверных операционных систем Linux (UBUNTU, Debian), в том числе ОС Импортозамещенного стека; Умение решать задачи по поиску проблем и узких мест производительности ОС семейства Linux; Навыки автоматизации рутинных задач администрирования серверов с помощью Ansible, Saltstack, Bash и Python, написание и поддержка пайплайнов Gitlab CI; Развитие сервисов системы автоматизации и внедрение новых инструментов, подготовка шаблонов виртуальных машин и образов развертывания физических серверов; Знания принципов работы базовых инфраструктурных сервисов (DNS NTP LDAP DHCP и т.д.); Знание сетевых протоколов, стека TCP/IP, умение решать проблемы и устранять неисправности; Навыки работы с контейнеризацией, в том числе Podman, Docker и Kubernetes; Опыт работы с системами централизованного управления конфигурациями (ansible, SaltStack, Puppet, и пр.); Опыт работы с базами данных, системами кэширования и обмена сообщениями (Scilla, Redis, Kafka, Artemis, PostgreSQL); Умение эффективно документировать процессы и процедуры в рамках сопровождаемых систем; Умение быстро искать и применять решения при аварийных ситуациях; Опыт решения кросс функциональных задач, взаимодействие с заказчиками различных уровней; Готовность к постоянному обучению и совершенствованию soft/hard навыков.", "conditions": "график 5/2; гибрид (1-2 раза в неделю работа в офисе)"}
{"id": "1000147017", "title": "QA/Тестирование", "company": "GlobalCareer", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T13:58:07+03:00", "skills": ["Инженер по автоматизации тестирования", "Средний (Middle)", "SQL", "Java", "Тестирование API", "Agile", "SOAP", "REST", "Python", "Kotlin", "C#", "TDD/BDD"], "url": "https://career.habr.com/vacancies/1000147017", "requirements": "QA Full-Stack (Manual+Auto): Опыт в тестировании бэкенда от 3 лет Есть опыт автоматизации тестирования с использованием Java, Kotlin или JS Знаете теорию тестирования и тест-дизайн — умеет применять основные техники, составлять чек-листы и тест-планы под задачи Разбираетесь в SQL — джойны, группировки Умеете работать с API (REST/SOAP) и системами логирования — отчетами, алертами и дашбордами Разбираетесь в GitLab, умеете работать с пайплайнами и логами. A QA (Java/Kotlin): У вас есть опыт работы в качестве автоматизатора тестирования/SDET от 2 лет Хорошо разбираетесь в автоматизированных сценариях на Java/Kotlin, есть опыт их разработки Есть опыт автоматизации с использованием фреймворка TestNG или JUnit Умеете работать с REST API, SOAP API, HTTP/HTTPS, gRPC, Avro Знаете SQL: DML-, DDL-запросы, JOIN, группировки и агрегирующие функции Есть опыт использования систем сборки: Maven, Gradle и других Есть опыт настройки CI/CD с помощью TeamCity, Jenkins или GitLab Умеете работать по гибким методологиям, разделяете их ценности и понимаете процессы", "conditions": "Работу в офисе или гибридный формат — по договоренности с руководителем Трудоутройство по ТК РФ Платформу обучения и развития. Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Линейку льготных тарифов на продукты Банка Комплексную программу заботы о здоровье. Оформим полис ДМС с широким покрытием и страховку от несчастных случаев. Предложим льготные условия страхования для ваших близких Возможность работы в аккредитованной ИТ-компании Частичную компенсацию затрат на спорт по окончании испытательного срока Компенсацию обедов и транспорта в дни посещения офиса Well-being-программу, которая помогает улучшить психологическое и физическое здоровье, а также разобраться с юридическими и финансовыми вопросами Три дополнительных дня отпуска в год Достойную зарплату — обсудим ее на собеседовании"}
{"id": "1000155976", "title": "FullStack QA (Python and NodeJS)", "company": "Wanted.", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T13:27:24+03:00", "salary_to": 4500, "currency": "USD", "skills": ["Node.js", "Python", "в частности rabbitmq", "typescript node", "Старший (Senior)", "python и фреймворки", "брокерами сообщений", "SQL", "Инженер по обеспечению качества", "русским и английским языком в2"], "url": "https://career.habr.com/vacancies/1000155976", "requirements": "Минимум 3 года опыта в тестировании внутренних приложений, REST или RPC API, с минимум 1 годом в роли разработчика или тестировщика модулей; Умение работать с реляционными базами данных SQL и хранилищами ключей и значений, в частности MySQL, PostgreSQL и Redis; Опыт работы с брокерами сообщений, в частности RabbitMQ; Знание Python и фреймворки: unittest, pytest; Знание TypeScript Node.js и фреймворки: jest, Mocha, vitest; Владение русским и английским языком В2. Будет плюсом: Понимание технологии blockchain и ее применения в финансовом секторе; Знакомство со смарт-контрактами и опыт программирования на Solidity; Docker, linux cli, работа в agile-команде. Чем предстоит заниматься: Написанием и поддержкой новых модульных тестов, улучшение существующих в кодовой базе ядра разработки; Написанием новых интеграционных и e2e тестов, поддержкой и улучшением существующих; Написанием модульных тестов для смарт-контрактов; Независимым написанием тестовых случаев для завершенных задач разработки; Отчетами об ошибках; Взаимодействием с командами QA из смежных проектов для согласования усилий по тестированию и обмена идеями.", "conditions": "Полностью удаленная работа (за пределами РФ); Высокая заработная плата; Оформление по ИП; Тайм-зона gmt +4 (+-1 час); Профессиональные курсы и конференции; Возможность релокации в страну, где у нас есть офис."}
{"id": "1000156810", "title": "Маркетинговый аналитик Middle+/Senior в аналитический стартап по маркетплейсам", "company": "ТОРГСТАТ", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T12:30:03+03:00", "salary_from": 150000, "salary_to": 250000, "currency": "RUB", "skills": ["MySQL", "ClickHouse", "Python", "clickhouse", "Маркетинговый аналитик", "написание сложных и эффективных sql", "Средний (Middle)", "SQL"], "url": "https://career.habr.com/vacancies/1000156810", "requirements": "Профессиональные качества: Уверенное владение ClickHouse, написание сложных и эффективных SQL-запросов Python (jupyter / colab, pandas, numpy и тп) Построение дашбордов в Datalens / Power BI / Tableu и тп Построение ETL-процессов Хорошая аналитическая база (теория вероятностей, математическая статистика, ML) Самостоятельность, инициативность, коммуникабельность Умение формировать и проверять гипотезы Умение грамотно аргументировать свою точку зрения Задачи: Выстраивание системы маркетинговых дашбордов для принятия решений. Написание SQL-скриптов + работа с ETL / оркестрацией Работа с командой маркетинга над гипотезами о привлечении пользователей. Маркетинговые и продуктовые исследования для поиска точек роста в продукте.", "conditions": "Только налоговые резиденты РФ Сфера финансовой аналитики - очень много цифр для анализа и построения прогнозов Полностью удаленная работа (для налоговых резидентов РФ) Гибкий график Очень сильная IT-команда (ex-Яндекс / Badoo) Официальное оформление по ТК Белая зарплата в рублях (размер обсуждается индивидуально) Перспективы роста в быстрорастущем стартапе Никаких планов по сокращениям/оптимизациям. Полная стабильность! Во 2 квартале 2025 года планируем получить статус аккредитованной IT-компании"}
{"id": "1000156846", "title": "Системный инженер в группу мониторинга", "company": "ЛАНИТ", "city": "Москва", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-02T12:09:57+03:00", "skills": ["DevOps-инженер", "Старший (Senior)", "Python", "Bash", "Linux", "Zabbix", "ELK Stack", "Grafana", "Prometheus"], "url": "https://career.habr.com/vacancies/1000156846", "requirements": "Опыт администрирования высоконагруженных систем мониторинга Zabbix, Prometheus; Опыт администрирования Grafana; Опыт администрирования кластерных решений на Elasticsearch; Умение и желание работать с API различных систем для создания интеграций или сбора данных; Написание запросов на PL/SQL (PostgreSQL/MySQL или другой); Опыт написания скриптов на bash, python,go; Хорошие знания сетевого стека TCP/IP, протокола SNMP. Будет плюсом: Опыт настройки систем VMware vROps и других систем мониторинга; Умение пользоваться инструментами CI/CD (Ansible+Gitlab+Jenkins/Bamboo). Опыт мониторинга оборудования.", "conditions": "Обязанности Поддержка системы мониторинга на базе Zabbix, Prometheus+Grafana; Написание фильтров, создание сложных запросов, дашбордов; Работа с бизнес-метриками; Администрирование ELK (Opensearch); Документирование реализованных решений для мониторинга, передача знаний коллегам; Проактивная работа с системами мониторинга с целью повышения эффективности и качества работы систем. Наш стек: Zabbix, ELK (OpenSearch), Prometheus(VictoriaMetrics), Grafana;"}
{"id": "1000156211", "title": "Senior Data Analyst [CVM B2B, МТС Веб Сервисы]", "company": "МТС", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T11:35:18+03:00", "skills": ["Apache Superset", "Python", "Аналитик по данным", "airflow", "Старший (Senior)", "git", "BI", "bi системами", "Apache Hadoop", "мат"], "url": "https://career.habr.com/vacancies/1000156211", "requirements": "опыт сбора и фиксации требований от бизнес-заказчика в проектной документации; умение декомпозировать требования и проводить постанализ; опыт работы с BI системами (Superset - как преимущество, Tableau, DataLens, Redash и т.д.); опыт написания технических заданий на разработку; продвинутый уровень SQL; хороший уровень Python. Будет плюсом: знание мат.статистики и теории вероятностей; высшее техническое образование; опыт работы с Airflow; опыт работы с Git, CI/CD.", "conditions": "собственную платформу MTS Ocean для получения ИТ-ресурсов, а это значит, что деплой, мониторинг, observability - не будут для вас проблемой, вы сможете сосредоточиться на фичах профессиональные гильдии инженеров по направлениям, чтобы поддерживать друг друга и обмениваться опытом внутреннюю площадку TechTalks для обмена опытом, дискуссий, развития навыков самопрезентации участие во внешних IT конференциях. Мы выступаем на HighLoad++, DataFest, Mobius, Test Driven Conf, Joker, DevOps, Матемаркетинг и даже проводим собственную конференцию по архитектуре Hello, conference! полезные курсы и вебинары в корпоративном университете и электронные библиотеки. А ещё: медицинскую страховку с 1 месяца со 100% покрытием расходов, включая стоматологию, страхование жизни и здоровья в поездках за рубеж. А еще можно застраховать родственников с корпоративной скидкой единую подписку МТС Premium — KION light в онлайн-кинотеатре KION, сервис МТС Music, 30 дней бесплатного пользования подпиской OZON Premium скидки и предложения от партнеров на фитнес, занятия английским и прочее."}
{"id": "1000132956", "title": "DevOps-инженер", "company": "ПСБ цифровая лаборатория", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-02T11:27:32+03:00", "skills": ["опыт в управлении инфраструктурой как код", "Linux", "Python", "gitlab", "контейнеризацией и оркестрацией", "инструментов логирования", "основных банковских инструментов автоматизации", "документацией", "инструментов мониторинга", "DevOps-инженер", "Bash", "Git"], "url": "https://career.habr.com/vacancies/1000132956", "requirements": "Опыт работы с Gitlab/Git обязателен; Знание основных банковских инструментов автоматизации (Nexus / Gitlab CI / Jenkins / Hashicorp Vault / SonarCube / Ansible / Salt) - как минимум, одного из перечисленных; Знание инструментов логирования (OpenSearch / ELK или иное); Знание инструментов мониторинга (Zabbix или иное); Опыт написания скриптов на Bash, Python, YAML; Опыт работы с документацией; Общие знания по виртуализации, сетям, операционным системам (приоритет Linux); Желателен опыт работы с контейнеризацией и оркестрацией, опыт в управлении инфраструктурой как код (Azure / Docker / Kubernetes / Openshift / TerraForm/ Chef/Puppet).", "conditions": "График работы: 5/2 с 9.00 до 18.00 (гибкое посещение офиса после прохождения онбординга) Официальное оформление в соответствии ТК РФ; Конкурентный уровень дохода: оклад+премии; Медицинская страховка, страховка для выезжающих за границу; Доплата к отпуску и больничному листу; Дополнительные льготы при заключении брака и рождении детей; Социальная поддержка при сложных жизненных ситуациях; Льготное кредитование для сотрудников; Обучение в Корпоративном университете банка; Корпоративная библиотека; Реферальная программа для сотрудников: приведи друга в ИТ и получи до 300 000 рублей."}
{"id": "1000157469", "title": "Python Developer (NTA)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-02T11:01:13+03:00", "skills": ["Бэкенд разработчик", "асинхронным", "Python", "linux на продвинутом уровне"], "url": "https://career.habr.com/vacancies/1000157469", "requirements": "Обязанности: Разработка программного обеспечения на языкe Python; Участие в разработке и ревью архитектуры; Участие в анализе требований; Написание unit-тестов; Проведение Code Review. Требования: Опыт разработки на языке Python от 3 лет; Опыт разработки микросервисов; Опыт работы с Linux на продвинутом уровне; Опыт работы с асинхронным / многопоточным кодом; Понимание принципов ООП; Опыт проведения код ревью.", "conditions": "Что мы предлагаем: стать частью сплоченной команды настоящих профессионалов своего дела; развивать вместе сложный продукт, построенный на современных технологиях; решать технически сложные задачи, проводить исследования, осваивать новые области."}
{"id": "1000142736", "title": "Application Security Engineer (безопасность приложений)", "company": "ПСБ цифровая лаборатория", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-02T10:50:32+03:00", "skills": ["языков", "Linux", "Python", "C++", "windows и linux", "Инженер по безопасности"], "url": "https://career.habr.com/vacancies/1000142736", "requirements": "Понимание архитектуры построения современной web-системы (клиент - сервер приложений - сервер базы данных) Практический опыт разработки ПО Общее знание языков (Java и/или С#), общее знания языка SQL (Standart Query Languаge)- написание запросов в базу данных Понимание сетевой модели OSI, опыт работы в Unix системах Готовность работать с документами (Бизнес требования, Технические задания, Схемы) Готовность к изучению новых языков программирования и прочих ИТ технологий Приветствуется опыт проектной деятельности, проведение Pentest, знание Windows и Linux - уровень администратора,понимание PKI инфраструктуры", "conditions": "График работы: 9.00-18.00, сокращенный рабочий день по пятницам до 16.45 Гибридный или удаленный формат работы после прохождения онбординга Официальное оформление в соответствии с ТК РФ Конкурентный уровень дохода: оклад + премии Медицинская страховка, страховка для выезжающих заграницу Доплата к отпуску и больничному листу Дополнительные льготы при заключении брака и рождении детей Социальная поддержка при сложных жизненных ситуациях Льготное кредитование для сотрудников Обучение в корпоративном университете банка Корпоративная библиотека Реферальная программа для сотрудников: приведи друга в ИТ и получи до 300 000 рублей"}
{"id": "1000137820", "title": "Fullstack Developer", "company": "FireChat.AI", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-02T03:43:56+03:00", "salary_from": 250000, "salary_to": 500000, "currency": "RUB", "skills": ["Фулстек разработчик", "Старший (Senior)", "Python", "Node.js", "Next.js", "Django", "MongoDB", "Linux", "SQL", "React"], "url": "https://career.habr.com/vacancies/1000137820", "requirements": "Role Responsibilities: Architectural Design and Planning : Architect the foundational structure of the web platform to ensure scalability, performance, and security, facilitating seamless AI integration and future growth. Web Development and User Interface : Focus on developing and maintaining our web platform, ensuring it's user-friendly, efficient, and seamlessly integrated with our AI functionalities. Performance Optimization : Your role involves optimizing the web platform for speed and efficiency. You'll ensure that the integration of AI components does not compromise the user experience, maintaining the responsiveness and reliability of our web interface. Database Management: Handle database functions, ensuring data integrity and security. AI Integration: Collaborate with AI specialists to integrate and optimize chatbot functionalities within the website. Cross-Functional Collaboration : While our LLM Engineer develop the AI agent, you'll be responsible for implementing these agents into a fully functional web application. Quality Assurance: Test the website and chatbot for functionality, usability, and reliability. Technical Skills: Proficiency in front-end languages (e.g., HTML, CSS, JavaScript) and frameworks (e.g., React, Angular). Expertise in back-end languages (e.g., Python, Java, Node.js) and frameworks (e.g., Django, Flask, Express). Experience with AI and machine learning technologies. Familiarity with database technology (e.g., MySQL, MongoDB). Knowledge of version control tools (e.g., Git) and DevOps practices.", "conditions": "Fully Remote Opportunity: Perfect for candidates in Visa/Mastercard-supported locations, flexible working hours with required availability for meetings during PST mornings and/or evenings."}
{"id": "1000141936", "title": "Senior Data Scientist в команду антифрода", "company": "Газпромбанк", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T23:27:26+03:00", "skills": ["Ученый по данным", "Старший (Senior)", "Python", "TensorFlow", "Машинное обучение", "PyTorch", "SQL"], "url": "https://career.habr.com/vacancies/1000141936", "requirements": "Чем ты будешь заниматься? Разрабатывать и внедрять моделей машинного обучения в проектах по борьбе с мошенничеством; Разрабатывать модели детектирования фрода: классификации, кластеризации, поиска аномалий; Рассчитывать экономический эффект от внедрения моделей; Готовить аналитические материалы, отчеты о разработке моделей; Принимать участие в подготовке и согласовании проектной документации на разработку; Проводить анализ различных источников данных, заниматься генерацией признаков для построения модели; Проверять гипотезы, проводить A/B тестирования; Заниматься комплексным анализом данных для выявления закономерностей и тенденций; Изучать новые технологии. Мы ждем, что вы: Строили рисковые модели; Имеете практический опыт полного цикла решения ML задачи: предобработка данных, выбор алгоритмов и тюнинг их параметров, оценка качества моделей, визуализация; Имеете степень бакалавра или магистра в области компьютерных наук, науки о данных, математики, статистики или смежных областях; Работаете в области анализа данных и машинного обучения от 2 лет; Программируете на Python, R или подобных языках; Знаете SQL на уверенном уровне (вложенные запросы, оконные функции). Будет плюсом, если вы: Знаете и понимаете метрики, необходимые для оценки качества моделей; Работали с фреймворками PyTorch / TensorFlow; Работали с Linux, bash, системами контроля версий.", "conditions": "Достойный уровень вознаграждения; ДМС со стоматологией с первого месяца работы; Удаленная работа или гибрид в Москве; Отпуск 33 дня + материальная помощь к отпуску; Полное соблюдение ТК РФ."}
{"id": "1000152686", "title": "Стажёр-разработчик (Android)", "company": "Яндекс", "city": "Ташкент", "employment": "Неполный рабочий день", "remote": false, "published_at": "2025-05-01T18:27:48+03:00", "skills": ["Разработчик мобильных приложений", "Стажёр (Intern)", "C++", "Python", "Kotlin", "Разработка под Android", "Разработка мобильных приложений", "Android studio"], "url": "https://career.habr.com/vacancies/1000152686", "requirements": "Мы ждём, что вы: — Знаете классические алгоритмы и структуры данных — Понимаете принципы работы с базами данных и организации клиент-серверных приложений — Разрабатывали приложения для Android — Владеете Kotlin или Java — Знакомы с Android SDK — Знаете узбекский, а также русский или английский языки Классно, если вы: — Работали в команде — Ведёте свои проекты на GitHub — Знаете C, C++ или Python", "conditions": "Что вас ждёт: — Оплачиваемая стажировка — Гибкий график: 20, 30 или 40 часов в неделю — Официальное оформление на стажировку или практику от вуза — Доступ к внутренним ресурсам и корпоративным возможностям Yandex — Реальные задачи: поиск решений для сервисов, которые действительно полезны многим — Наставник, который помогает расти и поддерживает — Экспертная и талантливая команда, у которой можно многому научиться — Комфортный хаб Yandex в Ташкенте со всем необходимым для работы — Возможность перейти в штат сразу после стажировки или позднее, воспользовавшись отложенным офером"}
{"id": "1000156221", "title": "Ведущий разработчик R&D", "company": "Cloud.ru", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T17:27:04+03:00", "skills": ["Ведущий (Lead)", "Python", "AWK", "C++ builder", "Проведение исследований", "и опыт разработки на одном или нескольких языков программирования", "Инженер встраиваемых систем", "Golang"], "url": "https://career.habr.com/vacancies/1000156221", "requirements": "Наличие экспертных знаний в одной из вышеперечисленных областей; Хорошее знание и опыт разработки на одном или нескольких языков программирования (C, C++, Java, Go, Python, Rust, sh, awk 😊 ); Опыт самостоятельного проведения исследований; Умение доносить свои мысли до собеседника; Наличие статей, научных публикаций, патентов по облачным и смежным технологиям является плюсом; Наличие научных степеней – приветствуется;", "conditions": "Подготовка аналитических обзоров на основе академических и коммерческих публикаций; Выявление трендов в развитии технологий; Формулирование гипотез и их проверка; Написание статей и подготовка патентов; Работа с продуктовыми командами по внедрению результатов исследований."}
{"id": "1000156185", "title": "Middle Fullstaсk (Python/JS) Developer [iOSS CM.DataSafe, МТС Веб Сервисы]", "company": "МТС", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T16:58:19+03:00", "skills": ["Python", "sql", "JavaScript", "Фулстек разработчик", "и умение использовать базовые библиотеки pandas", "Oracle DBA", "python 3", "Git", "javascript", "Средний (Middle)", "SQL", "numpy"], "url": "https://career.habr.com/vacancies/1000156185", "requirements": "знание Python 3.7+ и принципов ООП; знание и умение использовать базовые библиотеки Pandas, NumPy; опыт работы Django, ORM для разработки серверной части приложения; знание JavaScript; написание тестов для обеспечения качества кода и функциональности системы. Будет плюсом: знание SQL; опыт разработки на ExtJS; понимание CI/CD процессов (Docker, Kubernetes).", "conditions": "МЫ ПРЕДЛАГАЕМ: Собственную платформу MTS Ocean для получения ИТ-ресурсов, а это значит, что деплой, мониторинг, observability — не будут для тебя проблемой, ты сможешь сосредоточиться на фичах; Профессиональные гильдии инженеров, где мы поддерживаем друг друга и помогаем стать лучше; Внутреннюю площадку TechTalks для обмена опытом, дискуссий, развития навыков самопрезентации; Участие во внешних IT конференциях. Мы выступаем на HighLoad++, DataFest, Mobius, Test Driven Conf, Joker, DevOps, Матемаркетинг и даже проводим собственную конференцию по архитектуре Hello, conference!; Полезные курсы и вебинары в корпоративном университете и электронную библиотеку. А ЕЩЕ: ДМС с первого месяца работы, включая стоматологию; Страхование от несчастных случаев с 1 месяца работы. Материальную помощь в сложных жизненных ситуациях; Отпуск 28 календарных дней; Прием врачей общей практики и массаж в офисе; Мобильная связь за счет компании и льготные тарифы для близких; Подписка на онлайн-кинотеатр KION, сервис МТС Музыка, книжный сервис Строки от МТС, безлимитные мессенджеры и соцсети."}
{"id": "1000157634", "title": "Full Stack developer (React)", "company": "MVP Lab", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T16:42:07+03:00", "salary_from": 150000, "salary_to": 200000, "currency": "RUB", "skills": ["Node.js", "Next.js", "Python", "Redux", "триггеров", "React", "оптимизации запросов", "PHP", "Google Firebase", "JavaScript", "Фулстек разработчик", "функций", "google firebase или supabase", "Средний (Middle)", "javascript и typescript"], "url": "https://career.habr.com/vacancies/1000157634", "requirements": "Опыт работы от 4 лет с React.js; Node.js, Next.js; Отличное знание JavaScript и TypeScript; Опыт работы с Google Firebase или Supabase; Опыт создания backend-решений на любом стеке; Понимаешь принципы REST API и WebSockets; Знаешь, как работать с PostgreSQL (желательно знание триггеров, функций, оптимизации запросов); Умеешь разворачивать проекты на сервере, работаешь с Docker; Опыт CI/CD (например, GitHub Actions); Умеешь писать чистый, поддерживаемый код, разбираться в чужом коде (его много); Развитые коммуникативные навыки. 🚀 Чем предстоит заниматься Развитие существующих продуктов с активной пользовательской базой; Разработка новых проектов с 0, включая работу с AI моделями; Помогать улучшать архитектуру, предлагать решения; Поиск и изучение новых подходов и решений для ускорения процесса разработки или повышения качества и стабильности работы продукта. 👨🏻‍💻 Что дальше Откликайся на вакансию и напиши нам, чем тебя заинтересовала вакансия. Пригласим тебя на небольшое онлайн-интервью в zoom. Если мы с тобой решим, что нам интересно работать вместе, то предложим тебе выполнить тестовое, в качестве последнего шага.", "conditions": "Возможность на 100% удаленной работы; Уютная команда крутых спецаилистов; Оплата по договору за отработанные часы; Work-life balance на максималках."}
{"id": "1000135796", "title": "Data Analyst", "company": "Clickavia", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T16:34:58+03:00", "salary_from": 80000, "salary_to": 100000, "currency": "RUB", "skills": ["поиска неочевидных взаимосвязей", "Python", "sql", "Аналитик по данным", "clickhouse", "поиска точек роста на реальных данных", "bi системами", "SQL", "Младший (Junior)"], "url": "https://career.habr.com/vacancies/1000135796", "requirements": "Обязанности: • Разработка и поддержка дашбордов для отслеживания ключевых показателей компании - Ad hoc аналитика для поддержки текущих инициатив и операционных решений команды • Исследование потенциальных точек роста и возможностей для оптимизации процессов (user flow, коммерческие показатели, операционные процессы) - Активное взаимодействие с командой в области проведения экспериментов, настройки мониторинга по отклонениям и аномалиям и оценке продуктовых фич - Сбор и обработка данных из различных источников для подготовки отчетов и аналитических материалов Требования: - Отличное знание SQL (оконные функции, агрегации, оптимизация) и понимание того, как устроены БД. Отдельно приветствуется опыт работы с Clickhouse - Базовый опыт с Python на уровне pandas, numpy, requests для более сложных задач по аналитике - Понимание основ анализа данных и статистики. Умение презентовать результаты собственного анализа для широкого круга лиц - Опыт работы с BI системами. Отдельный плюс - работа с Superset, Metabase - Навыки поиска неочевидных взаимосвязей, поиска точек роста на реальных данных - Отличные коммуникативные навыки - Желание развивать в области аналитики, ML Будет плюсом: - Базовое знакомство с машинным обучением - Пет проекты на Python", "conditions": "Что мы предлагаем: - Интересные задачи, которые влияют на результаты компании - Возможность развиваться в области ML - Отсутствие бюрократии и кучи time consuming ритуалов -Удаленная работа с гибким графиком и возможностью совмещения часовых зон. -Участие в амбициозном проекте, направленном на изменение рынка онлайн-бронирования. -Поддержка и менторство со стороны более опытных коллег."}
{"id": "1000124477", "title": "Senior Python Developer", "company": "Clickavia", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T16:34:58+03:00", "salary_from": 3000, "salary_to": 4500, "currency": "USD", "skills": ["высоконагруженными проектами опыт использования postgresql", "Python", "Tornado Web Server", "Redis", "Бэкенд разработчик", "Старший (Senior)", "Asyncio", "Docker", "docker попадание в наш стек", "принципов работы и особенностей протокола http уровень уверенного пользователя linux", "git", "MongoDB"], "url": "https://career.habr.com/vacancies/1000124477", "requirements": "Чем предстоит заниматься Развивать ядро системы поиска перелётов и вспомогательные сервисы Разрабатывать и поддерживать интеграции с партнёрами Анализировать и оптимизировать производительность и потребление ресурсов Настраивать сторонние компоненты (БД, системы метрик и т.п.) Участвовать в код-ревью Что мы хотим от успешного кандидата Практический опыт проектирования и разработки компонентов сервис-ориентированной архитектуры Прагматичный подход к разработке, самодисциплина, умение работать в команде Сильный опыт/скилл Python 3 в функциональной парадигме Понимание сложности алгоритмов и принципов написания эффективного кода, с учетом особенностей CPython Твердое знание принципов работы и особенностей протокола HTTP Уровень уверенного пользователя Linux, Git, Docker Попадание в наш стек (asyncio, Tornado, Redis, MongoDB) Английский язык на уровне чтения документации и переписки с техподдержкой иностранных партнеров Необязательно, но выделит тебя Опыт использования Kubernetes в bare-metal окружении Опыт работы с высоконагруженными проектами Опыт использования PostgreSQL", "conditions": "У нас нет сложных процессов и бюрократии, менеджеров среднего звена, жестких рабочих часов и обязательного офиса. В нашей команде люди сами определяют свою загрузку и несут ответственность за свои коммиты. Возможно поэтому средний срок работы инженеров у нас больше 5 лет;"}
{"id": "1000157486", "title": "Middle/Senior Data Analyst / F&R", "company": "Магнит", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T16:31:42+03:00", "skills": ["Анализ данных", "Python", "Аналитик по данным", "Tableau", "статистики и опыт бизнес", "PowerBI", "принципов ml и работы моделей", "BI", "Средний (Middle)", "SQL", "Математическая статистика"], "url": "https://career.habr.com/vacancies/1000157486", "requirements": "— от 3 лет в аналитике данных — уверенный SQL, Excel (сводные, функции), BI-инструменты — знание статистики и опыт бизнес-анализа — опыт наставничества Плюсом будет: — знание принципов ML и работы моделей — опыт с Python, Pyspark, Hive, Airflow, Hadoop — понимание архитектуры данных и системного анализа", "conditions": "— официальное оформление в аккредитованной IT-компании — формат работы на выбор: удалёнка, гибрид или офис (Москва/СПБ/Краснодар/Иннополис) — прозрачные процессы, минимум бюрократии — обучение за счёт компании, участие в конференциях — ДМС со стоматологией + льготы для семьи — корпоративные скидки и бонусы от партнёров"}
{"id": "1000156807", "title": "Product Analyst", "company": "Marfatech", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T16:29:13+03:00", "skills": ["Python", "sql", "Старший (Senior)", "Продуктовый аналитик", "SQL", "платежками"], "url": "https://career.habr.com/vacancies/1000156807", "requirements": "Уверенное владение SQL (Snowflake, Clickhouse, MySQL) и опытом анализа данных в Python (Jupyter Notebook); Практический опыт проведения A/B-тестов, умение статистически корректно и на понятном для менеджеров языке интерпретировать результаты; Способность находить узкие места, точки роста. А также генерировать и самостоятельно проверять гипотезы, быть проактивным и вовлеченным в развитие продукта; Понимание ключевых продуктовых метрик (конверсия, скорость обработки, retention, реферальные программа, LTV); Способность эффективно коммуницировать с разными менеджерами / аналитиками / стейкхолдерами и предлагать решения, основанные на данных и опыта. Будет плюсом: Опыт работы с платежками (финтех).", "conditions": "Удаленный формат работы или современный комфортный офис рядом со ст.м. Динамо; Трудоустройство в аккредитованной белой IT-компании (предоставление всех IT-льгот); Достойный уровень заработной платы; Демократичную среду с возможностью предлагать и реализовывать свои идеи по улучшению сервиса и функциональности; Работу над сложными сервисами со множеством инженерных вызовов; Возможность карьерного роста; Возможность профессионального развития (обучение, конференции, литература, сильная команда высокого класса с большим опытом); Открытая и свободная friendly среда - у нас ты сможешь сам задавать тренды, а не следовать им; Кухня с завтраками, разнообразием фруктов, снеков и газировки; Разнообразные корпоративные и спортивные мероприятия; 50 % корпоративная скидка на изучение английского языка."}
{"id": "1000156173", "title": "Разработчик в инфраструктуру Yandex Cloud", "company": "Яндекс", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T15:27:27+03:00", "salary_from": 300000, "salary_to": 490000, "currency": "RUB", "skills": ["Бэкенд разработчик", "Старший (Senior)", "Python", "Golang", "C++", "Алгоритмы и структуры данных"], "url": "https://career.habr.com/vacancies/1000156173", "requirements": "Мы ждем, что вы Уверенно владеете Python или Go, занимались продуктовой разработкой Готовы погрузиться в особенности доменной области Работали с контейнерами и Kubernetes", "conditions": "Удобный график работы; Красивые и технологичные офисы с зонами для работы и отдыха, спортзалами, йога-классами, массажными кабинетами и не только Расширенная медицинская страховка:"}
{"id": "1000156800", "title": "Администратор баз данных Greenplum (ArenadataDB)", "company": "Контур", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T15:09:03+03:00", "skills": ["flink", "системами мониторинга", "Администратор баз данных", "map reduce", "snowflake", "проектирования решений для бизнес", "presto", "Старший (Senior)", "tez", "типов данных и особенностей их работы", "большими данными hadoop", "Greenplum", "PostgreSQL", "автоматизации процессов", "OLAP", "Linux", "yarn7 задачи развертывать и обеспечивать стабильную работу аналитических кластеров greenplum", "Администрирование баз данных", "hdfs", "Bash", "Ansible", "Grafana", "Python", "hive", "TeamCity", "spark", "системой резервного копирования greenplum", "ос linux"], "url": "https://career.habr.com/vacancies/1000156800", "requirements": "Опыт проектирования и сопровождения отказоустойчивых кластеров на базе Greenplum/ArenadataDB от года. Навыки проектирования решений для бизнес-аналитики. Понимание основ реляционных баз данных, построения и оптимизации индексов, знание типов данных и особенностей их работы.Опыт оптимизации SQL-запросов. Опыт работы с системой резервного копирования Greenplum. Опыт работы с ОС Linux (CentOS, Ubuntu, AlmaLinux). Навыки автоматизации процессов (Ansible, скрипты на bash, Python и других языках). Опыт работы с системами мониторинга (Zabbix, Graphite и др.). Будет плюсом Опыт работы в системе контроля версий Git. Опыт работы с большими данными Hadoop, Spark, Hive, Flink, Presto, Snowflake, Map Reduce, Tez, HDFS, YARN7 Задачи Развертывать и обеспечивать стабильную работу аналитических кластеров Greenplum. Проводить анализ производительности кластеров, выявлять узкие места, оптимизировать запросы. Настраивать и поддерживать систему всестороннего мониторинга для Greenplum и компонентов технологического стека. Содействовать командам в планировании и оценке потребностей в оборудовании для поддержки кластеров баз данных. Систематизировать экспертизу по сопровождению Greenplum, обмениваться опытом внутри команды и превращать накопленные знания в сервис. Поддерживать контакт с разработчиками для обмена обратной связью и разбора проблемных ситуаций.", "conditions": "Уровень дохода , который зависит от ваших технических знаний и навыков. Раз в год мы пересматриваем зарплаты в зависимости от вашего роста в качестве инженера. Если вы прокачиваетесь быстрее, готовы обсуждать изменения грейда и дохода чаще. Гибкий рабочий график. Нам важна выполненная задача, а не работа с 9:00 до 18:00. Пространство для инжиниринга и творчества. Хотите сделать статью на Хабре — у нас есть корпоративный блог, а с текстом статьи смогут помочь наши деврелы. Хотите выступить на конференциях — поможем попасть и подготовиться. Еще сами делаем конференции и митапы: от вас инициатива и выступление, от нас — общая организация ивента и площадка. Проекты в опенсорсе у нас тоже есть. Движухи на уровне всей компании. Техническая конференция всех программистов — Конфур, летучки и обмен опытом между командами, общие праздники. Комфортный офис, удаленку или гибридный формат. Для нас не принципиально, откуда работает команда — из дома или из офиса. Но если вам по душе приходить куда-то для работы — обеспечим комфортом, зонами отдыха, кухней с полезным перекусом, библиотеками с профессиональной литературой. Мы всегда на «ты». Максимум горизонтальных связей в коллективе, чтобы быстрее договариваться и решать рабочие задачи. А еще у нас есть инженерный совет, который придумывает и реализует проекты для улучшения жизни инженеров в компании, и в него можно попасть."}
{"id": "1000156172", "title": "Разработчик в буткемп Core Infrastructure", "company": "Яндекс", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T14:55:31+03:00", "salary_from": 300000, "salary_to": 490000, "currency": "RUB", "skills": ["Бэкенд разработчик", "Старший (Senior)", "Python", "C++", "Golang", "Алгоритмы и структуры данных"], "url": "https://career.habr.com/vacancies/1000156172", "requirements": "Мы ждём, что вы уверенно пишете на С++, Go или Python; привыкли отвечать за разрабатываемые сервисы; следуете «правилу бойскаута»: оставляете после себя всё лучше, чем было; принимаете и даёте конструктивную обратную связь, хотите развиваться сами и помогать в этом коллегам; пишете надёжный, высокопроизводительный код с документацией и тестами; знаете классические алгоритмы и структуры данных; работали с SQL. Будет плюсом, если вы строили высоконагруженные системы; работали с видео, сетью или большими объёмами данных;", "conditions": "Удобный график работы; Красивые и технологичные офисы с зонами для работы и отдыха, спортзалами, йога-классами, массажными кабинетами и не только Расширенная медицинская страховка:"}
{"id": "1000147914", "title": "Python разработчик", "company": "Bell Integrator", "city": "Москва", "employment": "Санкт-Петербург", "remote": true, "published_at": "2025-05-01T13:27:37+03:00", "skills": ["инструментами командной разработки", "Python", "базовыми архитектурными паттернами", "работы с платформами контейнеризации приложений", "linux", "Бэкенд разработчик", "Старший (Senior)", "и умение работать с брокерами сообщений"], "url": "https://career.habr.com/vacancies/1000147914", "requirements": "Опыт разработки Backend приложений (Python 3.>) от 5 лет Senior Уверенное владение базовыми архитектурными паттернами; Понимание асинхронной парадигмы программирования; Желание придерживаться Best practices (KISS,DRY, etc.), использование PEP8, типизации данных; Практические навыки работы с платформами контейнеризации приложений; Навык владения любой системой оркестрации контейнеров, плюсом если это Kubernetes; Опыт построения архитектур сложных систем; Умение оценивать задачи; Опыт разработки интеграционных решений; Опыт разработки приложений с микросервисной архитектурой; Опыт работы с инструментами командной разработки: Git, Jira, Confluence; Опыт работы с Linux (Bash); Знание и умение работать с брокерами сообщений (RedHat JBOSS AMQ\\ ActiveMQ Artemis, IBM WebSphere MQ , etc). Обязанности: Участие в развитии десктопного приложения AMQPUtil; Проектирование и разработка платформы для оптимизации и ускорения написание интеграционных приложений на шине RHAMQ Framework AMQ; Написание технической документации по работе API сервисов; Разработка сервисов по согласованной архитектуре; Разработка юнит-тестов; Внедрение новых технологий, инструментов и методов разработки; Коммуникация с командой, поиск и решение проблем, участие в брейнштормах.", "conditions": "Возможность профессионального и карьерного роста в компании, возможность поучаствовать в разных проектах; Опыт работы в распределенной команде профессионалов; Уровень заработной платы обсуждается индивидуально; Возможность работать удаленно на территории РФ."}
{"id": "1000149893", "title": "Инженер технической поддержки", "company": "Eltex", "city": "Новосибирск", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T13:27:37+03:00", "skills": ["Osi model", "Linux", "Python", "основ python", "Инженер технической поддержки", "TCP", "сетевой науки"], "url": "https://career.habr.com/vacancies/1000149893", "requirements": "желание непрерывно обучаться и развиваться (у нас это происходит каждый день); опыт в работе с Linux; знание сетевой науки: коммутация, маршрутизация, TCP/IP и пр.; знание основ python (будет плюсом). Предполагаемый круг задач: техническое сопровождение крупных клиентов и заказчиков; консультировать клиентов (сетевые инженеры, системные администраторы) по конфигурированию/проблемам/пожеланиям; воспроизводить проблемы клиента в лаборатории в случае необходимости; заводить задачи/консультировать разработчиков по воспроизведенной проблеме; подготавливать инструкции по типичным кейсам.", "conditions": "Официально устраиваем своих сотрудников в первый рабочий день. Никаких зарплат в конверте. Мы предоставляем комфортное рабочее место в нашем просторном комплексе зданий в парковой зоне города в 10 минутах езды от метро «Заельцовская». Мы поддерживаем желание сотрудников учиться и профессионально расти, поэтому постоянно участвуем в профильных конференциях, тренингах и семинарах, а также проводим внутренние проекты по обмену знаниями. Количество проектов с каждым годом увеличивается, появляются новые группы разработки, от джуна до руководителя группы или направления вырасти реально, от вас - желание и компетенции. В зданиях есть благоустроенные комнаты для приема пищи, а также столовая. В свободное время ты можешь играть в настолки, рубиться в кикер или настольный теннис. Любишь спорт? У нас есть собственный тренажерный зал и корпоративные скидки на фитнес."}
{"id": "1000156784", "title": "Senior FullStack Developer", "company": "FireChat.AI", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T13:07:50+03:00", "salary_from": 300000, "salary_to": 500000, "currency": "RUB", "skills": ["Фулстек разработчик", "Старший (Senior)", "PostgreSQL", "Python", "FastAPI", "Pytest", "React", "TypeScript", "WebSockets", "Docker", "Git", "Node.js"], "url": "https://career.habr.com/vacancies/1000156784", "requirements": "The actual job Are you a self-driven Fullstack Developer with deep experience in Python and React, and a passion for building fast, responsive systems? Do you thrive in a product-focused environment where your decisions directly shape the experience of real users? If so, we invite you to join FireChat.AI and take ownership of a live platform used every day by people engaging with AI in new, personal, and playful ways. Responsibilities Innovate and Build: Implement product features across frontend and backend, including real-time interaction, character settings, and customization tools. Code Craftsmanship: Write clean, reusable, and well-tested code, balancing speed with long-term quality. Architectural Ownership: Evolve the current system to keep it robust, simple, and developer-friendly. Performance Focus: Monitor and improve responsiveness across the stack — from backend APIs to frontend rendering. Collaborative Execution: Work with product and ML engineers to ship meaningful, polished features. Codebase Health: Improve existing logic, fix bugs, and help reduce complexity where needed. Independent Decision-Making: Own your work without managerial layers — your judgment matters here. As the ideal candidate, you possess: FastAPI Confidence: You've built modern APIs in Python and know how to keep them clean, stable, and fast. React & Zustand Flow: You’re comfortable turning Figma into responsive, stateful UIs that just work. Testing Mindset: You write tests that matter — unit, integration, E2E — and use them to protect real things, not just pipelines. Architecture Instinct: You know when to simplify, when to isolate, and how to scale without overengineering. Real-Time Thinking: You're confident working with WebSocket and async flows to keep things fast and reactive. Product Eye: You think beyond the task — what the user sees, where the data flows, how it feels in motion. Problem Solving Energy: You enjoy the hard parts. You know how to move forward without perfect specs. Curious Technologist: You try new things — but don’t force them. You look for tools that serve ideas. Independent Execution: You don’t wait for permission. You lead yourself. You own the delivery. Frontend-Backend Balance: You’ve touched it all — state, queries, endpoints, sessions — and enjoy putting the pieces together. About the Tech Stack: PostgreSQL, Git, Python, FastAPI, PyTest, React, TypeScript, WebSockets, Node.js, Docker, Docker-compose", "conditions": "Why Join Us: Opportunity to take ownership of a working product with real users Autonomy to make key decisions from structure to stack Remote-first with async flexibility (PST-friendly hours preferred) Salary range: 350K–500K ₽ Small team, zero bureaucracy, direct impact on product and process Freedom to build, refactor, and improve — no ticket farming If you're ready to take your Fullstack career to the next level and shape a platform at the frontier of AI interaction, we'd love to hear from you. Apply now and let’s build FireChat together."}
{"id": "1000157240", "title": "Python Developer (MDR)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-01T13:01:19+03:00", "skills": ["Бэкенд разработчик", "Python", "kafka или elasticsearch"], "url": "https://career.habr.com/vacancies/1000157240", "requirements": "Опыт разработки на python и желание использовать Java или JavaScript в работе; Умение разбираться в чужом коде; Практика использования TDD; Практический опыт работы с Kafka или ElasticSearch; Будет большим плюсом опыт в проектировании архитектуры Big Data решений.", "conditions": "Обязанности: Создание надежных решений для кибербезопасности на базе Big Data; Участие в полном цикле разработки, включая анализ требований, разработку технической архитектуры, разработку решения, тестирование и развертывание."}
{"id": "1000118633", "title": "Сетевой инженер", "company": "Eltex", "city": "Новосибирск", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T12:59:55+03:00", "skills": ["Zabbix", "Osi model", "Linux", "Python", "Сетевой инженер", "основ сетевых технологий", "языков программирования python", "Администрирование сетей", "принципов написания скриптов для автоматизации процесса", "Администрирование Linux", "ос linux"], "url": "https://career.habr.com/vacancies/1000118633", "requirements": "Сейчас мы в поиске инженера-тестировщика Сетевого оборудования. Проект и предполагаемый круг задач: Чем предстоит заниматься: Тестирование телекоммуникационного оборудования (опытных образцов); Тестирование серверных решений; Взаимодействие с разработчиками, обсуждение функционала новых продуктов; Документирование результатов тестирования. Для нас важно: Опыт конфигурирования активного сетевого оборудования (Cisco,Mikrotik, Juniper, Eltex и др.). Будет преимуществом: Высшее образование Опыт работы с ОС Linux (администрирование серверов, настройка различных сервисов); Знание принципов написания скриптов для автоматизации процесса; Знание языков программирования Python/Perl; Знание основ сетевых технологий", "conditions": "Мы предлагаем: Неизбежное профессиональное развитие :); Стандартный график работы (5/2, с 9 до 18 часов); Молодой и дружный коллектив, команду профессионалов, у которых есть чему поучиться; Официальное трудоустройство с первого дня, никаких зарплат в конверте; Участие в профессиональных конференциях (оказываем софинансирование); Скидки от компаний-партнеров (фитнес, развлечения); Поддержка спортивного духа в компании (мы регулярно принимаем участие в командных соревнованиях , например таких, как: \"Гонка героев\", спартакиада среди организаций г. Новосибирска и др.); Тренажерный зал у нас в офисе (а также кикер и настолки); Корпоративный английский после работы (оказываем софинансирование); Большое и современное здание на собственной территории (у нас найдется парковочное место не только для авто, но и для велосипеда); Парк, уличная спортивная зона; Служебный транспорт от пл.Калинина и 4,5,6 мкр. Присылай свое резюме :)"}
{"id": "1000149891", "title": "QA Engineer (VoIP)", "company": "Eltex", "city": "Новосибирск", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T12:49:31+03:00", "skills": ["Инженер по автоматизации тестирования", "Linux", "Python", "Docker", "VoIP", "SIP", "TCP"], "url": "https://career.habr.com/vacancies/1000149891", "requirements": "Высшее техническое образование; Опыт в работе с ОС Linux; Понимание работы сетевых протоколов (коммутация, маршрутизация, TCP/IP), умение анализировать их на предмет неисправностей; Знания в области телекоммуникационного оборудования, понимание принципов построения VoIP сетей; Понимание работы протоколов TDM (DSS1, CSS7) и VoIP (SIP, H.323, Megaco). Будет преимуществом: Опыт программирования на скриптовых языках (Bash, Python).", "conditions": "Неизбежное профессиональное развитие :); Молодой и дружный коллектив, команду профессионалов, у которых есть чему поучиться; Официальное трудоустройство с первого дня, никаких зарплат в конверте; ДМС после прохождения испытательного срока; Участие в профессиональных конференциях (оказываем софинансирование); Скидки от компаний-партнеров (фитнес, развлечения); Поддержка спортивного духа в компании (мы регулярно принимаем участие в командных соревнованиях , например таких, как: \"Гонка героев\", спартакиада среди организаций г. Новосибирска и др.); Тренажерный зал у нас в офисе (а также кикер и настолки); Корпоративный английский после работы (оказываем софинансирование); Большое и современное здание на собственной территории (у нас найдется парковочное место не только для авто, но и для велосипеда); Парк, уличная спортивная зона; Служебный транспорт от пл.Калинина и 4,5,6 мкр."}
{"id": "1000149887", "title": "Middle QA Automation", "company": "Eltex", "city": "Новосибирск", "remote": false, "published_at": "2025-05-01T12:34:55+03:00", "skills": ["основ git", "Linux", "Python", "sql на уровне написания запросов", "CI/CD", "и понимание жизненного цикла программного обеспечения и процессов разработки программного обеспечения", "Docker", "bash", "Инженер по автоматизации тестирования", "Git", "Средний (Middle)", "SQL", "ос linux"], "url": "https://career.habr.com/vacancies/1000149887", "requirements": "Опыт тестирования клиент-серверных приложений с использованием API; Автоматизация тестирования с помощью pytest (самостоятельная разработка, поддержка и расширение набора автотестов); Опыт работы с ОС Linux, bash-скриптами, Ansible; Знание основ GIT, CI/CD, Docker; Знание SQL на уровне написания запросов (select, update, join); Желание развиваться в области тестирования и готовность осваивать новые технологии и инструменты. Будет плюсом Высшее техническое образование; Знание и понимание жизненного цикла программного обеспечения и процессов разработки программного обеспечения; Навык анализирования требований к продукту и определения рамок тестирования; Основы по сетям: стек TCP/IP, основные сетевые протоколы уровня L2-L4 и HTTP.", "conditions": "Неизбежное профессиональное развитие :); Стандартный график работы (5/2, с 9 до 18 часов); Молодой и дружный коллектив, команду профессионалов, у которых есть чему поучиться; Официальное трудоустройство с первого дня, никаких зарплат в конверте; ДМС после прохождения испытательного срока; Участие в профессиональных конференциях (оказываем софинансирование); Скидки от компаний-партнеров (фитнес, развлечения); Поддержка спортивного духа в компании (мы регулярно принимаем участие в командных соревнованиях , например таких, как: \"Гонка героев\", спартакиада среди организаций г. Новосибирска и др.); Тренажерный зал у нас в офисе (а также кикер и настолки); Корпоративный английский после работы (оказываем софинансирование); Большое и современное здание на собственной территории (у нас найдется парковочное место не только для авто, но и для велосипеда); Парк, уличная спортивная зона; Служебный транспорт от пл.Калинина и 4,5,6 мкр."}
{"id": "1000139573", "title": "Senior systems engineer / Старший системный инженер СХД (TATLIN.UNIFIED)", "company": "YADRO", "city": "Санкт-Петербург", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T12:27:28+03:00", "skills": ["Linux", "fio", "Python", "Системный инженер", "и опыт использования языка python", "Старший (Senior)", "Проведение исследований", "Тестирование ПО", "одного или нескольких скриптовых языков программирования", "Bash", "английского на уровне чтения и работы с технической документацией", "Администрирование Linux", "аппаратной архитектурой схд и серверов", "linux на уровне системного администратора", "Ручное тестирование"], "url": "https://career.habr.com/vacancies/1000139573", "requirements": "глубокое знание Linux на уровне системного администратора; опыт создания тестовых сценариев; понимание работы дисковой подсистемы; понимание работы компьютерных сетей и их настройки; знание одного или нескольких скриптовых языков программирования; знание английского на уровне чтения и работы с технической документацией. Будет плюсом знание и опыт использования языка Python; опыт в написании автотестов; опыт администрирования Windows; опыт работы с fio; опыт работы с аппаратной архитектурой СХД и серверов.", "conditions": "конкурентный уровень заработной платы для нас это не просто слова, а - принцип; обучение и развитие: учебный портал с курсами и лекциями от внешних и внутренних экспертов, а также дополнительное профессиональное обучение и изучение английского языка; программа поддержки инноваций: премии за научные достижения, публикацию статей, выступления на конференциях и регистрацию патентов; \"Лекторий\", в котором мы организовываем встречи с выдающимися экспертами в области технологий; забота о здоровье: ДМС с первых дней работы + стоматология, а также льготные условия страхования близких; поддержка в личных вопросах: консультации юристов, психологов, экспертов по ЗОЖ и управлению финансами; открытое общение: регулярные онлайн-встречи всей команды YADRO; программа рекомендаций: рекомендуя друзей или бывших коллег, вы получаете не только возможность работать вместе, но и денежные бонусы."}
{"id": "1000153824", "title": "Python developer", "company": "СберТех", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T12:27:28+03:00", "skills": ["Linux", "Python", "работать в командеуделяете внимание качеству кода", "Бэкенд разработчик", "его тестируемостиимеете опыт работы с публичными и приватными облаками понимаете принципы работы систем виртуализации и контейнеризациипонимаете что такое ит", "реляционными базами данных и брокерами данных умеете писать надежный код"], "url": "https://career.habr.com/vacancies/1000153824", "requirements": "Мы ждем, что Вы: знаете Python и готовы изучать другие языки программирования (Golang) имеете опыт работы с реляционными базами данных и брокерами данных умеете писать надежный код, работать в командеуделяете внимание качеству кода, его тестируемостиимеете опыт работы с публичными и приватными облаками понимаете принципы работы систем виртуализации и контейнеризациипонимаете что такое ИТ-инфраструктура. Будет плюсом: знаете языки программирования Golang или Java, SQL, bash работали с Kubernetes или Docker или хотите научиться их использовать строили и поддерживали отказоустойчивые системы.", "conditions": "проекты большого масштаба в которых есть возможность делать жизнь миллионов людей лучше сложные и интересные задачи: высоконагруженные сервисы, которые задают уровень для конкурентов качеством и технологиями оборудование: мощное железо, дополнительные мониторы ― все для решения масштабных задач и экспериментов команда: работа бок о бок со лучшими из IT-индустрии, каждый из которых может поделиться своей экспертизой профессиональное развитие: развиваем культуру профсообществ и внутри компании мы организуем meetup, встречи разработчиков и тестировщиков, семинары и тренинги, куда открыт доступ каждому сотруднику новый опыт - лучшие сотрудники выступают на ИТ-конференциях гибридный формат работы здоровье и спорт: программа ДМС для сотрудников и их родственников, собственный тренажерный зал в офисе."}
{"id": "1000157468", "title": "Senior/Middle fullstack Python/Django разработчик (почасовая)", "company": "Int Fulfillment", "employment": "Неполный рабочий день", "remote": true, "published_at": "2025-05-01T12:01:20+03:00", "salary_from": 120000, "salary_to": 160000, "currency": "RUB", "skills": ["Фулстек разработчик", "Git", "ООП", "Django", "PostgreSQL", "Linux", "JavaScript", "CSS"], "url": "https://career.habr.com/vacancies/1000157468", "requirements": "Способен поддерживать эффективное общение с заказчиком, быстро понимать бизнес процессы. Владеет Python (Django) на высоком уровне и готов разбираться с бизнес-логикой через чтение legacy кода. Имеет свои проекты в портфолио, которые может продемонстрировать: репозитории на github, скриншоты, демо-доступы. Уровень сложности выполненных проектов: панель управления (dashboard) или веб-портал.", "conditions": "Удаленная работа. Свободный график. Оплата от 2000 руб до 3000 в час. От 10 до 20 часов в неделю."}
{"id": "1000156642", "title": "QA Enginear (Тестировщик) в продуктовую IT компанию", "company": "AppEvent", "city": "Ростов-на-Дону", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T11:57:05+03:00", "salary_from": 50000, "salary_to": 80000, "currency": "RUB", "skills": ["Инженер по ручному тестированию", "Средний (Middle)", "Python", "Git", "Jira", "Confluence", "SQL", "Postman", "Jenkins"], "url": "https://career.habr.com/vacancies/1000156642", "requirements": "У тебя есть опыт от года регрессионного, функционального, нефункционального тестирования. Тестировал(а) frontend и backend. У тебя есть опыт ручного тестирования (веб и мобильные приложения iOS и Android). Понимаешь процессы тестирования и обеспечения качества продукта. Тестировал(а) с системами контроля версий (Git). У тебя есть опыт написания тестовой документации. Тестировал(а) API.", "conditions": "Белая зарплата, оформление по ТК РФ с первого дня. Наставник на весь испытательный срок. Гибкое начало рабочего дня, график 5/2, 8-часовой рабочий день. Возможность стать руководителем отдела тестирования. Возможность влиять на продукт и процессы — твое мнение имеет значение."}
{"id": "1000154991", "title": "Senior Developer BE", "company": "Евразия", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T11:32:22+03:00", "salary_from": 300000, "currency": "RUB", "skills": ["Rust", "MySQL", "Python", "Бэкенд разработчик", "Старший (Senior)", "Java", "C#", "MongoDB", "Git", "C", "английского языка от уровня b1", "Golang", "Английский язык"], "url": "https://career.habr.com/vacancies/1000154991", "requirements": "Знание английского языка от уровня B1-B2 Хорошие знания С++ стандартных алгоритмов и структур данных График 5/2, возможно обсудить частично удаленный вариант сотрудничества Высшее образование (готовы рассмотреть студентов последних курсов) Специальность по образованию - физико-математическая или техническая, в частности в области программирования Должностные обязанности: Создание корпоративных веб-приложений с использованием полного стека технологий, включая разработку на базе внутреннего сервера, разработку на основе внешнего сервера и клиента, проектирование и интеграция баз данных. Написание высококачественного программного кода, учитывая модульное тестирование для обеспечения высокого уровня качества программного обеспечения.", "conditions": "Оформление по ТК с гарантией сотрудничества на постоянной основе График 5/2 (Территориально Кутузовский Проспект), возможно рассмотреть частично удаленный вариант сотрудничества Финальный уровень ЗП обсуждается на собеседовании после личного собеседования (Junior Developer от 200000р в качестве оклада, уровень зп по другим вакансиям, которые указаны ниже, обсуждается на собеседовании) Возможность карьерного роста Возможность профессионального развития (обучение, конференции, литература, сильная команда высокого класса с большим опытом);"}
{"id": "1000154700", "title": "Руководитель отдела машинного обучения (Data Platform и ML )", "company": "БЮРО 1440", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T11:30:16+03:00", "skills": ["Ведущий (Lead)", "стандартных структур данных", "Python", "airflow", "Docker", "ML разработчик", "dvc или аналогами опыт разработки сервисов на основе моделей", "Машинное обучение", "git и docker", "Git", "ооп", "mlflow", "SQL", "Deep Learning"], "url": "https://career.habr.com/vacancies/1000154700", "requirements": "Чем предстоит заниматься: Разработкой ML продуктов от идеи до внедрения в prod (не только ML модели, но и скрипты и сервисы на их основе); Применением как классических моделей, так и применением новых подходов - LLM, RL, цифровые двойники; Управлением командой и ML проектами. Что мы ожидаем: Опыт разработки на Python от 3 лет. Знание стандартных структур данных, ООП, ML-ориентированный Python и библиотеки (pandas, sklearn, PyTorch и т.п.) Classic ML, Forecasting, Anomaly Detection. Deep Learning, Transformers (BERT-like, GPT-like и др). Продвинутый уровень владения SQL, умение писать оптимальные запросы, уверенное владение Git и Docker. Понимание MLOps практик - ci/cd-пайплайны, построение систем мониторинга качества моделей, опыт работы с Airflow , MLFlow, DVC или аналогами Опыт разработки сервисов на основе моделей.", "conditions": "Мы предлагаем: Работу в аккредитованной ИТ-компании; Шаг в космос - для тех, кто вдохновлен идеей покорения космоса и мечтает быть к этому причастным; Комфортный современный офис рядом с метро \"улица 1905 года\"; Гибридный формат работы; Оформление в соответствии с ТК РФ."}
{"id": "1000144802", "title": "Fullstack QA", "company": "ЦПФТ", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T11:27:52+03:00", "skills": ["Инженер по обеспечению качества", "Старший (Senior)", "Python", "JavaScript", "Ruby", "Linux", "Git", "SQL", "CI/CD"], "url": "https://career.habr.com/vacancies/1000144802", "requirements": "Что нужно будет делать: Тестировать новые изменения (начиная от этапа постановки требований); иногда разбираться в том как работает старое (система очень большая); проводить регресс (лучше автоматизировано); писать автотесты (мы используем python); отвечать за релизы со стороны тестирования. Мы ждём от Вас: Уже какое-то время работаете тестировщиком и умеете писать тесты; знаете хотя бы один язык программирования (а лучше несколько); знаете и используете техники тест-дизайна при подготовке тестового набора; знакомы с CI и понимаете зачем это нужно; умеете работать с git; умеете работать в *nix; умеете тестировать через api (у нас собственный бинарный протокол). Идеально если Вы: Уже написали хоть один \"тестовый фреймворк\"; умеете (и хотите) делать грамотный code review; владеете SQL на среднем уровне; знаете предметную область.", "conditions": "трудоустройство в соответствии с ТК РФ; график работы: 5/2, с 9:30 до 18:00, обед 30 мин; место работы: м. Выставочная либо дистанционно . дополнительные дни к основному оплачиваемому отпуску; доплата по больничному листу; ДМС, включая стоматологию (после испытательного срока);"}
{"id": "1000156355", "title": "Архитектор платформенных продуктов (Platform V DevOps tools)", "company": "СберТех", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-01T11:27:01+03:00", "skills": ["разработки", "Ведущий (Lead)", "Kubernetes", "Python", "PostgreSQL", "Архитектор программного обеспечения", "Apache Kafka", "сопровождения программного обеспечения", "инструментов контейнеризации опыт успешного взаимодействия с внутренними и внешними клиентами", "Docker", "используемых инструментов опыт работы разработчиком на любом из языков программирования широкого назначения", "Java", "методологий проектирования", "Git", "развертывания", "Golang"], "url": "https://career.habr.com/vacancies/1000156355", "requirements": "опыт в роли Архитектора от 3х лет в производстве программных продуктов в коммерческой структуре понимание принципов построения архитектуры высокодоступных и высоконагруженных приложений знание методологий проектирования, разработки, развертывания, сопровождения программного обеспечения, используемых инструментов опыт работы разработчиком на любом из языков программирования широкого назначения (Java, .NET, C++, Go, Perl, Python, Node.js, другие) или SRE/DevOps инженером в крупных проектах опыт вывода продуктов в промышленную среду, знание инструментов контейнеризации опыт успешного взаимодействия с внутренними и внешними клиентами.", "conditions": "годовой бонус и ежегодный пересмотр зарплаты статус аккредитованной ИТ-компании со всеми преимуществами расширенный ДМС с первого дня и льготное страхование для семьи корпоративный университет Сбера, внутренняя образовательная платформа, участие в IT-конференциях комфортный офис с видом на набережную, зонами отдыха и спортзалом 90 дней удаленной работы из любого региона ипотека выгоднее до 7% для каждого сотрудника бесплатная подписка СберПрайм+, скидки на продукты компаний-партнеров вознаграждение за рекомендацию друзей в команду СберТеха."}
{"id": "1000156759", "title": "Data Analyst", "company": "Золотое Яблоко", "city": "Екатеринбург", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T11:17:46+03:00", "skills": ["Qlik Sense", "Pandas", "ClickHouse", "PostgreSQL", "Python", "Аналитик по данным", "Tableau", "NumPy", "PowerBI", "Git", "SQL", "работы с sql"], "url": "https://career.habr.com/vacancies/1000156759", "requirements": "Опыт коммерческой аналитики в ритейле от 2 лет Понимание финансовых показателей, метрик оценки эффективности продаж Отличные навыки работы с SQL - аналитические функции, подзапросы, оптимизация запросов (используем Clickhouse, PostgreSql) Опыт использования следующих инструментов: Excel (PowerPivot-DAX, PowerQuery), Python, SQL hard, визуализация BI, аналитическая записка, Git, Airflow/Prefect, фреймворк Streamlit, A/B-тестирование Умение строить модели эластичности спроса от цены, спроса от скидки, от прайс индекса", "conditions": "Персональное предложение по заработной плате и официальное трудоустройство, мы за прозрачность и честность График работы: 5/2, 8-часовой рабочий день. С возможностью работать в гибридном формате работы (офис/дом) У нас активная корпоративная жизнь, а ещё скидки и бонусы от партнеров Мы предлагаем помощь карьерного консультанта для выбора индивидуального направления развития ДМС со стоматологией, потому что мы заботимся о твоем здоровье Штаб-квартира в центре Екатеринбурга с собственным баром, зонами для отдыха, амфитеатром и садом из финиковых пальм, папоротников и гигантских фикусов Открытый диалог с топ-менеджерами и дружный коллектив — база нашей культуры Компенсация обучений и участие в конференциях, чтобы ты рос вместе с компанией Никаких ограничений по дресс-коду и внешнему виду. Мы уважаем твою индивидуальность Делай то, что любишь вместе с нами!"}
{"id": "1000157416", "title": "DevOps-инженер", "company": "Deeray", "city": "Нижний Новгород", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T11:16:06+03:00", "salary_from": 100000, "currency": "RUB", "skills": ["DevOps-инженер", "Младший (Junior)", "Linux", "CI/CD", "RabbitMQ", "ClickHouse", "Grafana", "Kubernetes", "Python", "PostgreSQL"], "url": "https://career.habr.com/vacancies/1000157416", "requirements": "Опыт работы системным администратором Linux от 2 года Базовые знания bash, понимание сетевых основ, прав доступа, системных журналов Понимание основ и принципов CI/CD и IaC, контейнеризации Умение читать техническую документацию, самостоятельность в поиске решений Готовность к обучению и желание развиваться в направлении DevOps и автоматизации Внимательность, аккуратность, ответственность", "conditions": "Полное соответствие Трудовому Кодексу РФ с регулярными выплатами зарплаты два раза в месяц; Стабильность и надежность , подтвержденные статусом аккредитованной ИТ-компании; Профессиональная культура , основанная на принципах открытости, наставничества и командной поддержки; Технические вызовы в проектах с использованием AI и Big Data, предоставляющие возможность решать сложные задачи; Влияние на продукт , прямое участие в разработке и улучшении наших решений; Карьерные перспективы , возможность роста внутри компании; Современное техническое оснащение , создающее комфортные условия для работы и инноваций; Комфортный офис в престижном районе Нижнего Новгорода, со своей парковкой."}
{"id": "1000157462", "title": "SDET Python (KATA/NTA)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-05-01T11:01:30+03:00", "skills": ["Автоматизация тестирования", "postgresql", "playwright", "doсker", "Инженер по автоматизации тестирования", "git", "теории тестирования", "систематизации и выявления корневой причины дефектов", "стандартных библиотек"], "url": "https://career.habr.com/vacancies/1000157462", "requirements": "Опыт разработки/отладки программ на Python с использованием ООП, знание стандартных библиотек; Опыт разработки в PyTest; Опыт работы с Playwright; Знание теории тестирования; Базовые знания сетей, сетевых протоколов, маршрутизации (стек TCP/IP); Базовые знания архитектуры ОС Linux (у нас Ubuntu и Astra); Навыки систематизации и выявления корневой причины дефектов; пыт самостоятельного и командного планирования, детализации задач. Желательно: Опыт тестирования web-сервисов; Опыт работы с PostgreSQL; Опыт работы с Git; Базовые знания SQL; Опыт работы с Doсker; Опыт установки, настройки и администрирования Linux и сети.", "conditions": "Для чего Вы нам нужны: Написание и поддержка фреймворка автоматизированных тестов на Python (PyTest) Обеспечение тестовой части CI/CD Проведение функционального и интеграционного тестирования Проектирование тестовых сред и инфраструктуры тестирования (как физических, так и виртуальных) Работа с требованиями, тест дизайн и оформление тест кейсов, тест планов Запуск автоматизированных тестов, анализ результатов, регистрация обнаруженных дефектов"}
{"id": "1000147899", "title": "Cloud Security Engineer", "company": "Wanted.", "city": "Берлин", "employment": "Амстердам", "remote": true, "published_at": "2025-05-01T10:40:30+03:00", "salary_to": 9000, "currency": "EUR", "skills": ["Kubernetes", "Python", "практиками обеспечения безопасности сетей", "узлов и приложений", "Инженер по безопасности", "общения на английском языке", "Средний (Middle)", "SSDL", "Golang"], "url": "https://career.habr.com/vacancies/1000147899", "requirements": "3+ года опыта работы в сфере безопасности; 1+ лет опыта работы с крупными или частными облачными провайдерами; Опыт работы с практиками обеспечения безопасности сетей, узлов и приложений; Уверенные общие знания в области распределенных систем и системной инженерии Linux; Понимание современных компонентов облачных технологий и моделей развертывания: виртуальные машины, контейнеры, Kubernetes, бессерверные технологии, инфраструктура как код и т. д; Хорошие письменные и устные навыки общения на английском языке. В этой должности в ваши обязанности будет входить: Обнаружение, устранение и подтверждение проблем безопасности в облачной инфраструктуре в соответствии с политиками информационной безопасности, принятыми в отрасли; Сотрудничество с коллегами-инженерами для разработки эффективных решений, отвечающих нашим конкретным потребностям; Разработка, внедрение, эксплуатирование и поддержание систем, повышающих безопасность компании; Выступление в качестве эксперта по вопросам безопасности для других команд; Сопровождение сессий по моделированию угроз.", "conditions": "Удаленный формат работы (EU); ЗП: от 70.000 до 110.000 евро в год гросс; График 5/2; Гибкое начало рабочего дня; Ревью 4 раза в год."}
{"id": "1000153161", "title": "Team Lead AppSec", "company": "GlobalCareer", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-05-01T10:27:44+03:00", "skills": ["Ведущий (Lead)", "Agile", "AppSec-инженер", "Python", "CI/CD", "python будет плюсом", "C#", "Java", "SAST/DAST", "инструментами для статического и динамического анализа безопасности", "одного из языков программирования", "SQL"], "url": "https://career.habr.com/vacancies/1000153161", "requirements": "От 5 лет опыта в области информационной безопасности или разработки безопасных приложений. Опыт выстраивания с 0 SSDLC в продуктах периметра, используя утвержденный инструментарий. Понимание современных процессов разработки ПО, таких как Agile, CI/CD, SSDLC (Secure Software Development Life Cycle) и DevOps. Знания в области анализа защищенности веб-приложений, а также умение выявлять уязвимости и разрабатывать меры защиты. Знание одного из языков программирования (C# или Java) для автоматизации задач безопасности (знание Python будет плюсом). Опыт работы с инструментами для статического и динамического анализа безопасности (SAST/DAST) и понимание архитектуры современных приложений. Наличие профильных сертификатов (например, OSCP, OSWE) может быть плюсом. Опыт формирования команды и умение консультировать разработчиков по вопросам безопасности. Способность составлять отчеты о найденных уязвимостях и участвовать в программах Bug Bounty. Высшее образование в области информационных технологий или смежных областях может быть предпочтительным.", "conditions": "Удаленный формат работы с территории РФ. В пакет компенсации входит ДМС с первого дня, страхование от несчастных случаев и болезней. В компании действует корпоративная пенсионная программа."}
{"id": "1000156150", "title": "Бэкенд разработчик Senior", "company": "GlobalCareer", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-05-01T10:27:43+03:00", "skills": ["Python", "классических алгоритмов и структур данных", "одним из языков", "Бэкенд разработчик", "Старший (Senior)", "C++", "Java", "мониторинга и оперативного реагирования", "Golang"], "url": "https://career.habr.com/vacancies/1000156150", "requirements": "Уверенное владение одним из языков: Java, Python, Go или C++ . Опыт разработки коммерческих приложений не менее 5 лет: вы уверенно чувствуете себя в мире коммерческой разработки и знаете, как создавать успешные продукты. Полный цикл поддержки ПО: от написания кода до его выкладки в производство, включая качественное тестирование и мониторинг. Тестирование кода: вы пишете надежный и проверенный код, минимизируя ошибки на производстве. Навыки мониторинга и оперативного реагирования: вы умеете отслеживать работу ПО и быстро решать возникающие проблемы. Опыт многопоточного программирования: вы знаете, как работать с многопоточностью и эффективно использовать её в своих проектах.- Знание классических алгоритмов и структур данных.- Широкий технический кругозор: вы всегда в курсе современных технологий и готовы применять их в работе. Будет плюсом, если вы: Проектировали архитектуру и разрабатывали продуктовые фичи. Занимались разработкой для Unix/Linux и сетевым программированием. Понимаете основы TCP/IP и HTTP. Понимаете принципы работы СУБД.", "conditions": "Интересные задачи и вызовы: работа в ведущей технологической компании с множеством амбициозных проектов. Отличная команда: вы станете частью профессионального коллектива, готового делиться опытом и помогать вам расти. А также: Программа релокации для иногородних сотрудников. Высокий совокупный доход и премии каждые полгода для всех, кто успешно прошёл ревью. Расширенная программа ДМС: стоматология, обследования, вызов врача на дом и многое другое. Оплата 80% стоимости ДМС для супругов и детей. Питание за счёт компании. Скидки в бассейнах, фитнес-центрах и магазинах. Курсы, тренинги, участие в конференциях. Гибкий график работы.- Закрытые мероприятия: вечеринки, фестивали, клубы по интересам, Random Coffee, сервисы для знакомств и взаимопомощи. На портале скидок масса специальных предложений для сотрудников от наших партнёров. Парковка"}
{"id": "1000152129", "title": "QA инженер (IoT)", "company": "Eltex", "city": "Новосибирск", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-05-01T09:38:41+03:00", "skills": ["инструментами контроля версий", "Docker", "Postman", "http", "работы с микросервисной архитектуры и высоконагруженными системами", "sql", "Git", "ос linux на уровне администратора", "Linux", "swagger", "основ виртуализации", "Инженер по ручному тестированию", "websocket", "понимание git flow", "SQL", "psql для терминальной работы с postgresql чем предстоит заниматься", "docker", "Python", "HTTP"], "url": "https://career.habr.com/vacancies/1000152129", "requirements": "Понимание работы сетевых протоколов, умение анализировать на предмет неисправностей; Опыт работы с WebSocket, Swagger, HTTP/HTTPS и JSON; Умение применять методы тестирования REST API, в т.ч. используя Postman; Владение инструментами контроля версий, понимание Git flow; Владение ОС Linux на уровне администратора; Понимание построения клиент-серверных решений; Знание основ виртуализации, Docker; Навыки работы с микросервисной архитектуры и высоконагруженными системами; Понимание принципа работы СУБД и знание SQL, psql для терминальной работы с PostgreSQL Чем предстоит заниматься: Ручное тестирование десктопного и вэб-приложения и его отдельных сервисов; Написание автоматических тестов (Jest,PasctumJS, PyTest,Bash); Создание тестовых сценариев и методик, ведение документации (Confluence); Анализировать логи, в т.ч. используя скрипты и регулярные выражения; Мониторинг высоконагруженных серверов; Тестирование сервисных функций контроллеров, их взаимодействие с СКУД; Участвовать в планировании и обсуждении различных этапов версии продукта; Взаимодействие со смежными службами и отделами, занятыми в проекте; Анализ и локализация найденных дефектов, регистрация в системе багтрекинга (Redmine), контроль устранения.", "conditions": "Неизбежное профессиональное развитие; Молодой и дружный коллектив, команду профессионалов, у которых есть чему поучиться; Официальное трудоустройство с первого дня, никаких зарплат в конверте; ДМС после прохождения испытательного срока; Участие в профессиональных конференциях (оказываем софинансирование); Скидки от компаний-партнеров (фитнес, развлечения); Поддержка спортивного духа в компании (мы регулярно принимаем участие в командных соревнованиях , например таких, как: \"Гонка героев\", спартакиада среди организаций г. Новосибирска и др.); Тренажерный зал у нас в офисе (а также кикер и настолки); Корпоративный английский после работы (оказываем софинансирование); Большое и современное здание на собственной территории (у нас найдется парковочное место не только для авто, но и для велосипеда); Парк, уличная спортивная зона; Служебный транспорт от пл.Калинина и 4,5,6 мкр"}
{"id": "1000157633", "title": "SDET Python (KICS for Networks)", "company": "Лаборатория Касперского", "city": "Москва", "remote": false, "published_at": "2025-04-30T21:00:52+03:00", "skills": ["Бэкенд разработчик", "Автоматизация тестирования"], "url": "https://career.habr.com/vacancies/1000157633", "conditions": "Kaspersky Industrial CyberSecurity for Networks (KICS for Networks) - передовое решение в области ИБ для построения комплексной защиты промышленной инфраструктуры предприятий. Что такое промышленная инфраструктура: Это компьютерная сеть, обеспечивающая бесперебойную работу предприятия согласно требованиям конкретного технологического процесса. Например, автоматический конвейер по производству автомобилей, глазированных сырков, электроэнергии на атомных электростанциях. Такая сеть состоит из контроллеров – устройств, отвечающих например за наносимую толщину краски на корпус автомобиля, или поддерживающие давление в ядерном реакторе, скорости вращения турбин на производстве. Наше решение: Анализирует более 50 промышленных протоколов на прикладном уровне Обеспечивает полную видимость происходящего на всех уровнях технологического процесса Выявляет аномалии и вторжения в АСУ ТП на ранних этапах Обеспечивает необходимые контрмеры для предотвращения ущерба технологическим процессам. Предоставляет возможности по обнаружению, расследованию и реагированию на киберинциденты в рамках всей промышленной инфраструктуры. Интегрируется с другими решениями Лаборатории Касперского для комплексных мер защиты всего предприятия Основные задачи: Тестирование ПО (функциональное, интеграционное); Документирование результатов тестирования: занесение дефектов в багтрекинговую систему, составление отчетов о тестировании; Ревью и анализ требований, тест-дизайн и создание тестовых сценариев; Автоматизация тестовых сценариев на python + pytest; Настройка и поддержка тестового окружения. Технологии: Python (PyTest); Linux (bash); TCP/IP (wireshark, tcpdump); SQL (PostgreSQL); Selenium Webdriver; GIT; VMware (vSphere Virtual Machines). Уровень погружения в эти технологии может быть разным, но желание узнать больше должно быть неизменно высоким"}
{"id": "1000153847", "title": "Senior QA Python Automation Engineer", "company": "Marfatech", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-04-30T20:49:25+03:00", "skills": ["Автоматизация тестирования", "php", "Ведущий (Lead)", "docker", "Python", "linux", "Инженер по автоматизации тестирования", "ansible", "одного из языков программирования", "k8s"], "url": "https://career.habr.com/vacancies/1000153847", "requirements": "Чем у нас предстоит заниматься: Разработка автоматизированных тестов для веб-сервиса (функциональные тесты api/ui, визуальное тестирование, нагрузочное тестирование); Поддержка автотестов (6000+ api, 600+ ui); Разработка пайплайнов для CI (Jenkins, Gitlab CI); Участие в проектировании инфраструктуры; Сопровождение релизов в качестве QA. Ключевые навыки: Опыт разработки автотестов для UI (python, pytest, selenium); Опыт разработки автотестов для API (python, pytest, requests); Опыт администрирования bare metal Linux; Опыт работы с docker. Что мы ждем от кандидата: Уверенное знание одного из языков программирования (python, javascript, php, java); Уверенное владение Linux; Знание docker (или любой другой системы контейнеризации). Большим плюсом будет: Знание php; Знание k8s; Знание ansible; Опыт разворачивания браузерных ферм; Опыт администрирования тестовых сред (docker-compose, k8s) и баз данных (mysql, redis, clickhouse).", "conditions": "Ты сможешь работать удалённо из любой точки мира. А если тебе захочется познакомиться лично, то двери нашего офиса в Москве всегда открыты:); Достойный уровень заработной платы; Сильную техническую команду, которая всегда готова делиться опытом, у нас работают лучшие технические эксперты; Сложные, интересные задачи и использование новых технологий; Гарантируем полное отсутствие бюрократии и технологическую свободу; Возможность карьерного роста и профессионального развития; Открытая и свободная friendly среда - у нас ты сможешь сам задавать тренды, а не следовать им; 50% компенсация оплаты изучения английского языка; Компенсация занятий спортом; 10 бесплатных сессий и 50% компенсация оплаты консультаций психолога; График работы: пять дней в неделю (гибкое начало дня)."}
{"id": "1000154638", "title": "Ведущий инженер данных (Data Platform и ML)", "company": "БЮРО 1440", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-04-30T19:04:59+03:00", "skills": ["Ведущий (Lead)", "airflow", "DWH", "kafka", "grafana", "ETL", "Инженер по данным", "sql", "postgresql", "Apache Spark", "Apache Airflow", "SQL", "Grafana", "Python", "ClickHouse", "Apache Kafka", "clickhouse", "spark", "базами данных в качестве разработчика от 3"], "url": "https://career.habr.com/vacancies/1000154638", "requirements": "Опыт работы с базами данных в качестве разработчика от 3-х лет; Знание Spark - будет плюсом; Свободное владение SQL; Опыт работы с PostgreSQL, ClickHouse, Kafka, AirFlow, Grafana; Понимание теории СУБД и ETL-процессов. Чем предстоит заниматься: Разработкой архитектуры источников данных и интеграций; Участием в процессе формирования моделей данных и дата-контрактов; Взаимодействием с заказчиками и разработчиками; Участием в проектах по развитию DWH; Разработкой скриптов на SQL и Python.", "conditions": "Работа в аккредитованной ИТ-компании; Шаг в космос - для тех, кто вдохновлен идеей покорения космоса и мечтает быть к этому причастным; Возможность выбора формата работы (гибрид/удаленка); Комфортный современный лофт-офис в 10 минутах от метро \"Улица 1905 года\"; Оформление в соответствии с ТК РФ; Конкурентный уровень заработной платы - на уровне лидеров ИТ/телеком-индустрии."}
{"id": "1000156726", "title": "SDET Python (Content Filtering Research)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-04-30T19:00:59+03:00", "skills": ["основ docker", "Автоматизация тестирования", "os linux от 3х лет", "Инженер по автоматизации тестирования"], "url": "https://career.habr.com/vacancies/1000156726", "requirements": "Опыт автоматизации тестирования или разработки на Python от 3х лет; Опыт автоматизации тестирования при помощи PyTest; Опыт работы с OS Linux от 3х лет; Знание основ Docker (docker-compose).", "conditions": "Чем предстоит заниматься: Написание и поддержка автоматизированных тестов на Python; Запуск автоматизированных тестов, анализ результатов, регистрация обнаруженных дефектов; Автоматизация тестирования backend и frontend; Автоматизация нагрузочного тестирования на проекте с нуля, возможность предложить свои идеи по стеку и процессу внедрения; Реализовывать улучшения по текущему пуллу написанных автотестов."}
{"id": "1000157460", "title": "Ведущий инженер по автотестированию/Senior QA Automation (AIC)", "company": "Группа Астра", "city": "Москва", "employment": "Полный рабочий день", "remote": false, "published_at": "2025-04-30T18:53:55+03:00", "skills": ["Linux", "одним из средств управления на базе openstack или opennebula или ovirt", "Python", "системами контейнеризации", "Инженер по автоматизации тестирования", "фреймворками и инструментами автоматизации тестирования", "инструментами автоматизации развертывания ci", "написания shell", "системами контроля версий", "GNU"], "url": "https://career.habr.com/vacancies/1000157460", "requirements": "Обязанности: Оказание методической поддержки по функционированию и системам тестирования. Разработка процессов автоматизированного тестирования, написания тестовых сценариев. Контролировать и обслуживать функционирующие средства автоматизации тестирования. Функциональное, регрессионное и интеграционное тестирование функционала ПО. Анализ, локализация и документирование обнаруженных дефектов в баг-трекере, последующий контроль их исправления. Разработка тестовой документации и поддержание её в актуальном состоянии. Анализ результатов тестирования, подготовка отчетов о качестве тестируемого ПО. Управление командой тестирования. Требования: Понимание жизненного цикла разработки ПО. Опыт автоматизации тестирования от 3х лет на Python. Опыт использования GNU/Linux на уровне продвинутого пользователя/администратора. Опыт работы с фреймворками и инструментами автоматизации тестирования (например: Selenuim, unittest, pytest, allure, pexpect, requests). Опыт работы с одним из средств управления на базе OpenStack или OpenNebula или oVirt. Умение работать с инструментами тестирования REST API (Swagger, Postman). Навыки написания Shell-скриптов автоматизации на bash и/или powershell. Опыт работы с системами контроля версий (GitHub, GitLab, Bitbucket или аналоги). Будет преимуществом: Опыт работы с инструментами автоматизации развертывания CI/CD (GitLab, Ansible, Terraform, GitFlic). Опыт работы с системами контейнеризации. Умение управлять гипервизорами на базе KVM, QEMU, VMware, Hyper-V, Zen. Опыт командной разработки.", "conditions": "Условия: Уверенность в будущем. Мы чтим ТК РФ: у нас стабильный и прозрачный \"белый\" доход. Забота о здоровье . Оформим полис ДМС со стоматологией. Спорт — это про нас . У нас многие увлекаются сноубордом, лыжами, дайвингом, бегом и пр. – найти кого-то для afterwork-активности не проблема. Мы спонсируем тренировки футбольной и волейбольной команд, поддерживаем инициативы по киберспорту и приходим на турниры по настольному футболу просто поболеть. Конкурентная заработная плата. Удаленка или офис? Тебе решать . Можно работать где угодно: дома, в офисе или в гибридном режиме. Нам важны результаты, а не то, где ты находишься."}
{"id": "1000152876", "title": "Middle/Senior Продуктовый аналитик в Финтех", "company": "Яндекс", "city": "Москва", "employment": "Санкт-Петербург", "remote": false, "published_at": "2025-04-30T18:27:02+03:00", "salary_from": 150000, "currency": "RUB", "skills": ["Продуктовый аналитик", "Средний (Middle)", "SQL", "Python"], "url": "https://career.habr.com/vacancies/1000152876", "requirements": "Хорошо знаете математику и владеете основами статистики; Умеете писать аналитический код на SQL и Python; Понимаете теорию А/B-тестирования; Занимаете проактивную позицию; Умеете аргументированно и доступно отстаивать собственную точку зрения и слышать чужие; Способны видеть за числами физический смысл и находить причины явлений; Критически смотрите на полученные результаты.", "conditions": "Гибридный формат работы в Москве или Санкт-Петербурге."}
{"id": "1000157453", "title": "DevOps-инженер (Направление Автоматизации)", "company": "БЮРО 1440", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-04-30T18:15:08+03:00", "skills": ["контейнерной инфраструктурой и инструментами оркестрации", "gitlab ci", "администрирования баз данных", "Kubernetes", "работы с различными дистрибутивами linux", "PostgreSQL", "CI/CD", "работы с ansible", "DevOps-инженер", "Prometheus", "работы с s3", "Linux", "Bash", "настройки веб", "Python", "и понимание принципов работы основных сетевых протоколов", "английским языком для поиска и чтения документации", "helm", "Младший (Junior)"], "url": "https://career.habr.com/vacancies/1000157453", "requirements": "Опыт работы в сфере системного администрирования/DevOps; Навыки работы с различными дистрибутивами Linux (Flatcar/Talos) и Windows (Server); Опыт работы с контейнерной инфраструктурой и инструментами оркестрации (Kubernetes/Docker-compose); Навыки работы с Ansible; Знание и понимание принципов работы основных сетевых протоколов; Опыт работы с GitLab CI/Jenkins; Опыт написания скриптов для автоматизации решений (Bash, Python, Go); Владение английским языком для поиска и чтения документации; Опыт работы с Helm/Kustomize. Будет плюсом: Навыки администрирования баз данных (Postgresql, Cassandra, Clickhouse); Опыт работы по настройке observability-стека на основе Prometheus, Opensearch, Victoria Metrics, OpenTelemetry; Навыки настройки веб/прокси-серверов (Nginx/HAProxy/Traefik/Caddy); Навыки работы с S3-совместимыми хранилищами.", "conditions": "Работа в аккредитованной ИТ-компании; Шаг в космос - для тех, кто вдохновлен идеей покорения космоса и мечтает быть к этому причастным; Возможность выбора формата работы (офис/гибрид/удаленка); Комфортный современный офис в 5 минутах от метро \"Улица 1905 года\"; Оформление в соответствии с ТК РФ; Конкурентный уровень заработной платы - на уровне лидеров ИТ/телеком-индустрии."}
{"id": "1000156338", "title": "Ведущий Архитектор ИТ-инфраструктуры на базе Linux (ALD Pro)", "company": "Группа Астра", "city": "Москва", "employment": "Можно удаленно", "remote": true, "published_at": "2025-04-30T18:10:16+03:00", "skills": ["теоретических основ построения распределенных высоконагруженных отказоустойчивых систем и опыт разработки таких решений", "Ведущий (Lead)", "Linux", "Python", "Архитектор программного обеспечения", "Puppet", "диагностики и устранения проблем в работе сложных информационных систем с использованием анализаторов трафика и системных утилит типа strace", "системами управления конфигурациями", "C++", "программирования на одном из языков высокого уровня", "Java", "Bash", "Ansible", "C"], "url": "https://career.habr.com/vacancies/1000156338", "requirements": "Обязанности: Поиск и обучение сотрудников, формирование команды экспертов. Распределение тем исследований между архитекторами согласно годовому плану. Ежедневная поддержка исследовательской деятельности, помощь архитекторам в преодолении барьеров. Проверка и техническое рецензирование результатов исследований архитекторов. Составление технических заданий для разработчиков для устранения ошибок и расширения функциональности продукта. Постановка задач на доработку документации техническими писателями. Основные направления исследований: Поиск лучших практик решения актуальных задач с использованием компонентов технологического стека. Исследование возможностей вертикального и горизонтального масштабирования для повышения производительности и достижения необходимого уровня отказоустойчивости. Разработка и описание способов гибридного развертывания Linux домена в Windows среде для организации непрерывной миграции пользователей и информационных систем. Интеграция службы каталога с продуктами компании и приложениями сторонних разработчиков. Разработка вспомогательных скриптов и приложений, необходимых для реализации проектов импортозамещения. Будет плюсом, если вы сможете в дальнейшем взять какие-то из следующих обязанностей: Участие в проектах внедрения в роли эксперта для решения сложных задач. Лидерство в создании и развитии отдельных функций продукта. Подготовка материалов для статей профессионального сообщества . Требования: Высшее техническое образование. Экспертные знания компьютерных сетей на уровне CCNP. Экспертные знания операционной системы Linux на уровне LPIC-3. Уверенные навыки программирования на одном из языков высокого уровня (C, C++, C#, Java и др.), опыт работы разработчиком в крупных проектах. Опыт написания скриптов автоматизации на bash, Python, PowerShell. Опыт работы с системами управления конфигурациями (Ansible, Puppet, Salt) и написания плейбуков к ним. Знание теоретических основ построения распределенных высоконагруженных отказоустойчивых систем и опыт разработки таких решений. Преимуществом будет: Опыт администрирования сетевых служб Windows Server и продуктов из технологического стека. Продвинутые навыки диагностики и устранения проблем в работе сложных информационных систем с использованием анализаторов трафика и системных утилит типа strace. Английский на уровне Upper Intermediate и выше, требуется поддерживать коммуникации с зарубежными мейнтейнерами и свободно работать с документацией на языке оригинала.", "conditions": "Уверенность в будущем. Мы чтим ТК РФ: у нас стабильный и прозрачный «белый» доход и полноценный соцпакет. Забота о здоровье . Оформим полис ДМС со стоматологией. Спорт — это про нас . У нас многие увлекаются сноубордом, лыжами, дайвингом, бегом и пр. – найти кого-то для afterwork-активностей не проблема. Мы спонсируем тренировки футбольной и волейбольной команд, поддерживаем инициативы по киберспорту и приходим на турниры по настольному футболу просто поболеть. Конкурентная заработная плата. Добираться легко. Офис в 3 минутах ходьбы от станции метро Бутырская."}
{"id": "1000156710", "title": "Lead SDET Python (KICS for Networks)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-04-30T18:01:10+03:00", "skills": ["Автоматизация тестирования", "теории и методологий тестирования по", "jenkins", "программами для захвата", "os linux на уровне администрирования", "rest api", "мониторинга и анализа сетевого трафика", "системами виртуализации", "Инженер по автоматизации тестирования", "http"], "url": "https://career.habr.com/vacancies/1000156710", "requirements": "Требования: Опыт автоматизированного тестирования от 3-5-ти лет; Знание теории и методологий тестирования ПО; Отличный уровень Python, PyTest, Selenium; Опыт написания сложного, эффективного и поддерживаемого кода; Опыт ревью кода и внедрения лучших практик программирования в команде; Опыт руководства командой или наставничества; Понимание CI/CD процессов, опыт работы с Jenkins/GitLab/Azure DevOps и с системами контроля версий; Знание OS Linux на уровне администрирования; Уверенные знания сетевых технологий (сетей, протоколов); Опыт работы с программами для захвата, мониторинга и анализа сетевого трафика (Wireshark, tcpdump); Опыт работы с системами виртуализации (VMware); Опыт работы с REST API, HTTP/HTTPS, JSON (Postman); Базовые знания языка запросов SQL (PostgreSQL).", "conditions": "Обязанности: Руководство командой SDET (3-4 человека): распределение задач, развитие специалистов, наставничество; Глубокое погружение в архитектуру и технологии продукта для качественного планирования тестирования, постановки задач и выпусков релизов в срок; Разработка, поддержка и улучшение автотестов на Python (PyTest, Selenium); Ревью кода команды, обеспечение его качества и соответствия лучшим практикам; Оптимизация процессов CI/CD для тестирования продукта; Взаимодействие с аналитиками, разработчиками, DevOps и архитекторами; Ревью и анализ требований, тест-дизайн, создание тестовых сценариев и планов тестирования; Анализ покрытия тестами и улучшение тестовой стратегии; Подготовка тестовых стендов для проведения различных видов тестирования; Документирование результатов тестирования: занесение дефектов в багтрекинговую систему, составление отчетов о тестировании."}
{"id": "1000156674", "title": "Python Developer (DFI)", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-04-30T18:01:10+03:00", "skills": ["языка sql и опыт работы с postgresql", "Python", "postgresql", "Бэкенд разработчик", "ос linux"], "url": "https://career.habr.com/vacancies/1000156674", "requirements": "Уверенные знания Python (понимание того как работает память, подпроцессы, асинхронность, тайпхинты); Знание языка SQL и опыт работы с PostgreSQL; Понимание регулярных выражений и языка XPath; Умение работать с различными форматами данных (XML, JSON); Опыт в Web Scraping; Базовый опыт работы с ОС Linux.", "conditions": "Задачи: Расширение, доработка и переработка текущего функционала системы DFIS. Разработка новых интеграций со сторонними АПИ; Написание скриптов по сбору/парсингу данных из различных источников (веб-страницы, форумы, телеграм-каналы, файлы); Структуризация данных (написание конвертеров, автоматизация процесса обработки данных); Корректировка правил парсинга (XPath, регулярные выражения) в уже существующих решениях;"}
{"id": "1000157433", "title": "Старший Java-разработчик (ЕСУ, Мониторинг и аналитика телеметрии)", "company": "БЮРО 1440", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-04-30T17:02:08+03:00", "skills": ["контейнеризацией", "Старший (Senior)", "большими объемами данных", "Scala", "Kubernetes", "PostgreSQL", "MongoDB", "включая написание bash", "Linux", "Бэкенд разработчик", "Spring Boot", "и опыт использования брокеров сообщений", "spring boot", "Python", "ClickHouse", "linux", "Java", "инструментов управления данными", "ООП"], "url": "https://career.habr.com/vacancies/1000157433", "requirements": "Опыт работы в качестве разработчика на Java/Scala не менее 5 лет; Практический опыт анализа производительности и мониторинга JVM-приложений; Глубокое понимание структур данных, принципов объектно-ориентированного (ООП), функционального программирования (ФП) и проектирования систем (System Design); Опыт работы с Spring Boot; Знание и опыт использования брокеров сообщений (RabbitMQ, Kafka); Понимание особенностей работы различных СУБД (SQL/NoSQL): PostgreSQL, ClickHouse, Cassandra, MongoDB; Экспертные знания SQL, включая использование аналитических функций и оптимизацию запросов; Опыт проектирования аналитических витрин, отчетов и дашбордов; Знание инструментов управления данными; Опыт работы с контейнеризацией (Kubernetes, Docker); Уверенное владение Linux, включая написание bash-скриптов и использование различных оболочек (zsh, fish). Будет плюсом: Опыт работы с большими объемами данных; Активное использование инструментов мониторинга и анализа: Grafana, ELK, Sentry; Опыт в DevOps-практиках; Проактивный подход к решению задач и инициативность в работе.", "conditions": "Работа в аккредитованной ИТ-компании; Шаг в космос - для тех, кто вдохновлен идеей покорения космоса и мечтает быть к этому причастным; Возможность выбора формата работы (офис/гибрид/удаленка); Комфортный современный лофт-офис в 5 минутах от метро \"Улица 1905 года\"; Оформление в соответствии с ТК РФ; Конкурентный уровень заработной платы - на уровне лидеров ИТ/телеком-индустрии."}
{"id": "1000156727", "title": "Старший аналитик данных", "company": "Лаборатория Касперского", "employment": "Можно удаленно", "remote": true, "published_at": "2025-04-30T17:00:59+03:00", "skills": ["Анализ данных", "Аналитик по данным", "bi системами или платформами визуализации данных", "системами веб", "sml"], "url": "https://career.habr.com/vacancies/1000156727", "requirements": "Умеете писать Python-скрипты Умеете писать SQL-запросы Умеете презентовать результаты своих исследований и объяснять сложные вещи простыми словами Имели опыт работы с BI системами или платформами визуализации данных (Superset) Имеете как минимум базовое представление о принципах работы Airflow Имели опыт работы с системами веб-аналитики (Яндекс.Метрика, GA4) Умеете работать в команде, ясно излагать мысли, понимать и убеждать коллег Самостоятельны и готовы браться за новые задачи, для которых нет готового решения Знаете математическую статистику, теорию вероятностей, основы ML Плюсом будет опыт работы с SML-инструментами Способность самостоятельно формулировать гипотезы и выдвигать практические рекомендации.", "conditions": "Обязанности: Формирование сводных аналитических отчетов на основе ранее собранных данных Выполнение AD-hoc запросов от бизнес-заказчиков Написание скриптов (Python) для сбора и обработки данных Поиск автоматизации для ручных процессов Участие в построении ETL-процессов в компании: выявление бизнес-потребностей, анализ источников данных, прототипирование и т.д. Написание SQL-скриптов для извлечения данных (MySQL, Clickhouse) Работа с инструментами SML (Social Media Listening) Работа с системамим веб-аналитики Консультация смежных команд по вопросам данных соц.медиа Разработка дашбордов и интерактивных визуализаций данных Мониторинг аномалий Проверка качества и полноты данных Формирование требований к данным."}
{"id": "1000155905", "title": "Разработчик Python", "company": "Bell Integrator", "city": "Москва", "employment": "Полный рабочий день", "remote": true, "published_at": "2025-04-30T16:27:22+03:00", "skills": ["Linux", "Kubernetes", "Python", "инструментами командной разработки", "базовыми архитектурными паттернами", "работы с платформами контейнеризации приложений", "linux", "Бэкенд разработчик", "Старший (Senior)", "и умение работать с брокерами сообщений", "Микросервисная архитектура", "Git", "ActiveMQ Artemis"], "url": "https://career.habr.com/vacancies/1000155905", "requirements": "Требования: Опыт разработки Backend приложений (Python 3.>) от 5 лет Senior Уверенное владение базовыми архитектурными паттернами; Понимание асинхронной парадигмы программирования; Желание придерживаться Best practices (KISS,DRY, etc.), использование PEP8, типизации данных; Практические навыки работы с платформами контейнеризации приложений; Навык владения любой системой оркестрации контейнеров, плюсом если это Kubernetes; Опыт построения архитектур сложных систем; Умение оценивать задачи; Опыт разработки интеграционных решений; Опыт разработки приложений с микросервисной архитектурой; Опыт работы с инструментами командной разработки: Git, Jira, Confluence; Опыт работы с Linux (Bash); Знание и умение работать с брокерами сообщений (RedHat JBOSS AMQ\\ ActiveMQ Artemis, IBM WebSphere MQ , etc). Обязанности: Участие в развитии десктопного приложения AMQPUtil; Проектирование и разработка платформы для оптимизации и ускорения написание интеграционных приложений на шине RHAMQ Framework AMQ; Написание технической документации по работе API сервисов; Разработка сервисов по согласованной архитектуре; Разработка юнит-тестов; Внедрение новых технологий, инструментов и методов разработки; Коммуникация с командой, поиск и решение проблем, участие в брейнштормах.", "conditions": "Возможность профессионального и карьерного роста в компании, возможность поучаствовать в разных проектах; Опыт работы в распределенной команде профессионалов; Уровень заработной платы обсуждается индивидуально; Возможность работать удаленно на территории РФ."}
